[
  " Good on you! ",
  " Hangs the buttstock, add the right optic and a few other accessories and you have yourself a really cool Canadian C8 clone. I dig it. ",
  " Send me a pic of the receiver, left side. I'll either give you really good news or you just have a normal Enfield. ",
  " Sort of...the left side of the receiver was fitted with scope mount pads which the scope mount screws into. ",
  "\"Hey, can you fax your FFL to this guy I just bought a rifle from? Thanks.\" Then when it shows as arrived, I call the FFL and ask if they've processed it yet and if I can come get it. ",
  "\"Yea, I can shoot sub-MOA groups\"... http:\/\/m.imgur.com\/6sjwKxH",
  "$1,100.00, though it was in unissued condition and not an arsenal refinish. It was packed in the original cosmoline. ",
  "$1,500 which wasn't an incredible once in a lifetime deal, but for the condition and what others have sold for on Gunbroker, I feel I did pretty well. ",
  "$3,500",
  "$700 now, $1,000 in a year. So no. ",
  "$800 less than buying new at the local shop ($1,699 plus Tax). I paid $1,000 plus transfer fee. ",
  "\/u\/moeguns_derrick gets banned from r\/ar15 because mods can't tell airsoft from real deal. Mods get called out. Ban said person who calls out mods. Salty. ",
  "\/u\/turn_down_for_hwhut convinced me today to pull the trigger on this Ohio Ordnance 1918A3 BAR. Just got her home, but from a quick look it looks to be one of the early builds where they used USGI parts. Even spotted a crown on the magazine catch...Canadian? This is a long time coming, and I'm happy to finally have my dream rifle. ",
  "10-4 thanks for the information. I'll pass on it. ",
  "10-4. Just to be clear I could care less about channel views or building a channel. Just wanted to share a great rifle. ",
  "11:27  looks like that screw driver is rubbing up against the barrel... https:\/\/youtu.be\/n8VtQt2EtJk",
  "2 plus $350 for the scope\/mount (reproduction)",
  "3,000 rounds later and she still looks new! How long do these barrels typically last for before you should consider replacing? ",
  "30 pounds heavier than me and same height. Too skinny!",
  "30.06",
  "4 never looked so good. I'm content. http:\/\/imgur.com\/QJHif1g",
  "4x Acog",
  "5 more times. ",
  "5 more times. See above. ",
  "70 degrees...ballin!",
  "90% of our meals are cooked at home. Sometimes we like to go watch the game, eat some food (things we wouldn't normally cook like wings or pizza) and have a few drinks. Is that so bad?",
  "90% of the guys building these super-AR's will never shoot beyond 100 yards anyways. \n\nThanks, it's a good looking setup (courtesy of the corps). The UID label came with the rifle. ",
  "A 10\/22...really any .22 for that matter. ",
  "A D700 can be had for like $500 these days (very old technology) and Gimp is free. ",
  "A collection of .308 ammunition. ",
  "A couple weeks away from bringing this baby home. The park looks like it could use some oiling. It's one of the earlier models that has USGI parts. It's only had 10 rounds through her (5 from myself). Sorry for the shitty photo, I'll be sure to post more soon once I get it. ",
  "A little off topic, but did you buy that ACOG because it's FDE? ",
  "A little weight may actually help with recoil too. Hmm...",
  "ACKCHYULLY: https:\/\/en.m.wikipedia.org\/wiki\/Ishapore_2A1_rifle",
  "AGM-65. The 84 is the HARM. ",
  "About 1.5' gong",
  "About a thousand below MSRP",
  "According to a Brian Dick, stakes didn't start until 1944. It appears to be a real Savage Sniper: https:\/\/imgur.com\/gallery\/lzt2O",
  "Actually one of the fastest firing machine guns of WWII fired from the open bolt; MG-42. The M249 which the U.S. Military uses today also fired from the open bolt. ",
  "Actually spent the rest of the day shooting prone at 100 yards. Prone to me is the most comfortable shooting. Very little recoil. ",
  "Actually this is the brick inside my home...one of those \"modern\" lofts in a rustic building: http:\/\/imgur.com\/fuXCQUY\n\nRifle was in rack condition; can't put it on safe when hammer has fallen. \n\nNot a Marine either. \n\nThree strikes, YOU'RE OUTA THERE SLUGGER!",
  "Again, I got mine on eBay but it did have markings and was nice and dark ",
  "Again, you keep going back to the whole name brand thing. It's not that. ",
  "Agreed. I bought an unissued No.5 for $400 or $450 (can't remember now). ",
  "Agreed. It's the same with mine. I always call them though and let them know something is coming. ",
  "Agreed. Unfortunately with me I'd be cleaning the cone, front sight, feed tray, anything that came in contact with any residue. ",
  "Al Basrah? That's the only map I play now. ",
  "All of these were shipped to my FFL from out of state sellers. My local Armslist sucks. ",
  "Also because I didn't build my AR on a PSA\/Anderson lower. ",
  "Also, your S51 stamp looks correct: http:\/\/imageevent.com\/badgerdog\/britishservicerifles\/1942no4mk1tsavagelessscope?p=94&n=1&m=24&c=4&l=0&w=1&s=0&z=9 ",
  "Always a fun process! ",
  "Ammo?",
  "And people say I post my BAR too much. Jesus ",
  "And photoshop. Though it is possible with Gimp, which is free. ",
  "And the ACOG. Army uses the M150 while the Marines use the RCO. ",
  "And the ugly M-Lock handguard...",
  "And wrong...",
  "Any way to remove that hideous lower logo?",
  "Anything less than 100 will be boring to you now",
  "Anytime man. Hopefully I'll have a BAR soon as well!",
  "Applies brakes while landing on a carrier...you really think he knows what bolter means? Lol",
  "Are we talking normal scopes? You can't compare an ACOG to a 12X scope...different animal. ",
  "As an owner of the same ACOG, it could use a little work but it's not bad. The bullet drop compensator works, and as others have mentioned, the tip of the chevron is ranged at 100 meters. Aimpoints are used a little different. Their zero's are more so \"aim at the chest and from 0-300 yards you'll hit the upper torso\". \n\nHere is a video of my AR-15 with the ACOG that has a still of the reticle: https:\/\/youtu.be\/TaH5UU0jr14\n\n",
  "Assuming the throttle detects aren't worn out and the sticks internals are in good shape, do it. ",
  "Awesome set of rifles! Love the wood on the 03A3!",
  "Awesome stuff. For all the naysayers to BUIS, as someone who was there, what's your response?",
  "Awesome! I'm a big Enfield enthusiast. Your slings are backwards FYI. You want the claws facing the stock ",
  "Back right guy is so stoked on how German he looks. ",
  "Beautiful ",
  "Beautiful ",
  "Beautiful Savage. ",
  "Because 150 yards on steel is no challenge and I wasn't going for a tight group?",
  "Because we're having fun shooting steel at 150 yards. ",
  "Been meaning to get a new photo of the group outside. How's the A4 coming along? I'm really wanting an SP1 lately. ",
  "Besides the owner, I was in charge of the F-4E project for about a year+. I recognize the work. ",
  "Best part is I can use a shop vac to vacuum! ",
  "Best part is I just now watched the video and he started it off exactly like that. ",
  "Both left at home",
  "Both the magazine and furniture are polymer. \/u\/JakesGunReviews should be able to shed more light on the magazine.",
  "Bought a No.1 MkVI, what I believe to be a Dunkirk \"emergency rifle\" per Ian Skennerton's research for $400. Today was a good day. Going to have t remove the shellac, but besides that she's good to go:  http:\/\/imgur.com\/a\/4Qzmm",
  "Bought it locally, had been eying it for a few years and finally saved up enough to pick it up. ",
  "Boyd right?",
  "Buddies grandson joined us in shooting today. He had a difficult time shooting the BAR, even in prone, but he kept at it! ",
  "Buddy of mine has been brining his grandson shooting with us the past few times. Pretty impressed how quickly he picked up the concept of the RCO reticle. In short time he was nailing the gong at 300 with consistency. Can't even imagine myself doing that at 10 years old. As for the rifle itself, we just put the 5,000th round through it today. Still holding strong with no failures or damage. Good day all around. ",
  "Buddy of mine trying out the Enfield Sniper. This one was made in 1942 by Savage. Recently I've found that shooting from supported positions at moderate range (50-200 yards) is somewhat boring. Been enjoying working on unsupported positions. ",
  "Buddy? Pfft",
  "But are you ugly? https:\/\/www.reddit.com\/r\/amiugly\/comments\/3l04ru\/m21_tell_me_what_im_doing_wrong_because_obviously\/",
  "By the time you set this up the target will no longer be where it was, unless you predict, but then you're still guessing that this additional angle will give you the maximum range you need, so your target better be at the max range point or this is pointless. ",
  "Calm down. Just asking as most were issued with TA31RCO's. ",
  "Calm your tits. I was wrong thus my edit. Jesus Christ. ",
  "Camaro, Mustang, and a Nissan Altima...?",
  "Can they please first fix CCIP in the mirage...? Please?",
  "Can you imagine if the allies had AR's during WW2? And F-14's?!??",
  "Can't operate with chicken wings. Going for some the Tim Tebow look. Watch out! Rear sight up for optimal pump. ",
  "Can't tell if this is sarcasm...we were preventing the enemy at Souk from being effective in their defensive positions. ",
  "Care to elaborate? ",
  "Care to elaborate? ",
  "Careful...you'll never have enough. Nice start!",
  "Cat yoga",
  "Cheap as in price or quality?",
  "Classy",
  "Clearly you can't read. Can't touch dis",
  "Close. Pretty good deal considering they're out of stock (I guess a 2 year waiting period?) and it's an early build with all vintage parts (sans receiver and fun switch components). ",
  "Closed on Sunday...wtf",
  "Comfort. I use it as a support for my palm ",
  "Completely agree. I got lucky and paid shooter price for this one. ",
  "Congrats! ",
  "Congrats. Can't tell shit about the rifles. ",
  "Continuing the white background theme, here is a shot of my 1984 M1A in four different USGI M14 stocks. Undoubtedly the tiger stripe is the coolest (and the heaviest), but the walnut (second from top) feels the best; incredible grain. ",
  "Cool floor\/ceiling",
  "Could you recommend a nice vintage lever gun that's an affordable caliber? ",
  "Couldn't agree more. Looks like some space gun. Not a fan. Ugly. ",
  "Couldn't even give me 5 seconds?",
  "Dallas fan and Carrollton resident. Do they have actual jerseys, or shit like pens, napkins, etc.?",
  "Damn right! No car payment means more money for guns ",
  "Damn that's an incredible deal. ",
  "Damn zero shadows. You went the extra mile. Well done. My only critique is the gun is slightly pointed down. ",
  "Damn. I paid like 2,800 for my Z serial 114270 2.5 years ago. ",
  "Dead Fucking sexy",
  "Decided to take some inventory and snap a few pics while I was at it. The collection has come a long way since last October. Six months ago my collection consisted of the Garand, 1903A3, M1 Carbine, No.5 Mk1 and the FN AR-15. After purchasing the BAR a few weeks ago, I've decided it's time to slow down. Few more pics: http:\/\/imgur.com\/a\/OXDL5",
  "Deleted",
  "Deleted",
  "Depends on what you want in an optic. If it's a 4X with bullet drop compensator, yea it's a great deal. The MSRP is something north of $1,400. Granted this one is an older generation, still a great deal. ",
  "Did he get a new flight model or is he just making due?",
  "Did not serve. ",
  "Did some modifications to the peg board and was able to get all 7 milsurps on the wall. Also tried taking a photo with my old D700 instead of the iPhone. Came out decent but nothing beats natural light. Living in a city center can have it's downfalls...wouldn't want to lug these around downtown for a photo op. Let me know if you want any additional information on any of these rifles! Love them all and am so glad to have gotten back into collecting after all these years.",
  "Did you break into my place last night? I just woke up and haven't looked in the saw yet... https:\/\/imgur.com\/a\/5ue5Z",
  "Did you delaminates the stock? Looks good",
  "Didn't get a shot of my groups but they were decent. ",
  "Didn't know they updated them. Makes mine a SUPER RARE EARLY TRIALS RIFLE. ",
  "Didn't like the markings on the stock...hahaha",
  "Didn't realize I needed one of these until now...that's an incredible looking rifle ",
  "Ditch the lame tracers already...",
  "Do they come with the RMR mounts now?",
  "Do you believe a gun ban will keep guns out of criminals hands? Also, love how Reddit deleted my previous response. ",
  "Do you have any more pictures? The zinc buttplate is interesting (mostly seen on Savage and Long Branch No.4's) ",
  "Do you know what kind of clip it takes?",
  "Doing my daily Armslist searches and found this. Whoever gets this is lucky! ",
  "Don't leave out the part about those mummy wrapped Enfields. ",
  "Don't overthink things. Park it on a slope. ",
  "Don't worry, it's a knock off ",
  "Don't you know you can only post a gun once every year??",
  "Drop Mk82's in the A-10 then the Mirage. You'll see. ",
  "Drove an hour this morning to what I thought was a gun show...turned out I was a month early (for some reason I thought July 29th was today). Pissed off sitting in an empty parking lot, I asked Siri to find me a gun shop. A quarter of a mile away was a small mom and pop gun shop. After a about 20 minutes of not finding anything remarkable and not wanting to leave empty handed, I headed to the register with a couple 1903 stripper clips. Completed the transaction and walked out the door. Just as I was walking out the door, something caught my eye; checkering on what looked like a plastic stock among many stocks piled against a wall. Came right back in and found it to be a USGI fiberglass stock. It was listed for $100 but they ended up taking my offer of $80. With a little dusting and Remington oil she cleaned up nicely. I've wanted one of these ever since I got my M1A, but never had the nerve to order one online (impatient with shipping). In the end, I'm glad there was no gun show; would have never checked out this shop otherwise. Bonus shot of the left side: http:\/\/imgur.com\/wZ3kd6s",
  "Dude that's beautiful! Great patina and the wood looks really nice. ",
  "Dude, I don't think anyone really cares about Karma points anymore. This isn't 2013...\n\nHe got some new things for his favorite rifle that some people might find interesting so he thought he'd share. Relax. ",
  "Dude, no one is dogging your post for your lower selection...",
  "ED, please fix your aircraft lights, especially the landing light. ",
  "Easy answer is he already dropped a 31. ",
  "Edit: very cool rifles. Would love to find one someday like the two up top. ",
  "Editing posts now? ",
  "Eh...kinda snarky. Compared to the A model it's light years ahead. Also, it can support JHMCS which the F-22 can't. Always thought that was funny. ",
  "Ever heard the story (way back in the day) about a training mission in which B-1's were tasked with bombing Guam, and F-15's were tasked with defending? The story as it was told to me basically unfolded with the attackers using tankers to fly the B-1 route, fooling the F-15's into scrambling towards the tanker, all the while the B-1 came in on the deck, pitched up, rolled inverted over the cliffs, leveled off, dropped its payload, and back home. Apparently the Eagle drivers were pissed and shot up the tanker upon discovering they'd been fooled. If you've heard that story or know more, please elaborate. I loved it. ",
  "Everyone has a niche",
  "Everything you said is spot on. This guy has been reloading longer than I've been alive and said that was his first squib. Deff. a lesson learned, and something to remember next time I'm shooting and a round doesn't go off. No immediate action drills for me anymore. ",
  "Exactly what he said. In direct sunlight it's very bright",
  "Exactly. Bought one off gunsforsale for $710 a week or so ago. ",
  "Exactly. I replaced the MATECH with a Knights Armament USMC micro BUIS. ",
  "Exactly. I was having such a hard time on the boat that I figured I'd try some airfields, and was STILL having issues. Glad it's not me. ",
  "Exactly. Poking fun at the Canadian who spent 15k on two mediocre looking rifles. ",
  "Exactly. They don't like your builds, regardless of the receivers. ",
  "Excat rifle I some day want. ",
  "Fg42 mags are expensive. Apparently $3,000 wasn't enough. ",
  "Figured since it was raining outside, I'd 'shoot' photos of my M1A. This one was made in 1984 and has a 30,000 range serial number. I've fitted it with a nice dark USGI M14 birch stock and one of Sparrow Hawks faux selector kits (going for an issued M14 look).  Shoots like a dream...now only if the sun would come out!",
  "Finally a college student collection that doesn't consist of walmart .22's and shotguns. Very nice. The wood on that Garand looks great. ",
  "Finally got to shoot the BAR! Had to set the gas to the highest level using American Eagle FMJ. Rainy day so we hit up the indoor range. Poor lighting for videos but they allow full auto and 'rapid' fire so we can't complain.",
  "Finally had the chance to shoot my 1918A3 a couple weeks ago. Really enjoyed the accuracy due to the closed bolt design (unlike the full autos which fire from the open bolt). Recoil was very minimal. It was awesome feeling and hearing the huge bolt and op-rod move back and forth. Unfortunately I shot it at an indoor 25 yard range (hoping to buy some milsurp 30.06 soon to see how it does at 200 on steel). This particular one was made by Collector's Corner in the mid 90's using a Korean War era 1918A2 parts kit. I've broken it down and everything except the trigger group internals and receiver are original USGI, even the handguard. Deff. going to keep this one for a lifetime! ",
  "Finally picked up an FN M16A4. This one was found deep within Armslist for the lovely price of $800 less than if I were to buy it new from a local FFL. It was listed as used, but besides factory testing, I've yet to see any indication that it was previously owned. Hell, it looked better than the new one at the local gun shop. I'm ultimately going for a 2004 OIF look (still waiting on my PEQ-2), though to my knowledge FN was not supplying the Marines M16A4's at that time, nor have I seen any M16A4's of that era sport the UID code stickers. Either way, love the rifle and can't wait to sight it in!",
  "First time I've laughed out loud in a while. ",
  "Follows me everywhere and is already tackling steps at 7 weeks! ",
  "For all you thinking about buying the Harrier, I highly recommend this book. ",
  "For as long as I can remember I've wanted a Colt SP1. I'd seen them at gun shows (crazy prices) and all over Gunbroker (I tend to want to see an item in person before buying). Finally one showed up locally. The seller and I were able to agree on a reasonable price, and a few hours later I was driving my new (to me) rifle home; a 1983 slab side, no forward assist, birdcage flashider Colt SP1. The definitive AR\\-15 in my opinion! I've received some good tips already on what ammo to use, how to zero, etc. but wanted to share with you guys since this is the RetroAR subreddit. Sure I could have just built one myself, or buy one of the Brownells Retro Rifles, but nah. I figure if you can get the real thing, go ahead and get it, especially if it's 5 minutes down the road!",
  "For as long as I can remember I've wanted a Colt SP1. I'd seen them at gun shows (crazy prices) and all over Gunbroker (I tend to want to see an item in person before buying). Finally one showed up locally. The seller and I were able to agree on a reasonable price, and a few hours later I was driving my new (to me) rifle home; a 1983 slab side, no forward assist, birdcage flashider Colt SP1. The definitive AR\\-15 in my opinion! I've received some good tips already on what ammo to use, how to zero, etc. but wanted to share with you guys since this is the RetroAR subreddit. Sure I could have just built one myself, or buy one of the Brownells Retro Rifles, but nah. I figure if you can get the real thing, go ahead and get it. Especially if it's 5 minutes down the road! ",
  "For me it's the Garand. Always amazes me how comfortable and natural it feels. ",
  "For real",
  "For the most part they look pretty rough. I was amazed at the amount of money it took to get these back to the CMP. Though at say $500 a pop, that's $43,000,000!",
  "For the most part yes. I get the feeling it's a bunch of noobs who want to fit in with \"what's cool\". I just see the same build 10 times a day on here at least. Only come back for the ever rare refreshing posts. \n\nHaving said all that, OP's isn't that bad. Just not a fan of that stock. All too easy to get caught in something. ",
  "For those not in the know, you can buy Semi-Automatic versions of the 1918 BAR. Just picked this one up today. Have yet to play BF1, but I've seen plenty of videos of the BAR in game. ",
  "Forgot 9mm comes in boxes of 50 not 20. ",
  "Found the stock, not the rifle. ",
  "From Sparrow Hawk. Still need to fine tune the control arm (my deemed tool burnt up).  http:\/\/sparrowhawkkits.com\/index.html",
  "From the manufacturer, $4,300 when they're in stock. On the used market $5,000+. I got mine for far less. ",
  "Gah dawn...",
  "Get yourself a 14.5\" barrel with a pinned birdcage ",
  "God damn the wood on that M1A is gorgeous. ",
  "God forbid people post videos of them shooting their rifles. Lemme go get a bottle of Gentlemen Jack and a tactical knife and I'll put them next to my rifles. \"Am I doing this right???\"",
  "Good call on the Mk.2. The only one I'll never shoot is my No.5 Mk1. Almost bought a 'beater' just to shoot a few weeks ago, but was strapped for cash. ",
  "Good deal. I deff. felt something was off with the P38. May start going through all my ammo and shaking each round to hopefully prevent this from happening again in the future. ",
  "Good deals are out there. The one my friend bought was $710 shipped. ",
  "Good on you for buying what you wanted. That fucker couldn't have been cheap, but I doubt you'll be buying another 1911 anytime soon. You weans ahead and got the coolest there is (besides original World War models)",
  "Good on you. Keep the magazine in the Enfield unless you're cleaning it. They were never intended to be removed for cleaning or safety. Removing it over time will scratch the finish, especially in Fazakerly rifles.",
  "Good point",
  "Good thing downvotes don't turn Enfields into PSA lowers. ",
  "Good! The recent promotional videos have sucked (with the exception of FC3and MiG-21) ",
  "Google 1918A2. You'll see plenty. Also it's not entirely a profile view as the photo wasn't taken dead on from the side. ",
  "Got more pics of it? Beautiful",
  "Got to do it with a vet as well!",
  "Got to sit front row at the Fox Theatre as Philip Glass and his ensemble played Koyaanisqatsi live as the movie played in the background. I was like 10 feet from him. After the show, my dad and I waited out back hoping to get some autographs. Philip finally came out and was shocked at how young of a fan I was. Years later, I messaged him on Facebook asking if he remembered me. He said he'll never forget, because right after signing autographs for us, he got a call that his son was born. ",
  "Got to spend this Memorial Day shooting with a retired USMC Master Gunnery Sergeant at his farm. Seeing the old man nail the gong at 300 yards standing with his M1A and A2 was an impressive sight. I now have M1A fever, and hopefully will be buying one soon. He had asked what all I was going to bring. Little did I know he was supplying the ammo, and would let me keep whatever we didn't shoot. Going home with 500 rounds of 30.06, 1,000 rounds .223, 100 rounds .303 and 80 rounds of 8mm. He wouldn't let me shoot my ammo I brought, and refused cash for the ammo I had shot. Couldn't have asked for a better day and really honored I got to spend it with a new friend and mentor. From left to right, 1918A3 SLR, FN M4 Clone, Colt AR-15A2, SA M1A, SA M1 Garand, BYF K98K, and Savage No.4 Mk1*. \n\nAlso, couldn't have picked a worse blanket for a group photo. \n\nEdit: want to apologize to all those who served for considering this day a holiday. Thank you for everything you've done and continue doing!",
  "Great idea, but a pilot would never ever look over his shoulder during refueling. ",
  "Great photo lol",
  "Great price. Are there any cartouches on the stock? Which parts are Remington?",
  "Great rifle. I believe Enfield Enforcers were built off No.4 MK2 receivers (trigger hands from the receiver unlike the Mk1 and Mk1*'s which hanged from the trigger guard). No surprise it's a tack driver. Enjoy shooting it! You got it for a great price. ",
  "Great slings",
  "Great start. Unfortunate about the No.5 stock. I've yet to see an original No.5 stock set for sale. ",
  "Great. Now I need one. ",
  "Great...now I want a Krag",
  "Greek 30.06 isn't looking much better either. ",
  "Guess his daddy didn't let him shoot it ",
  "Guess we're just different. I'd rather have a nice vintage Corvette C2 or a new Porsche instead of eight 2017 Honda Civics. ",
  "Gunbroker has A BUNCH. If you see one in your budget, send me a PM with a link and I'll give you my opinion on it. ",
  "HEY GUYS!",
  "Ha",
  "Ha almost. Mine has the front sight guards on and a different rear sight iris. Not sure what mine is but a same one sold for $187 on eBay...just the iris!",
  "Ha no sweat, I enjoy the shitty bricks.  It is a Vickers USMC sling, you got that part right. I built this rifle as a USMC M4 Clone. ",
  "Ha thanks. I watched those videos a couple months ago. I don't think this will be one of those rifles I take apart for fun. Maybe after 200 rounds just to clean. ",
  "Ha wow. You're welcome for that deal I got you. ",
  "Haha",
  "Haha",
  "Haha I bought the blue paint pen and wrote the numbers on myself. I told you, attention to detail. I typically don't get any ghosting from the PEQ through the ACOG. If I ever get a 203 replica I'll deff. put it on the right. ",
  "Haha I felt the same way. \"Man fuck...I can't even land on an airfield...I must suck\"",
  "Haha my thoughts exactly ",
  "Haha oh god this is some funny shit. ",
  "Hahaha. Would love to see \/u\/katakanbr in a courtroom. ",
  "Halfway through our flight from Atlanta to Mexico City, the pilot came on and said Mexico is closed, we're heading back to Atlanta....original flight was scheduled for 7PM eastern time. Didn't get to Mexico Cory until 7AM the next morning. Fun",
  "Have you shot it yet?",
  "Have you shot yours? These rifles have a somewhat tedious break in process for the barrel...sounds expensive. ",
  "Haven't bought anything in a while. I think I'm good on Enfields. Would love a clean M1917 or WWI 1903...still thinking about that BAR, or an original K98...I can't decide! Help!",
  "Haven't done a thorough breakdown yet, but the bolt, op-rod and trigger group are TRW (need to check safety and hammer). Front sight is NM. Rear sight assembly looks GI. ",
  "Haven't ever looked into them. No autos btw. The BAR and AR-15 are semi ",
  "Haven't seen these recent production ones where they're making all the parts, but OOW has incredible quality control from what I've seen on my rifle. Wish the new wood stocks weren't so blonde though. ",
  "Having shot G3's and FAL's I'll take the M14 all day every day. Much softer shooting rifle, better sights, easier reload, better ergonomics. ",
  "He did! ",
  "He didn't take a pay cut: http:\/\/www.spotrac.com\/nfl\/dallas-cowboys\/terrance-williams-12355\/",
  "He hung himself apparently. ",
  "He loves the floor. Constantly cool. ",
  "He must have a good paying occupation for sure. But deals are out there to be had. I bought a No.1 MkVI trials rifle for $400 the other day. Just gotta know what to look for. ",
  "He shared his rifle with us because it's something we all have in common, and people shit on him because of how he lives, which I'm sure he's aware is not how he'd want to live but has found himself in that situation. He doesn't need to be reminded his place is small, dirty, etc. You guys are terrible. ",
  "He was referencing a post I made where I talked about buying a BAR and used a photo from Google. ",
  "He was sadly wrong. He'll learn as soon as he posts his new 'rare' rifle in M1 Carbine forums lol. ",
  "He's a German Shepherd ",
  "He's deff. not saying Big Time. I think he's telling them get down in their language. ",
  "He's got the proper gear. One out of thousands that was fucked and I happened to be the one to shoot it. ",
  "Heard something about turning 30.06 cases into 7.7? May want to look into that too. ",
  "Hell no! Let them wear that gun powder residue with pride. ",
  "Hell no. I paid $1,400. Those $1,749 ones come with Bayonet and a few other things. ",
  "Hell ya that's awesome! I built my civilian version as a USMC M4 Clone. Looks like my optic is out of date now. What other attachments are you guys getting on goes? PEQ-16 and Knights Armament 2-600 micro BUIS? Would love to see pics once you get all the goodies put on. : http:\/\/imgur.com\/xPjT6Hu",
  "Hello! Would love to see all your creative Christmas\/holiday card ideas! Dogs name is Vander. Thanks!",
  "Here are all the pics I have of mine. My iris is the deluxe iris (saw one sell for $180). It has a manual aperture much like the F-stop in a camera lens. Also has different color lenses. You need two mounting screws. Make sure when buying one it comes with the screws: http:\/\/imgur.com\/a\/ACRZ3",
  "Here are the instructions: http:\/\/sparrowhawkkits.com\/dummy-kit-installation-instructions.html",
  "Here are the pics I have. It's going to need some work for sure: \n\nFixed: http:\/\/imgur.com\/a\/4Qzmm",
  "Here is an FSX version: https:\/\/youtu.be\/d8zjTdcX768",
  "Here is another Savage with no stake marks: https:\/\/imgur.com\/gallery\/Ye1mX\n\nObviously the mount and scope are reproduction, but the wear on the pads is consistent with the rifle. ",
  "Here is mine for reference (which was verified by Brian Dick of www.bdlltd.com in person): https:\/\/imgur.com\/gallery\/bOZZg\n\nYour check piece looks correct, and I've yet to see a clear reproduction have the S51 stamped buttstock. \n\nI'd email the photos to Brian and see what he thinks. Make sure you get the serial number as that cocking piece is from an early 1943 Savage. Ask to see if the rear sight is marked S for Savage. \n\nLastly, ask him how many grooves the barrel has. Standard Savage barrels were two groove. If this rifle is real, it'd have a 5 groove barrel serialized to the rifle (owner would have to take handguard a OFF to verify serial number). ",
  "Here ya go doofus: http:\/\/m.imgur.com\/a\/yK9sA",
  "Here ya go: https:\/\/www.ebay.com\/i\/253558356946 ",
  "Here you go, read this (note, neither example has staked mount pads): https:\/\/www.milsurps.com\/content.php?r=194-1942-No.4-Mk1*(T)-Savage-Sniper-Rifle-(less-scope)\n\nClick Photo Pictorial to see more. If you're not going to buy it, please let me know and provide me sellers contact info.\n\nEdit; Also, nice Patek. A real fuck off watch",
  "Here you go: https:\/\/www.ebay.com\/itm\/302164002275 ",
  "Hey I'm not the one who posted the picture. I thought this was America! ",
  "Hey guys. Thanks in advance for any advice. I heard what sounded like a clock and discovered this random leak. I have no idea what to do (tried calling local plumbers, no response). Is there a fix I could do? Something I can get at the hardware store? ",
  "His grandpa had one rule for him...\"Don't touch the fucking guns unless someone tells you to ya little dick!\"",
  "Hmm, I count 7 for me. Jake wins! ",
  "Hmm, unless you're within an hour of me...I've already got that. ",
  "Hmm. Can you price me up a quote for the same thing Ohio Ordnance does for their 1918A3's?",
  "Hmm. I'd rather spend that money at one of the local bars for a few drinks and dinner for the chick and I. ",
  "Holy shit, I think it may be one of the Dunkirk \"emergency rifles\". Look at Ian's comment about the serial range. Mine falls within that range. http:\/\/www.milsurps.com\/showthread.php?t=49200",
  "Honestly I just went with an airsoft PEQ-15 for my M4 build. No way I'm paying thousands of dollars for a laser I'll never use. ",
  "Honestly I think it's just a seam they didn't bother finishing. It's the same (though not as pronounced) at the back of the receiver above the pistol grip: http:\/\/imgur.com\/wvBg2vJ",
  "Honestly I'd stick to Armslist. A lot of guys ship even to FFL's. just make sure you ask them for a lot of pictures to make sure the rifle is original. I've found Armslist sellers to be less knowledgeable and thus their pricing much lower than Gunbroker sellers. ",
  "Honestly dude, if you want to get on Skype or FaceTime I can help solve your problem in about 5 minutes. PM me if interested. For now stop taking it apart and ordering new parts. ",
  "Honestly, was probably drunk one night. ",
  "Honestly...meh",
  "Hope they're not all CAG birds...",
  "Hope you never have a ND. ",
  "How about a burger, beer and I drive to CMP?",
  "How about some chamber flags",
  "How about the crazy drop of the nose from even looking at the throttles ",
  "How far do you shoot?",
  "How many people have actually held a knights armament quad rail...they're light as fuck. ",
  "How much do you guys charge a simple cut out case (no fancy logos)?",
  "How much for cash",
  "How much you looking at for it?",
  "How much?",
  "How rare are we talking? ",
  "How'd she do at the range? We have a 14 week old GS and I'm not sure if it's something I should expose him to or not. ",
  "How's old Archie doing these days...",
  "How's the time so when winter rolls around they're growing in the cold instead of the heat. Love our German Shepherd. He's been really good so far and smart as hell. ",
  "Huh?",
  "I actually slipped a K98 into the collection and she didn't notice until I asked her if she noticed the new German rifle. If I got a good deal I'll let her know what I spent vs what it's worth. That usually calms her down. She'll never know what the BAR cost unless I need to sell it in an emergency. ",
  "I agree. Check out Lary Vickers. Try-gee-con",
  "I agree. I shoot the sniper all day...my thing with the Jungle Carbine is there are plenty of \"shooters\"'out there to be shot. This one is museum quality. I'd like to keep it that way. The problem with the No.5's is the finish on the metal parts tends to either flake or rub off. It's some kind of baked on paint. ",
  "I agree. Not digging the slim hand guards and weird buttstocks. ",
  "I believe it's made by Element. Can't remember if I got it in eBay or Amazon ",
  "I believe the Marines are getting the FN's ",
  "I believe there were only a few hundred M39's converted to snipers during the war. They had the turret mounted scopes (similar to the K98 snipers). Great start to a collection!",
  "I believe what you're seeing is the exit wound or more specifically the skull opening up from the pressure the round created. ",
  "I can only downvote once. Damnit ",
  "I did. I wanted it as close to USMC as possible. I remember when I sold an ACOG many years ago, I was asked if I brought it back from Iraq. That's when I learned there was a black market for stolen military goods. Not worth the risk. ",
  "I don't care if they have an advantage. They can't touch me anyways. ",
  "I don't plan on making any modifications except adding a 3 prong flash hider. Thanks though ",
  "I don't see a difference in the two images. Both diamond. Am I missing something?",
  "I don't understand why we don't do this more. Every other team has no issues throwing bombs on us, let's return the favor more. ",
  "I felt the same way when buying my Enfields. I finally bit the bullet and got a reloading setup. Now I shoot worry free. You could do the same with your K31. Just buy 300 rounds and reload them 5-6 times each (neck size only)",
  "I finally was able to take the 1918A3 out for a proper shoot. The first time was in a dark indoor range at 25 yards. Yesterday, I tried at a local WMA range, but it started pouring rain. Today I finally got to enjoy the rifle outside and shoot some steel targets. At 150 yards and with the bipod, it was pretty easy (would love to have access to a longer range with steel targets). So far she's a dream to shoot, though I'll probably have to start reloading my own ammo as the Greek stuff is becoming pretty scarce and nearing $1 per round.\n\n Made a little video talking more about the rifle for those interested. By the way I could give two shits about YouTube views or trying to 'build' my channel. Just trying to share a great rifle with the guns community. One thing I've notice about the rifle, and you'll see it in the video, is the trigger reset almost seems to have two stages. You can see and hear in the video the trigger did not fully reset on the second and third shot: https:\/\/www.youtube.com\/watch?v=AkuVG9eABio",
  "I forgot about that. I know a guy who has a very similar rifle for the same price if you're still in the market for one. ",
  "I found it at a gun show for $90",
  "I got it for $3,500. ",
  "I got really lucky with a lot of these prices. Just a different perspective from the other guys post with only 2 guns. ",
  "I got that one, though off eBay. Great once broken in. ",
  "I got to sit in that very aircraft before it was sealed shut and raised on pedestals. ",
  "I gotcha. I'm really not trying to be pretentious. Just sharing what I buy as I don't see many like them on here. You're right, a lot of leg board shots, though it's typically when I get a new gun and that just happens to be where they are. ",
  "I guess the reference to the Canadian who posted his 2 guns for 15k went over everyone's head..\n\nEdit: guns not gays...",
  "I guess this is the new BAR...got this unissued Sykes Walnut USGI M14 stock a few weeks ago. Could not believe the grain and color on it. If you have an M1A I can't recommend enough getting an original M14 stock. Sykes (I believe) made stocks for Springfield M14's as a subcontractor. I'd still one of these days like a really dark walnut stock, but for now I'm extremely happy with the red tones on this one. Would love to see everyone else's M14 stocks. Bonus foot shot: http:\/\/imgur.com\/qUoaLak",
  "I have 4 and at one time had  8 (different from the 4 I have now). It's never enough. ",
  "I have a penis. ",
  "I have an AR. Any large bore rifle, whether milsurp or hunting will hurt shooting off a bench. ",
  "I have blinds. They were up. ",
  "I have no idea what Discord is. Do elaborate. ",
  "I have not. I really would want a GI stock. Thanks though. ",
  "I have the M4 and absolutely love it. This is my inexperienced gf at 600 yards. If you want a \"military\" AR-15, I think it's the best route to go. \n\nI wanted a rifle in the configuration seen in the photos. After researching about building my own, and factoring shipping, tools required to build, having to pay someone to pin the 14.5\" barrel, etc, it was worth it for me to just buy the FN. I think I got it for $1,499 or something like that. \n\nEdit: a few more of the receiver \n\nhttp:\/\/m.imgur.com\/a\/quXTR\n\nhttp:\/\/imgur.com\/sxUexoV\n\nhttp:\/\/imgur.com\/y64Csu8",
  "I have, and what I meant by never having the nerve to order online was order from Fred's. I like to see the exact item I'm buying from. Will deff. check them out for their other items though. Thanks!",
  "I haven't seen any recently. ",
  "I hear ya man. Keep in mind supplies are drying up and prices are rising very quickly. May be wise to buy what you want now",
  "I hear ya, but I see it a little different. When I see a post with a super detailed breakdown of what's going on in the picture, I'm thinking to myself, \"okay that's cool. I don't have much to contribute other than saying cool story.\" The OP has said everything there was to be said. He set the tone. \n\nI enjoy the posts where it's a photo with a less detailed description. It opens up many more conversations and talking points. When I post, my end goal isn't to see how many \"cool collection\" comments I get. I'm looking for other Enfield enthusiasts to chime in and share their rifles and experiences. I'm looking to discuss the advantages\/disadvantages\/differences between a $1,500 FN AR-15 and a PSA built rifle. I'm looking for other people who own BAR's to share their thoughts on their rifles and maybe give some tips and tricks. \n\nThe thought that we post here to collect internet points is beyond me, and it always amazes me that's the go to insult; \"KARMA WHORE!\" There is no fun in looking at post karma points. There is however plenty of fun in discussing different rifles you're interested in with likeminded people. I come here for discussions and nothing else. Others need to realize that. And if you're not interested in the talking point, don't shit on everyone else who is or worse the contributor. ",
  "I hear ya. Need to fill the gap with an SP1...drove to the Cobb County Civic center yesterday with my M1 Carbine, ready to trade for an SP1, only to realize yesterday wasn't July 29th...",
  "I hear ya. That's why I don't have one yet, not knowledgeable enough to feel comfortable buying one. ",
  "I hear ya. To be fair, before watching this tutorial, I had no idea how to make photos like this. After a few attempts, it became easy and I can crank these out in about 20 minutes: https:\/\/youtu.be\/pDueg7FL7sE",
  "I hear ya...the CMP range is an hour from me and I've only been twice...600 yard electronic range and I've only been twice. Pitty. I did find a WMA range 40 minutes from the house that's free, but they only go out to 100 yards. ",
  "I just sent Brian a pic of the pads so we'll see what he thinks. IMO they look genuine (notice the wear on the finish. Reproduction pads show significant machine tooling marks). ",
  "I knew something was fishy as fuck with SA when they didn't go back to putting bayonet lugs on their M1A's and shipping them with 10 round magazines. ",
  "I know r\/guns isn't the biggest fan of YouTube videos, but pictures can't really do this rifle justice. It's a 1943 Savage Lee Enfield No.4 Mk1* that I picked up back in November. Was surprised at the consistency and accuracy of the rifle. Had no problem picking off coke cans at 150 prone and sitting. Even hit a few standing. It's deff. my new favorite shooter. ",
  "I know this comment will get buried, but this guy was out of ammo (notice the bolt in the forward position). The 1918A2 fired from an open bolt. He must have run out of ammo (at least in that particular magazine) and went for a grenade. ",
  "I know, I know...another photo of my gun rack...but look closer! I've added a BYF 44 K98 to the collection and met a great collector in the process. This is my first ever axis milsurp, but hopefully not the last. They're deff. built differently from allied rifles (not in a bad way, just different). Really excited to see what she'll do at the range. \n\nThe M1 Carbine has been demoted to the corner, and I still don't know what to do about the Lee Enfield No.1 MKVI to the right...",
  "I like him landing with half flaps too. Cheater!",
  "I like it man. Get an aim point and make this a 3 gun rifle. ",
  "I like my Carbine but I agree. 20\" is more fun!",
  "I live about an hour away and work for the company that built it...only been twice. I am ashamed. ",
  "I love my knights rail. I actually think mlock and key whatever are ugly as sin. ",
  "I love my wallet. Let's me buy shit. ",
  "I meant just throwing the deep ball in general. ",
  "I meant with the money you spent on those rifles, you could have built a clone correct SPR...",
  "I offered the same and he put this edit about money lol",
  "I picked these up yesterday, but was unable to get a good photo for Milsurp Monday. Maybe we can call this Pickup Tuesday? \n\nAnyways, the M1917 came to me as a trade for my K98K I had purchased a few months back. The original seller realized he wanted it back, so he offered cash or the M1917. I picked the rifle. It's a Remington with a March 1918 dated barrel. Looks to have been through the arsenal refurbish program as there are a few stock repairs and a mix of Remington and Eddystone parts as well as 2D stamps. The wood is very dark from storage, but I think I'll leave it as is. Feels great. \n\nBelow that is a 1984 Springfield Armory M1A with TRW bolt, op-rod and trigger group. It came with a National Match barrel and front sight. The rear sight has the lock bar which I've always wanted on a rifle (Garand or M1A). This one looked to have been a safe queen. Had to sell my No.1 MKVI to get the funds, and all in all I'm happy with my decision. This one will deff. get more range time, and I have enough Enfield a to go around. Eventually I'd like to get a GI stock and one of those Sparrow Hawk dummy selector kits. \n\nBonus closer look: http:\/\/imgur.com\/vV4HjQr",
  "I prefer to call it a functional reproduction at 1\/50 the price. ",
  "I priced a SAM-R upper. It was $3,000+ without the FSGB... :(",
  "I saved for a long time. Been looking at buying this one ever since I shot it 2 years ago. ",
  "I see what could have been a Mk12 Mod 0\/1...",
  "I sold mine on GB and had zero help from friends lol. Can't remember the sale price, maybe $1,100? ",
  "I still play the objective...",
  "I think I just found my next AR...holy shit!",
  "I think I've seen that video..never. Priced the dust covers. Will have to check it out again. Thanks",
  "I think it comes down to when you're bench shooting, the only thing absorbing the recoil is your shoulder, nothing behind it, all your weight forward of the shoulder. ",
  "I think it looks fine as is. Used the same paint as the walls. ",
  "I think it was and is a great rifle but it came too late in the game. Can you imagine Gi's in WWII with 20 round box magazines standard issue? Talk about fire superiority over the Germans\/Japanese. ",
  "I think it's real. Here is another example of a Savage with no stake marks on the pads: https:\/\/imgur.com\/gallery\/Ye1mX (obviously the mount and scope are reproduction). ",
  "I think mine is from Numrich. Google reproduction Enfield Scope and it will be one of the first websites. ",
  "I told a mod about it (Bart or whoever the guys name is) and I guess he told him to edit the knife into something less offensive? Different rules for different people. As far as history, no idea who the guy is. ",
  "I too would like to read up on this. ",
  "I used to have 10 my first time around collecting...the mistakes we make. ",
  "I want one in semi soooo badly",
  "I want to buy this. PM me a price if interested. ",
  "I was at that game...still hurts. ",
  "I was good friends with Austin's brother Dustin. Lost touch with Dustin long before he slipped and got caught up into drugs. Sad to learn Austin went the same way. Austin was a great kid who unfortunately became caught up in something many of us will never understand. I believe doing heroine is a bad choice, but I also believe once you begin doing it, it's very hard to choose not to continue, the addiction is that strong. Austin didn't want to go like this, the drugs were just too much. Rest easy bud. ",
  "I was hesitant to watch that based on the movie poster, but damn if it wasn't a great movie!",
  "I was poking fun at the guy who posted two rifles for $15,000 earlier",
  "I was wondering why it wasn't centered. And is that the secret to MP? No shadows? ",
  "I wasn't going to say anything...thought I was out of practice. My thoughts are the flight model in the release version is either wrong or became corrupt. ",
  "I went to one of those \"Irish bar\" restaurants with the lady for some appetizers before a movie. I had a really sore throat (beginning stages of a cold), so I asked for a glass of water and a glass of milk. They brought be the biggest fucking clear plastic cup they could find filled to the brim with milk. It was awkward but I drank it up. ",
  "I will once I get some ammo for it. ",
  "I wish the impacts looked like that again. They used to. ",
  "I wish you didn't tell us this...FUCK! Now I need one. ",
  "I wish! Don't think the significant other would be too excited about that. Lucky she puts up with what I have now as it is. ",
  "I wish! She doesn't enjoy shooting much these days (had a 5.56 case jump inside her shoot and burn her ankle. Ever since then...",
  "I wonder if in 100 years people will be posting about sad they are with PSA complete rifles coming into the shop with the original stock, flash hider and hand guard missing ",
  "I would like an M39 before they get any more expensive. ",
  "I would say those cartouches look a little suspect, especially the P at the wrist simply because the pistol grip looks like it was sanded and rounded off slightly. Maybe restamped by the previous owner to add value. Either way, beautiful nonetheless.  Super jealous. ",
  "I wouldn't mind a war time SA stock either. ",
  "I'd agree. They are very comfortable rifles. I don't enjoy the aesthetics but I can appreciate the comfort of the design. ",
  "I'd have to say the M1A. I'd never shot one before. To me there are very few rifles as good looking as them. Next would be the K98K. Something about being able to hit a steel target 300 yards away with notch sights...very rewarding rifle. \n",
  "I'd just like a nice clean Springfield with circle P and maybe the DOD stamp (post war) or some SA stamps. Looking for minimal dings and set with matching handguards. Thanks",
  "I'd rather buy an SP1 and 30.06 for the BAR",
  "I'd really like to stick to a German K98 when it comes to the Mausers. I agree, they're really overpriced. That being said, now is probably the time as I don't see the price ever coming down you know?",
  "I'd recommend Arisakas. I don't own one but I've handled a few and they're VERY interesting rifles. They're really slim and sleek, unlike say a Garand, yet still just as comfortable. ",
  "I'd say yes as not everything is implemented yet (gives you time to catch up and learn the basics before it really becomes a study sim), there are MANY well made tutorials, the module comes with interactive training missions, and by learning it you'll be able to fly most any other module in DCS with ease afterwards. ",
  "I'll have to check when I get home. They're pretty old. Any way to remind me?",
  "I'll have to count too, but Brian and I pulled the handguards and he confirmed the proof markings as Holland & Holland and that it was the correct groove # (pretty sure it's 5). ",
  "I'll probably end up making something out of hard plastic ",
  "I'm about to give up mod status to u\/venomousbeetle and u\/W__O__P__R",
  "I'm going to need to see more photos of that long branch sir. ",
  "I'm going to teach my daughter to throw overhand ",
  "I'm gonna stick with my KAC RAS. Not a fan of these new rails that look like they came straight from TAP-OUT or a Spawn movie. ",
  "I'm guessing they're at Nellis",
  "I'm like 15 miles east of AL off I-20",
  "I'm not so much talking brands, I'm talking the total package. ",
  "I'm on the way to pick mine up. ",
  "I'm reading that the serial number might mean it was a trials receiver stored and put back in production in 1941",
  "I'm really just going for the authentic M203 look. ",
  "I'm really not too sure to be honest. Grip maybe? Manufacturers did it on and off through production. Would love to know the answer. I do prefer Enfields with grooved hand guards...",
  "I'm the same way. I need to either see it or get a lot of pics. ",
  "I'm using Annie dated D700 but as long as you have a point and shoot, I don't see why you wouldn't be able to get the same results. Here is a tutorial video that helped me: https:\/\/youtu.be\/pDueg7FL7sE",
  "I'm waiting on a mod to try and say it's a fake bolt and still airsoft then ban you for no reason. ",
  "I've been lucky in finding most of these well below market value, otherwise there's no way I would have all these. ",
  "I've got a spare Enfield bayonet, some .303, some 8mm (don't even have a Mauser anymore). ",
  "I've got two and love them. If you want one it'll most likely be a Savage. http:\/\/imgur.com\/yfnnpMx",
  "I've gotta say, out of all three rifles it hurt the least. Nice flat butt plate, unlike the Enfields rounded slippery butt plates. ",
  "I've made two new guys mods with full permission, they should be able to handle that.",
  "I've never seen a landing light that was brighter than the sun during daytime...fix this shit already ED. ",
  "I've seen some stock sets go for $400+..crazy",
  "Idk man...having the bullet drop compensator in a 4X optic is tits. Love being able to know exactly where to hold, whether from 100 or 600. Magnified red dots will get you there, but point of impact depends on how you set your zero. ",
  "Idk, I've seen him mar a few rare pieces...",
  "If I ever sell it (unlikely) you'll be the first I contact. ",
  "If I post my Enfields it'll be labeled as a bragging shitpost...oh well. Love the wood on yours!",
  "If it's a full auto BAR it'd make a terrible sniper rifle (open bolt). Closed bolt semi autos can shoot sub MOA though",
  "If someone really believes I destroyed a rifle with a butter knife...they're already lost. ",
  "If you ask for a certain picture and get it, have their name and address for payment (google\/facebook to confirm it's them), and talk with their local FFL (if they're shipping through FFL), you're good. The people who get scammed are idiots who send PayPal payment after an email saying \"Send payment via PayPal). ",
  "If you want a girlfriend I can give you a few tips. It's not that hard. ",
  "If you're going to own multiple AR's, this is the way to do it. ",
  "In English please? I just downloaded gimp a few days ago. ",
  "In my opinion, as with all Razbam aircraft, the CCIP is fucked. You shouldn't have to be going 450 knots at a 45 degree dive to see your retical only appear at like 1,000 feet. ",
  "In real life you can't see the front sight post unless you try really hard to find it. Also, all you see is a sharp crisp circle; the eye relief is so short you don't notice the rear of the ACOG like it's shown in game. I have one: https:\/\/youtu.be\/TaH5UU0jr14",
  "In that condition, $1,800+ easy. ",
  "Incredible price ",
  "Incredible thanks so much!!!!",
  "Inspired by \/u\/12gdv 's recent post, I broke out the DSLR and gave it a try. Still have a lot of learning to do, but I'm happy with the initial results. This is my FN Military Collector M4 Carbine made to look as close as possible to the USMC M4's currently in service. Hopefully with a little more practice (and better lighting) I'll get an entire collection post like the one 12gdv posted recently. ",
  "Interesting concept. I will probably just let the brass hit on mine. Don't mind brass marks. ",
  "Iphone 7...my screenshot didn't work",
  "Is he saying big time, or get down in another language?",
  "Is it a trials rifle? The disk on the stock is indicative of one. ",
  "Is that a mobile home?",
  "Is that an SBR? ",
  "Is there a medical term for having a nose like that? I see it so often and it's trademarks are always the same. Not comparing it to down syndrome, but it's similar in how all people with down syndrome look alike. I see this nose so often. It reminds me of a pig. Nothing against the guy, just asking. ",
  "Is there any way to block seeing these gaming subs? I really don't have any interest in them. ",
  "Is this one of the Military Collector M4's? The markings are way different than mine. ",
  "Is this where the rumor of Marines eating crayons comes from?",
  "It came with the rifle. It's an FN military collector series rifle. ",
  "It is! No idea who the manufacturer is. Any ideas?",
  "It is. It's one of the Savage snipers that were never fitted with scopes or mounts, but went through the rest of the conversion process at Holland & Holland. My scope and mount are reproductions. ",
  "It is. Probably the most fun out of all of them!",
  "It only fires in full auto..",
  "It seems like those who have the nice savages aren't selling them. Then randomly, someone who doesn't know what they have lists one for $400. ",
  "It was a great day. Details on the A2? ",
  "It's a 1984 model with TRW bolt, Trigger group and Op-Rod. National Match barrel and sights. Couldn't pass up on it. I'd never buy a new production one. ",
  "It's a Lee Enfield No.4 Mk2",
  "It's a carry handle. No barrel changes were possible in the field. ",
  "It's a laser\/light thingy ",
  "It's a replica of what's called a PEQ-15 (laser device for target illumination). The tape is covering a band of fiber optic cable encased in a hard plastic because in direct sunlight, the retinal is very very bright. Covering the fiber optic reduced the amount of glow and makes seeing the 300m post easier. ",
  "It's a semi auto version so just like any other rifle. ",
  "It's a semi-auto clone. It was made by Collector's Corner in the mid 90's (Robert Landies company name before it became Ohio Ordnance Works). If I had the money, I don't think I'd buy a new production gun. I like having all the USGI parts on mine, and sadly they ran out a while ago once the parts kits dried up. Still a great gun, the quality of work is beyond anything I've ever seen. ",
  "It's a very cool aperture...haven't fired the rifle yet but it's nifty! Saw one go on eBay for almost $200. I've been mainly shooting the Savages, but may bring the Mk2 to the range next time and see what it can do.",
  "It's actually a 14.5\" barrel with a pinned flash hider making the overall length just past 16\". ",
  "It's an FN Military Collector Series M4 with all the USMC fixings. I was going for a present day issued Marine M4. ",
  "It's an M1A. Semi auto. ",
  "It's black. It's heavy.  It's accurate. It's an FN. ",
  "It's free at the range. One less thing to bring. ",
  "It's genuine. I've never shot it, it's almost too nice. Search \"Unissued No.5 Mk1\" in r\/guns and my post should be there with more photos. ",
  "It's legit (look under the rear sight of the receiver) though you are righty about the bolt. ",
  "It's most certainly an A-10C. Rate if fire alone tells you that. Not enough, listen to the fly by after rounds impact. Those are turbine engines. Not an Eagle, Viper, Hornet or Apache. ",
  "It's neither ",
  "It's no L39A1...but it's mine...looking at you u\/turn_down_for_hwhut \n\nThis one is interesting as I don't know much about the rifles history. It started off as a standard No.4 Mk2, most likely one of the mummy wrap Enfields. I purchased it from a collectors family after he passed away. He must have known his Enfields as it has one of the better target sight sets ever made (IMO); Parker Hale PH5C rear sight with a \"Delux\" Iris Aperture and target front sight.\n\nThe aperture is pretty cool, as it has different discs with different colors (green, blue, yellow), and is micro-adjustable as the aperture of a camera lens.\n\nWould loved to have known if he did the modifications himself, or if he got it like this. \n\n",
  "It's not a pay cut if you weren't ever making more. ",
  "It's not my rifle for sale. Just saw a good deal and shared it. ",
  "It's super easy to find...just expensive! ",
  "It's symmetrical load weight wise. ",
  "It's the same 3D model they've had for FSX for years. Jesus. ",
  "Joining the fun. I live close to many bars, and honestly don't drink often enough to justify having liquor on hand. It's usually water when I'm at home. This computer sucks by the way. ",
  "Jungle Carbine. I'm glad they never converted these to shotguns!",
  "Just a big steel plate. Wasn't worth showing. If I ever shoot for groups I will. ",
  "Just checked my sources. We are both wrong. No original Savage was ever fitted with a 5 groove (unless at H&H). Early ones had 6 groove barrels then went to 2 groove. ",
  "Just checked the website. Raised their prices. Damn! Also, this is what I was talking about: http:\/\/www.gunbroker.com\/item\/656858923\n\nGlad I bought mine early. ",
  "Just counted mine and it has six. New barrels from H&H would be 5 groove. However 6 is still correct. See here from Brian Dick: https:\/\/imgur.com\/gallery\/e6GHE",
  "Just for you: http:\/\/imgur.com\/WWCtvgq",
  "Just got done deep cleaning the apartment and decided to take a few photos. Really proud of what we've done with this place. It's a 2 bedroom 2 full bath. We currently use the second bedroom as our shared office space. Love the openness of it all! Another shot of the main room from the back and the master bedroom: https:\/\/imgur.com\/gallery\/mu2Ty",
  "Just got done zeroing these three at 25 and about to see how they do at 100...bench shooting kills my shoulder! Will be shooting from 100 for the rest of the day. ",
  "Just like I can't justify buying a real PEQ-15 right now. The cheap $50 airsoft one I have does enough for me (was going for the look, not functionality). ",
  "Just looked at mine. You're right!",
  "Just paint it same color as wall. ",
  "Just removed myself. Enjoy guys and gals.",
  "Just watched a disassembly video. I believe the crown means Belgian. ",
  "Just watched the video again. Didn't notice any dust covers closed. Can you link?",
  "Just went through the posts with Hesalite on there. Looks like someone made an account with my name already. Also, nice to see how you really feel about me. ",
  "Keep in mind mine aren't staked either and this rifle was verified by Brian Dick: https:\/\/imgur.com\/gallery\/bOZZg",
  "Keep in mind the one you linked is the WW1 version. ",
  "Kinda like it without the rail covers. Didn't have any issues with the rail getting too hot today as we had a bunch of other rifles we were shooting. The Gp's are handy for prone but my god they're ugly. ",
  "Kitchen slash living room slash one big room open floor plan. I think it's acid treated concrete or something like that: http:\/\/imgur.com\/a7Ohigz",
  "Knights Armament ",
  "Knights Armament Company. Not sure on the model (whichever comes with the RAS kit). ",
  "LOVE the wood on this Savage Enfield. Redheads are the best. ",
  "Left to right. GBU-12. Rockets (can't tell which from here). AGM-65H, GBU-32, GBU-38, GBU-12, AIM-9M's. ",
  "Less than a year I'd say ",
  "Let's all takeoff from the same runway and then kill each other!!!",
  "Let's see if you get banned again due to mods mistaking a real rifle for airsoft ",
  "Like the others said, it's an FN. ",
  "Link no worky",
  "Lol",
  "Lol just messing with ya",
  "Lol night vision warriors",
  "Lol when the fuck would there be a carrier crosswind landing. ",
  "Lol. Figured maybe they show foe and friendly",
  "Look at that trigger guard...it's refurbished. ",
  "Looking for a quick sale as I have a big purchase coming up today\/tomorrow. Price is firm, for PayPal please add 3%. \n\nWatch is a Z serial 114270. \n\nPhotos come from seller who I purchased from last year. Watch is in pretty much same condition with the addition of a few desk swirls. Has not been polished. \n\nCan send more photos to serious buyers. \n\nPrice includes standard USPS Priority Shipping. If you'd like certified and insurance, it will be extra. ",
  "Looking forward to seeing how the Luger cycles! ",
  "Looks cooler than 90% of the shit posted here ",
  "Looks great man. You did a really good job. ",
  "Looks like a couple VG M39's from Classic Firearms. ",
  "Looks like your Enfield has half a Parker Hale PH5C. What's up with the band around just in front of the receiver? Never seen that before. ",
  "Love it!",
  "M14 or M1A with faux selector?",
  "M1917, Russian SKS, Swiss K31, Finnish M39, and I'd REALLY like to build a Mk12 Mod 1. ",
  "M2 carbines weren't select fire from the safety...",
  "MG34",
  "Make sure your barrel has the cut out for the 203 launcher under the handguard before buying an airsoft one. ",
  "Man, if I'm gonna SBR anything I'm going to splurge on something nicer than an Aero lower ",
  "Matte white project boards from Rite Aid.  They were like $2 each so in bought 10 as they get dirty pretty easily. ",
  "May I ask what you spent on the F? My TA31RCO-M4 was $1,050 new. ",
  "Maybe because we don't want new production stocks and rifles that are parts guns like the ones they're turning out these days? If you know what to look for, CMP isn't your only option. ",
  "Maybe but there are many other things I'd like before an Italian rifle. ",
  "Maybe they're letting the Hornet have the spotlight (unlike Razbam). ",
  "Meh idk, we had a crosswind and had to adjust for that and the scopes BDC being in meters and not yards once we figured out where to hold on the BDC it was easy. ",
  "Meh, maybe a No.7 for collecting but still not that fun to shoot",
  "Mine says hello. What's the serial? Looks pretty much like mine: http:\/\/imgur.com\/BxQzskS",
  "Mine says hello: https:\/\/imgur.com\/gallery\/jpls8iF\n\nDon't listen to the haters saying you could have built it cheaper. ",
  "Mine was $1,400 (didn't come with bayonet). ",
  "Mines a reproduction I bought second hand. I think I paid $350 for it",
  "More around 3K. The PEQ-15 is a replica. ",
  "More on the M1A please! I'm about to buy one that looks very similar. ",
  "More pics of that BSA please...has some very early features...are there scope pads on the left side?",
  "More pics of the Enfield please. ",
  "Most savages snipers were never issued, typically because something bad was found in the rifle. Thus the condition. ",
  "Most savages were never marked T. You'd be hard pressed to find a T marked Savage sniper. ",
  "Must be a bitch cleaning this thing after shooting corrosive 8mm",
  "My \"studio\": https:\/\/imgur.com\/gallery\/XkAhbUK",
  "My FN has the same thing: http:\/\/imgur.com\/avmh4xU\n\nGuess that's just how Fn does it? I don't have anything else to compare it with. ",
  "My bad. It's an early trials version of the No.4 Enfield. ",
  "My coworker bought one because \"they have great customer service and everyone has a Glock\". His has the manual safety, and thus the hump that rides the bridge of your thumb every time you shoot it. After buying it he found out they discontinued the whole \"we'll replace your stolen gun no questions asked policy.\"  But still, \"everyone has a Glock\" he said. Then we went to shoot it. Worst fucking pistol I've ever shot. Jeebus. Good luck with it. ",
  "My favorite Volcano. The story of the Popo and Itzta is beautiful. Have a few paintings of them: https:\/\/imgur.com\/gallery\/IqRzJ",
  "My girlfriend and I enjoy going out. We'd much rather have great food and a few drinks than a bottle of liquor. ",
  "My lighting arrangement was direct flash (I know...bouncing off the ceiling didn't work), and white resume paper behind the gun. Until I get a decent flash and diffuser, I'm going to try and take the photos outside.",
  "My thoughts are the wrong flight model code was part of the release. Wags confirmed in a YouTube video made by a former F-18 pilot that the issue is indeed an issue. ",
  "My very first AK. It's a 1988 Izhmash rifle built by JRA for RGUNS. I know...could have built my own, sent a parts kit for someone else to build, or buy an Arsenal. Whatever, I'm impatient and happy with my purchase. Original Russian Plum furniture and brake. Matching numbers. Can't wait to shoot it! \n\nEdit: oh and it came with an awesome Plum magazine with a neato commie star on it!",
  "NOS 1943 Remington 1903A3 on gunbroker: https:\/\/m.imgur.com\/a\/GLY9X#uJah0eZ\n\nI've since fired it and really enjoy it. ",
  "Nah, you can get the scopes used all day for under $1,000. ",
  "Neither. Cheap airsoft knockoff ",
  "Never have been a Scar fan, but that CQB...so sexy. Also, please sell me that Mk12. Wow. Also, love the broken down images. May do that tonight with my clone, downvotes and all. \n\nEdit: my shitty attempt \/u\/airborne11b http:\/\/imgur.com\/a\/j10ws",
  "Never thought it could happen to me, but here we are. Yesterday this 1988 Izhmash AK-74 arrived at my FFL with my name on it. I was a bit surprised when I got the call, but after a few minutes of handling the rifle, I decided to fill out the 4473 and take her home. The rifle began it's life as a genuine AK-74 built at the Izhmash factory in 1988. It was then cut down and sent to RGUNS as a parts kit, where it was later sent for assembly to James River Armory. It's not an Arsenal, but overall I'm very happy. Numbers match, has the original Russian brake, and came with a beautiful plum magazine. Now to find some ammo...",
  "Nice Enfields ",
  "Nice Faz and great price. Did they put the import mark on the receiver?",
  "Nice one",
  "Nice to see an FR-8. I've always wanted one. ",
  "Nickel plated M1 Carbine...",
  "No C-5 flying in the background? Come on man. ",
  "No M14",
  "No burst. Do you guys get issued rail covers? If so do some guys decide not to use them?",
  "No class with that gold Rolex. Could have bought a Patek...",
  "No dates that I could fine. ",
  "No don't buy it. You can find much nicer ones for $300 EASY. ",
  "No flip flops or tank tops. ",
  "No fucking shit",
  "No idea. Barrel looks brand new (won't know for a while with the break in process). The bolt is also somewhat sticky from whatever oils they covered it in while it was in storage. ",
  "No idea. You own a registered lightning link but don't know where to get an SP1 bolt...? ",
  "No one cares Razbam!",
  "No one going to comment on the BUIS? Lol",
  "No sir. That one is way too rough for $575. Look at the front band and how the stock is sanded. Stay away from that one. Also, rubber buttpad looks to have been replaced (it shouldn't stick out like that). ",
  "No that's how he got it. Taken from a dead German Elite Special Forces operator ",
  "No way! This seems like an ATF sting!",
  "No, but I did dump a few magazines as fast as I could. ",
  "No. is this a thing?",
  "No. just a flash, some paper and gimp. ",
  "No. semi-auto only. Though if I ever come up on $20,000 extra cash I may have to get myself a tax stamp. ",
  "No...one...cares...about...these...5...years...late...videos...",
  "None of those do it for me, but I can appreciate the collection. Which would you never part with, and which if any do you regret buying?",
  "Nope, another thing I'll have to track down. Has the slot for it though. That's what tipped me off. ",
  "Not a dealer. BAR is a semi auto only and the AR-15 is semi auto only. ",
  "Not a lot of videos of these on YouTube so figured I'd share mine. This is a 1942 Savage Lee Enfield No.4 Mk1 (Scopeless T). It's known as the Scopeless T due to the fact that most of the Savage Enfields sent to Holland and Holland for sniper conversion never completed the process (being fitted with scopes and mounts). Great shooter and I hope to get some better videos of it down the road. ",
  "Not everyone lives the pretty lifestyle portrayed on TV. Cut the guy some slack. You don't know anything about his life. \n\nMoreover, for all we know this is one of the few good things he has going for himself right now. He posted here sharing one of the few good things in his life, something he's proud of, and you guys shit on him because his room is a mess. Look at the walls, he most likely lives in a mobile home. You guys make me sick. ",
  "Not having a huge A on it",
  "Not local. I think California.  ",
  "Not military at all honestly. I just built the clone with a lot of attention to detail. Bought everything but the sling new. ",
  "Not my auction. Stumbled upon this really rare No.4 Mk1* T (TP). It's missing a screw in the check rest and the scope mount, but looks to still have the scope mount screws. Congrats to whoever gets this gem! No more gun money for me otherwise I would have kept this auction to myself. ",
  "Not my boots and hands off the China!",
  "Not really brother. I just bought an M1A and a bunch of stocks. ",
  "Not sure how new manufactured ammo would do, but I'll be running it with M2 (cheaper too). ",
  "Not sure the size but coating them with rubber paint or the other method mentioned is highly recommended. Make sure the pegs are flush against the board, or you can have one slowly creep out and next thing you know you have a rifle on the ground. My Garand has two at the front because this happened (luckily I was there adjusting the sling when it did and caught it before the worst could happen). It's incredible the weight these can hold, but remember it's only as strong as your anchors to the wall. http:\/\/imgur.com\/iKTP01o",
  "Not sure what type it is. I'll have to check. ",
  "Not sure. ",
  "Not sure. First thing you do when reloading a BAR is lock the bolt to the rear then insert a new magazine. ",
  "Not sure. The sling I have is most certainly a reproduction (bought at gun show, very stiff). ",
  "Not surprised. ",
  "Not true. You can go to either one of their locations (in person) and walk out with a Garand same day. You'll pay a premium as most of the rifles they have are correct\/collector\/M1D\/C variants, but it can be done. ",
  "O'Canada inspired me to do a little math. Not including FFL transfers, I'm in at around 15K with the current collection. Still missing a nice K98, Springfield\/RIA 1903, No.1 Lee Enfield and something that requires a stamp (one day)!",
  "Of course! ",
  "Of course! Nothing wrong with a Mosin. Everything wrong with a Mosin snob. ",
  "Oh gotcha. I've been wanting one trust me! Just haven't found the right one yet. ",
  "Oh ok..",
  "Oh tell me about it. ",
  "Omg why did you buy a Colt you could have built the same rifle for $100 using PSA parts what is wrong with you? All kidding aside great looking rifle. Get yourself a PEQ-2 and you're set. ",
  "On my list! Gotta get an M1A first. Found a great 30K serial range for a great price. ",
  "Once I get the shellac off and a few coats of linseed oil I'll take some nice pictures of her. ",
  "One of the guys at guns made a post of him holding a big ass bag of weed ",
  "Only if you're trying to make a clone build. Otherwise it's a shit light. Having said that, I believe there are LED kits for them now. ",
  "Oof... either way congrats. They're great rifles. Now find some Ammo!",
  "Or maybe because I prefer quad rails and not having to buy secondary attachments to mount shit on my rifle?",
  "Outstanding. Would love to do this with my collection. Can you please share your method?",
  "PEQ is a replica, ACOG bought commercially, and vertical grip came with my AR-15",
  "Pinches nose. \"Hello again everybody?\"",
  "Pinned birdcage. ",
  "Please go away. No one likes you or your shitty green screen videos. ",
  "Please put another ACOG on the ACOG, or an Aimpoint. Just for kicks (photos please)",
  "Please tell me there is a tanker photo or something with this on your jet ",
  "Plus it was priced at $1,200 in new condition..that helped me make the decision. ",
  "Post some pics. Should be able to help you",
  "Posting a photoshop of my girlfriend about to be decapitated...uh yea I'll report that to the mods. What the fuck is wrong with you?",
  "Pours one out for OP",
  "Preban M1A meaning before Springfield removed the bayonet lug. Never said the M1917 was ever banned..",
  "Pretty jealous and impressive shooting. It's hard enough semi auto standing. I've never gotten to fire anything full auto. If things go well though, hopefully I'll have a Sten by Christmas. ",
  "Pretty much. I would lay white resume paper behind the guns, shoot from above as straight as possible and use a piece of paper to block the cameras built in flash towards the ceiling. Great tutorial here: https:\/\/youtu.be\/pDueg7FL7sE",
  "Pretty shitty compared to the original, but once I got it zeroed I was able to hit a 12\" plate at 300 with ease: https:\/\/imgur.com\/gallery\/nkHx8",
  "Pretty sure DnG is the lamest of all three. ",
  "Pretty sure Jake has posted his SAW more, but okay. ",
  "Pretty sure it's a Surefire M951. They're all over eBay for like $150-$200. Inalso bought the IR filter for it. ",
  "Probably some Mosin lover. ",
  "Quick video of my FN Military Collector Series M4 Carbine. If you're on the fence about picking one of these up, jump that fence! ",
  "ROCKET MAN!",
  "Reallllly slow. Even contacting them complaining after a week of no shipping it took another week for them to ship my stuff. ",
  "Really simple build to be honest. Had all the wood cut for me at Lowes. Maybe one day I'll make a post showing how to build one. ",
  "Really? I've always preferred the Bakelite stocks. I'm just waiting on some funds then going to get her. ",
  "Recoil is very minimal due to the weight and size of the bolt. Very fun to shoot. Hopefully one day I'll get to shoot a full auto. ",
  "Right after someone made a post about their Remington shotgun rusting, I made a post along the lines of Remington's New Military Collectors Series. It was a picture of a dug up rusted MP40. ",
  "Right? Need to get one soon before they're $1,000+ for a nice one. ",
  "Rope?",
  "SCAR and \"I hate money\/wallet\"...where have I seen this before?",
  "Same as the M4.\n\nEdit: just checked my receipt. It was $1,100 shipped. ",
  "Savage T's should never have 2 groove barrels. They were converted to 5 groove at Holland &amp; Holland. ",
  "Saving Private Ryan mostly. ",
  "Saw it and it wasn't very memorable. ",
  "Saw the rifle (not sure if THE rifle) at the museum in Dallas. I want one! ",
  "Second one isn't mine. Helped a friend complete the transaction as he's not very tech savvy. ",
  "See, no class. ",
  "Seeing as most of us learned starting with the A-10C...",
  "Serial on receiver wrist? Deff. a No.4. \n\nEdit: forgot BSA's did the serial on the receiver wrist. ",
  "Serious question. Are CZ the PSA AR-15 receiver of pistols? I see A LOT of them on here, and can't figure out if it's because they're great, or a cheap alternative and entry level pistol. Nothing against them, as I know nothing about them, but I deff. see the hive mentality around them here. Cool looking pistols either way!",
  "Sharing my M16A4 as others have shared theirs. Since this photo I've replaced the PEQ-15 with a PEQ-2, and swapped the TA31RCO-M4 (from my M4 clone) to a TA31F (going for a Fallujah USMC clone). \n\nHere it is in its current configuration (haven't had a chance to take a decent photo): https:\/\/imgur.com\/gallery\/VjwHNge\n\nFound it 'used' on Armslist for $1,000 shipped. When I got it, it maybe had fifty rounds through it. Always wanted one but wasn't willing to spend MSRP on one since I already had the M4. Sometimes Armslist isn't so bad. ",
  "She is an inferior shooter. She walked her group in from those two outside the black and in towards the center. The two bullseyes were shots 8 and 10. ",
  "Shit I wish it were me. Dude has some beautiful Enfields. I work in estimating. ",
  "Shit is terrible for reloading though (the brass)",
  "Shit!",
  "Shit. These loads are standard 174 grain with 42.4 grains of H414. ",
  "Shit...he sold it. Sorry bud!",
  "Shit...looks too skinny. Come on man!",
  "Shits real. ",
  "Shoot it often and enjoy the hell out of it. Also, here is a guide to proper sling installation: http:\/\/thecmp.org\/training-tech\/armorers-corner\/1907-sling-installation\/",
  "Shoot me a PM of whatever you'd be willing to part with. You know what I like. Lee's, USGI and a Mauser here or there. ",
  "Sick burn from Mr. Dungeons and Dragons ",
  "Simply adding a description for the sidebar rules...",
  "Slow down. It'll get you there ",
  "Sniper Rifle went from 5 to 48 pages...no I don't want to see every scope mount. ",
  "So A2G guns and rockets actually go where the pipper is now?",
  "So I had to remove my KAC rail today for cleaning after a rainy day shoot. Shit weighs nothing. What are you talking about weight????",
  "So I save you half the drive!",
  "So he's not really into Sailor Moon?",
  "So how much does it cost to get that rifle on the left? It's beautiful and I need one. ",
  "So it was illegal for him to have that rifle? Then he essentially made it into an SBR?",
  "So looks like Milviz either sold their model to Belsimtek, or Milviz is acting as Belsimtek lol. I know as I helped build the model. ",
  "So the flight model\/drag with full flaps doesn't bother you?!",
  "So the leak stopped for now and the guy who did the plumbing came by within 30 minutes (not bad HOA!). He's going to fix it Tuesday. Best part? It's covered under HOA because it's not my pipe!!!",
  "So we're not exactly sure how our little Vander is going to turn out. Was wondering if any of you had an example. Here are his parents (mom has the short coat): http:\/\/m.imgur.com\/a\/Z1Uz6",
  "So what about iron sights? Da fuck!!!",
  "So when a lot of people show interest in a particular rifle, I'm in the wrong for posting more of said rifle? Gotcha. I don't post for points or karma. I post to hopefully spark some discussion with people who are interested in the same firearms. ",
  "So you just paid over $0.50 a round for 9mm and can't even use it? Damn that sucks dude. ",
  "Some of you must be tired of seeing this rifle, but I brought it to the range last week and thought it was worth making a video for anyone wanting to see the rifle in action. Somewhat wish I went the M16A4 route, but I'm still happy with the rifle. ",
  "Some people have personal and social issues. ",
  "Some people take airsoft wayyy too seriously, but I have to admit it does seem kinda fun ",
  "Someone needs to teach these video guys to blend in game audio and get the levels consistent. ",
  "Sometimes having a little weight on a rifle isn't a bad thing...",
  "Somewhat agree. I had one a long time ago and shooting it wasn't very memorable. Then again I shot it off a bench at paper which is not very fun to begin with. ",
  "Somewhat of an old photo, but nonetheless proud of her and the rifles performance at 600 yards. It was windy that day, and with the scopes BDC being in meters and having to hold right if target for wind, I'd say she did pretty well! ",
  "Sorry I meant the connector. The control arm screws into the stock and the connector connects to the control arm and sits on the stock. ",
  "Sorry about that. Fixing now. ",
  "Sorry to be the one to let you down, but that rear sight has been bubbad, and the rifle is missing the front sight guard. Can be replaced for sure, but hope you didn't pay the \"rare price\" that type 1 Carbines bring. ",
  "Sorry, $183 depending on the day: https:\/\/www.ebay.com\/itm\/182345095382 ",
  "Sort of, it was made by Collector's Corner which would later become Ohio Ordnance Works. ",
  "SparrowHawk kits and 30,000 serial SAI receivers don't play well...next time I'll just buy a real M14. Puppers not impressed. ",
  "Sparrowhawk dummy selector kit. ",
  "Speaking of suppression, I'd love to have audio go out from grenade\/rockets or a saw gunner opening up right next to you. To the point where you can't hear comma for say 15 seconds or better yet where they're muffled. ",
  "Spent the day enjoying some .30 cal goodness at 300 yards. The real show stopper was the M1 Carbine. Luckily for me, the sights were right on at 300 yards, and hearing that quiet ping a second or two after pulling the trigger...it just may be my new favorite rifle. I didn't expect to hit the plate off the bench, but to my surprise was hitting it with consistency standing. Good day all around. ",
  "Springfield. Hoping to eventually make it a Vietnam M14 clone (semi auto of course). ",
  "Steel targets are the best targets",
  "Still, it's a tiny football. Give her an NFL ball and let's see how far she throws it. ",
  "Stock sets cost about the same as complete rifles. Like he said, pass. ",
  "Stocks are one of those things OOW doesn't get right in my opinion. Previous models were built using GI parts kits. As those dried up, they began making their own parts, including the stocks. Not saying they're incorrect as I'm not expert, but they deff. look off. ",
  "Stranger danger",
  "Stryker is fucking insane! All credit goes to an incredible and dedicated driver. ",
  "Sure do: http:\/\/www.ohioordnanceworks.com\/media\/catalog\/product\/cache\/1\/image\/500x500\/9df78eab33525d08d6e5fb8d27136e95\/p\/e\/pelican_hard_case_w_bakelite_copy_1.jpg\n\nDidn't much enjoy carrying the rifle Tommy car and into the shooting range without a case yesterday (notified range employees before coming in that I was bringing an uncased rifle in). ",
  "Sure when I get home tonight. ",
  "Sure. I would never use steel punches on rifles that aren't mine just to disassemble it for a YouTube video. Especially when it's a rare piece. ",
  "Sweet looking M39. What was the purchase process for you to buy those at a gun show? ",
  "Take some pictures of the cartouches. Though your rifle may have some Remington parts, it may be an Arsenal Refurbished rifle. The cartouches will tell the story. I'm thinking that's the case as original rifles had blued bolts and other parts (sling swivels, floor plate, etc). Many of your parts look parkerized, indicative of an arsenal refurb. \n\nEdit: for comparison here is my unissued original 1903A3 made by Remington: http:\/\/m.imgur.com\/a\/GLY9X",
  "Taking off the front sight protector gives the rifle a whole new look...may have to try that! What's the serial on your PH5C?",
  "Talking about the cutout rear of the front sight: http:\/\/m.imgur.com\/qrAGkTu\n\nMy barrel doesn't have it, so no way to get the rear of the 203 onto the barrel (it's also heavy profile under the handguard). ",
  "Technically no, it's an SLR or Self Loading Rifle",
  "Technically yes. If you go from outside to a pitch black room, you'll still have your reticle illuminated by the tritium. ",
  "Thank god. I didn't want to say anything but I was having a REALLY hard time getting in the boat. Never done it in real life but I have done hundreds with the VRS F-18 in FSX. Hell, I was even having problems in a normal airfield. ",
  "Thank you. Will look into that. ",
  "Thanks for reminding me. I guess I get the idea of it being a holiday because we get time off. Thanks for your service. ",
  "Thanks for the info. Commie star was just poking fun. Now I need an SVT-40",
  "Thanks for the information. The stock trigger is actually quiet nice (better than both my FN triggers). I'll deff. keep the original birdcage flash hider so I can return it to 100% original if need be, I just love the look of the 3 prongs. \n\nEdit: thanks. If you need some pointers let me know. It's fairly easy. ",
  "Thanks for the response. Appears I'll have to cut out part of the dry wall to get it on. Think I can find this at Home Depot?",
  "Thanks for the tip. Gotta get back on the buying ammo horse though. No point in having guns if you never shoot em. ",
  "Thanks man! I really want to do an M16A4 next or a USMC MK12 Clone. I tried the paper trick like in your video but was doing something wrong. Will deff. try the tinfoil trick later this weekend. Love your stuff man! Can't wait to learn more. ",
  "Thanks man! We put a lot of time and effort into it. The 'living space' is one big room. We love it. http:\/\/imgur.com\/a\/4WFXZ",
  "Thanks to \/u\/12gdv  I am finally able to have a somewhat presentable photo of my milsurp collection. He's been a big help the past few days showing me tips and tricks in both taking photos and editing them in photoshop. From top to bottom the rifles are as follows:\n\n* 1918 Remington M1917\n* 1943 Remington M1903A3\n* 1954 Springfield Armory M1 Garand\n* 1943 Underwood M1 Carbine\n* 1984 Springfield Armory Inc. M1A\n* 1994 Collectors Corner 1918A3 SLR\n* 1942 Savage Lee Enfield No.4 MkI(T)\n* 1943 Savage Lee Enfield No.4 MkI*\n* 1955 Fazakerly Lee Enfield No.4MkII \n* 1947 Fazakerly Lee Enfield No.5 MkI\n* 1947 Fazakerly Lee Enfield No.5 MkI\n\nIf any of you would like to learn how to make a photo similar to this, or would like me to edit a photo of your rifle with a white background just let me know. This one took longer to make than I'd like to admit, but it's made me come back to photography after a 5+ year hiatus. Thanks for looking!",
  "Thanks! Didn't realize how cheap .308. ",
  "Thanks! I've been wanting one for a long time. Had the opportunity to pick this one from a group of 20-30. Nothing special but she's in great shape. Ordered a sight hood protector to finish her off. Need to start looking for a sling too. http:\/\/imgur.com\/a\/kOqNB",
  "Thanks! It's tucked in the back. CB2 with CB2 chairs: https:\/\/imgur.com\/gallery\/26xLj",
  "Thanks! What I was going for. ",
  "Thanks. ",
  "Thanks. Didn't know about that. I'd ask in there but after realizing how cheap .308 is, I'll go with the M1917. ",
  "Thanks. He's actually really well behaved. Doesn't pull, sits when you tell him to, sleeps through the night in the bed. Goes to his crate no problem. The plates were handed down from my mom. Absolutely love them. I think they're clay (Mexican). Here is half the stash: http:\/\/imgur.com\/uu2faOI\n\n",
  "Thanks. I actually just got an unissued Sykes stock in last week (haven't had a chance to get a good photo of it). May try to make the rifle an OIF M14 clone or even like this one (check out that cheek weld) since I already have an ACOG: http:\/\/imgur.com\/YR1iWNR",
  "Thanks. I'm hoping either the rifle is amazing, or the rifle sucks and the ammo is amazing. ",
  "Thanks. T was either the 44 or a stock set for my Garand. Think I'll go with the stock set. ",
  "That 1 degree glide slope though...",
  "That 15 yard penalty for the huddle crap when Williams caught the pass at like the 5 yard line crushed me. ",
  "That 1941 BSA is pretty rare...look at the front sight ears. Can you post more photos of the markings? Looks like it survived the war as it was originally made. ",
  "That ain't no bubba...damn!",
  "That couch has seen some shit. Actual shit. ",
  "That flimsy? My airsoft PEQ-15 has held together pretty well. ",
  "That handgun reminds me of a Nissan Altima. ",
  "That is probably the best deal I've seen on an M16A1 upper ever! Super jealous. I just got an SP1 and already want to find an A1 upper for it. Shits expensive! ",
  "That rifle looks like it's been through hell and back. Way too rough, even at that low price. Would you buy a car that's barely running just because it's only $500?",
  "That rifle setup looks awesome. ",
  "That saw would look awesome with an M145",
  "That was a fiberglass stock yesterday. ",
  "That's Razbam for you. Though even the Harrier requires way too much speed\/angel. ",
  "That's a Russian capture...",
  "That's a USAF jet anyways. ",
  "That's a bright landing light ",
  "That's a good starting point. Will be looking at getting a rear sight tool as the last thing I want to do is mar the finish. Thanks!",
  "That's horse shit. I gotta drive to the 100 now? I remember we shot at 200 and I asked the guy to switch us to the 600. He said, \"you're going to have to crank that scope way up boy\". Was using an ACOG with BDC. He didn't wanna do it but the first shot was in the black left us alone after that. ",
  "That's it. They're great. ",
  "That's my college roommate!",
  "That's my quarterback... ;(",
  "That's one rifle I won't shoot off a bench!",
  "That's pretty awesome ",
  "That's something I still need to do with my AR (zero the irons). That's mean taking the scope off and then reconfirming the scopes zero though...one of these days. ",
  "That's the beautiful red I've come to love. Nice to see CMP stocks are salvageable. ",
  "That's the one!",
  "That's tough, but I'd probably pick the M1A or the AR-25",
  "That's what got me this far...she hasn't noticed the K98 yet...",
  "The A-10C has two MFCD's (multi functional color display) in the cockpit. One of the tabs you can select is the DSMs (digital stores management system). You can either cycle between stores using a 4 way switch on your joystick, or you can select it via an OSB button next to the desired store. Also, within the DSMS, you can view\/edit store profiles (PROF), meaning adjusting the height of function for CBU's, changing your laser designation code for a GBU-12, changing ripple quantities, changing between CCIP or CCRP, and a few other things...next, you can configure missiles (MSL, typically used to cool AGM-65 Maverick seeker heads), edit your jettison profiles (SJET or selective jettison), and view your inventory in more detail. The A-10C is a very advanced platform, and with its time on station, very deadly for long periods of time. Here is how the DSMS looks: http:\/\/imgur.com\/umhObEs\n\nWhen a weapon\/store is selected, and your master arm is on, the station will light up green. This page will also tell you vital information. One example is a hung store or bomb that failed to drop. Typically a GPS guided GBU where the pickle or release button was let go before the bomb released in CCRP mode (GPS GBU's can only be dropped in CCRP). \n\nAlso, how does the system know what store is where? I believe the pilots insert a \"card\" with their store profile preloaded. During startup, your DSMS loads the information, including laser codes, profiles, etc. The pilot can edit these on the fly as well. Let's say a pilot lands and does a hot pit refuel and rearm, he would have to manually program his DSMS for the new stores; \"Station X is a GBU-12 with laser code 7102, station Y is two AIM-9M's\", etc. he wouldn't have to re-enter his lightning pod or ALQ jamming pod (if used), since those stores still remain from the original sortie. ",
  "The A2 wasn't mind. It's a Colt SP1 lower on a Colt A2 upper. I agree, it deff. shot softer than the M4 clone. Very pleasurable to shoot. ",
  "The B-2 Spirit cover up project. ",
  "The BAR is. Semi auto Collector's Corner (pre Ohio Ordnance Works), and obviously that's not a real M4. ",
  "The K98. All other rifles are \"allied\". ",
  "The Marines have been using the M4 for a while, in addition to the M16A4. That's the wrong scope in the photo you posted btw. Should be a TA31RCO-A4. That looks like a 3.5x ACOG. Here is a video showing some Marinesnwith their M4's: https:\/\/youtu.be\/k5Dy5Ba7DBo",
  "The ads always say no shipping. Worth asking. I've bought 4 guns off Armslist (shipped) with zero issues. ",
  "The bolt is!",
  "The front barrel band should be centered. Loosen the screw and move it forward an inch or so. Nice looking rifle. Probably a worn magazine spring causing the round to get hung up. ",
  "The fuck...my roll mark says FN15 and it was made in VA...I don't believe you! ",
  "The gates are for this guy: https:\/\/imgur.com\/gallery\/KIPrd\n\nCats need a safe space haha ",
  "The good news is replacement stocks aren't that expensive. ",
  "The guy had one of those paratrooper Arisakas...poor Mum was ground off though",
  "The guys post had 2 guns in it...that doesn't mean he only has 2 guns...",
  "The math checks out...but seriously, I wonder what kinds of rifles I could get in trade for it. ",
  "The more you kill the more they reproduce. ",
  "The ok' FN likes to print X's every now and again at 600. Even the sammich maker nailed the bullseye twice using Wolf Gold of all ammo none the less: http:\/\/m.imgur.com\/iSgPObt",
  "The original 1918A2 was full auto only and had two different full auto settings. Fast and slow. This one is semi auto only. Here is a video of me shooting the rifle: https:\/\/youtu.be\/AkuVG9eABio",
  "The original 2 groove barrel was replaced to a 5 groove during its sniper conversion at Holland and Holland. That's an early cocking piece. Love them!",
  "The photo on the left doesn't replicate what you see in real life. I have a TA31 RCO-M4. The in game ACOG is fine. ",
  "The problem is every time I'm 'done', I stumble on something I can't pass up because of the price. ",
  "The real question is how do you pronounce Trijicon? ",
  "The rear sight was cut to a v-notch and it's missing the front sight guard. ",
  "The rifle can be found for around $1400. I got the Aycock for $1100. ",
  "The scope serial numbers were stamped into the stocks wrist. ",
  "The stock on that Garand is incredible!",
  "The unissued Jungle Carbine with original bayonet was like $450. The Savage Enfield unissued $450. The Fazakerly Enfield (blonde stock) with Parker Hale target sight $600, and the No.1 MkVI for $400. Did pretty well on the BAR too but that one still hurt. The shotguns and pistol were an inheritance. ",
  "The wood and metal finish is what makes me enjoy the Savage Enfields more than the others. Mine is the 0C4338, so a really early Mk1",
  "Then again, if she notices that means either she's counting or she can tell the difference between an Enfield and a Mauser...not a bad thing now that I think of it. ",
  "There is a YouTube channel where the guy full on dresses in period uniform and performs period drills with rifles like these. Can't remember the channel name but check that shit out if you can find it",
  "There is a guy I know that sells em below MSRP. Next time let me know. ",
  "These comments...it's not real ",
  "These guys have it all wrong. Try this. Look down the scope with both eyes open and focus on your target (should be using your dominant eye). Now, look away from the scope (while keeping your cheek rest) and focus on a new target. Slowly move your rifle to point at the new target while remaining focused on the target. If you did it right, you will automatically switch back to your dominant eye the second the reticle come over the target. It takes practice, but the point is you don't have to take your eye off a new or moving target to acquire with the scope.  ",
  "They can but next time you're driving try maintaining your lane while looking over your shoulder. Now imagine doing that at 350 knots. ",
  "They had the simplest wood grain of any country but the best looking wood in my opinion. That dark chocolate brown...love me some tiger strip enfields and M39's, but nothing beats a dark brown USGI rifle.  ",
  "They still don't have CCIP right in the Mirage. ",
  "They weren't shipped with cases in the early 90's and all parts are USGI sans the receiver and trigger group internals. Seen similar ones sell for $5,000. Good enough for me! It's also a Collectors Corner BAR, before they became OOW. \n\nEdit: looks like OOW is out of stock. ",
  "They're a backup to the scope. Idea being if for some reason the scope breaks, you can still use the iron sights. ",
  "They're haters who cry themselves to sleep with their PSA specials. ",
  "They're in all the way. Twirled them, lifted ear and put in until they expanded, then let go of ear. ",
  "They're out there. Usually posted with very shitty pictures. I've bought 3 from Armslist. They usually have hidden treasures. ",
  "They're perfectly legal. On newer rifles you have to add them yourself. This one was made in 1984. So it came with it. ",
  "Think this has enough kick to cycle a 1918A3?",
  "This guy has some of the most informative videos I've seen on YouTube. The knowledge he possesses is astounding, especially considering he's completely blind. He has a really cool video on Italian Garands and all the variants they made. Deff. worth a look!\n\nEdit: this video goes into great detail the history of gun control with examples: https:\/\/youtu.be\/kvR5-f3FNWc",
  "This is a small example, but you took a screw driver to that Turner Semi-Auto Enfield...use wooden tools. ",
  "This is an old pic with the old MkII scope: https:\/\/imgur.com\/gallery\/D4rxm",
  "This is my \"M4\" that I \"built\". It's the FN Military Collector Series M4. Comes with a MaTech BUIS (probably what you used in the Army). The rifle comes with the Knights Armament Rail with covers and verticals grip. You'd just have to buy an optic, sling, and that's it really. https:\/\/youtu.be\/TaH5UU0jr14",
  "This is the one: https:\/\/www.ebay.com\/itm\/302164002275 \n\nDon't bother with their PEQ-16...it's Shit compared to the 15. ",
  "This is what the blonde mummy wraps look like after years of being unwrapped. Can't wait for mine to get that color. ",
  "This is where I learned from: https:\/\/youtu.be\/pDueg7FL7sE",
  "This made me laugh ",
  "This morning taking a shower I realized that. Not as sharp as I used to be...",
  "This place has gotten toxic and very cliquey lately. It's the main sub for guns. Don't shit on people for sharing what they have. Where else are we supposed to do it? If people enjoy the content, they'll upvote. If they're tired of seeing the same Scar, they'll downvote. Don't let this place get any worse than it's gotten in the last few months ",
  "This was one of a small quantity of Savage No.4 Mk1's sent to Holland and Holland for sniper conversion. The Savage's typically weren't issued with scopes\/mounts, but they did receive the rest of the conversion (cheek rest, scope mount pads, replacement of the Savage 2 groove barrel, etc.). Because they weren't typically fitted with scopes\/mounts, you won't find the sling swivel on the trigger guard, scope serial number on wrist, etc. They'll also usually be in excellent condition. ",
  "This was taken and edited with an iPhone 7... https:\/\/imgur.com\/gallery\/AVonHxE",
  "Those guys were POW's forced to fight and were trying to surrender\/explain that before they got shot. ",
  "Those things look rough...clean them!",
  "Those windows are incredible ",
  "Thought I was done with Enfields. Just bought this Enfield rifle a cool $400. If you know anything about Enfields...you know why this is huge. Life is good. Someone bubbad the stock with a lacquer  but I can refinish it easily. Ahhh!",
  "Thought as much. ",
  "To be clone correct lose the Matech buis. ",
  "To be clone correct with that PEQ-2, I'd lose the BUIS",
  "Today was a good day! Picked up this beautiful 1983 Colt SP1.  I've always loved the look and feel of the M16A1, it's history, etc.  She just kind of fell in my lap.  Now time to figure out how to zero her and see what kind of ammo she likes!",
  "Today was a good day! Picked up this beautiful 1983 Colt SP1. I've always loved the look and feel of the M16A1, it's history, etc. She just kind of fell in my lap. Now time to figure out how to zero her and see what kind of ammo she likes! ",
  "Tomcat Squadrons were VF.  ",
  "Took a few rifles to the range today but was really looking forward most to sighting in my new reproduction No.32 Mk1 scope for my Lee Enfield No.4 Mk1 \"Scopeless T\" made by Savage in 1942 as part of the Lend Lease program. I roughly bore sighted the scope at the house before leaving, and after a few adjustments it was hitting and holding on the steel gong at 300 yards. A lot has been said about these scopes holding their zero, so we'll see what happens next time. Just glad to finally complete the look of this rifle with the early Mk1 scope (love the sun shade). ",
  "Took out three of my favorite rifles to the range today after work. I'm really enjoying shooting the Enfield sniper with hand loads. I took some videos of all three rifles, so if you guys want to see them just let me know. ",
  "Took the carry handle off last night (just playing with it and seeing how it was made) and the barrel is already marred. Not too worried :)",
  "Top of the receiver will have the Yugoslavian crest where the German manufacturing markings used to be. ",
  "Totally not shouldering that pistol. ",
  "True. Now there is absolutely nothing wrong with iron sights. Adding a 4X scope really won't make the rifle any more accurate. It's all about the shooter. ",
  "Try Wolf Cola",
  "Typically I play the objectives but I really like going with another person and flanking an advancing attack say if we are defending. I don't huddle behind sandbags, I go out looking for the enemy and usually have good success. ",
  "Uh...sorry?",
  "Unfortunately I don't think it'll go on my rifle. My barrel doesn't have the cutouts under the handguard, and the flash hider is pinned so I wouldn't be able to slide it over the barrel from the muzzle. Unless you have another idea on how to get it on. How's your A4 going?",
  "Unreloadable and corrosive...",
  "Using your own body is considered unsupported. ",
  "VF-31, not VFA. ",
  "Very cool! I've always preferred the military builds than the new tech AR's. I went for the USMC M4 with my \"build\" as well. https:\/\/youtu.be\/TaH5UU0jr14",
  "Very cool! Mine says hello: https:\/\/imgur.com\/gallery\/fj2Ke",
  "Very cool! My FN says hello: http:\/\/imgur.com\/OJrN4Z1",
  "Very cool. Any idea on the date?",
  "Very cool. Glad you love it!",
  "Very cool. I've always wanted an A4 clone. You going to put an optic on it?",
  "Very cool. Question though, is keeping it in contact with foam a bad thing?",
  "Very cool. Sometimes I regret not going the A4 option with my build. Why did you pick the 31F? The real A4's use the 31RCO-A4 ACOG. ",
  "Very fun flight, good instructions all around (learned something new). VR flying looks hard!",
  "Very good. Those Eclans are 1-4x right?",
  "Very impressive. Thanks for the feedback. ",
  "Very nice Mauser ",
  "Very nice. I'm picking mine up next week!",
  "Very nice. Would love to do an M16A2 build one of these days. ",
  "Very well done!",
  "WHATS MY POU?",
  "Wags isn't that good...nor are any of the other testers. It's gotta be the wrong flight model. ",
  "Waiting on the funds. ",
  "Was the last one at Moody? I think I was there...",
  "Watch that video to learn the principles, then download gimp and give me a shout, I'll talk you through the process as it's slightly different than photoshop. ",
  "Watch the trailer. Almost 500 knots at 22.5 degrees nose down and the pipper isn't anywhere near in the HUD field of view. If anything it should at least be at the bottom. ",
  "We weren't about to let him shoot high powered rifles with only iron sights at 300 yards. He's 10 years old...",
  "We're in the small in a small town. Would never be able to afford this in a big city. ",
  "We're not shooting out to 600 yards and taking pictures of our groups. We're shooting steel targets at 150 yards. No sling needed to get consistent hits. ",
  "We've already been through this: http:\/\/imgur.com\/rDwsNC4",
  "WeekendHesalite is a parody account someone made. ",
  "WeekendHesalite isn't me, and this is maybe my third post of the BAR on guns where I actually got to take it to a real range and film some shooting. Didn't know there was a one post limit per gun. You guys are strict!",
  "Well at least one chamber flag is visible. 50% is a big improvement from the recent posts. ",
  "Well they do say money can't buy class...",
  "Well worth it. The bullet drop compensator works. I zero'd mine at 25 meters, confirmed I was able to hit a sofa can at 100 meters, then was able to get bullseyes at 600 yards. \n\nEdit: fixed for spelling ",
  "Went shooting today with a buddy and his grandson. In keeping with history, he was out in charge of all things BAR; ammo, toting it around, picking up the brass, and even putting 20 rounds through it with a little bit of help. Great kid, start em young!",
  "Went to the game this Sunday. Made it a point to buy a Romo jersey knowing he may never step on the field as a cowboy again. No intentions on ever wearing it. Just glad I have it. ",
  "Weren't PEQ-2's phase out by then?",
  "What a haul. What did you pay on the two Enfields?",
  "What a sad life. Hope you find happiness soon. Can't imagine living the rest of my life and only ever getting joy out of trying to make others feel bad. Good luck",
  "What about realism?",
  "What are your thoughts on this one? https:\/\/www.ebay.com\/itm\/162586675285 ",
  "What dank memes? And look through my history, this is like the third post of the BAR, in this case actually at a shooting range. What's the harm in that?",
  "What happened? ",
  "What happens when you go prone on concrete? ",
  "What kind of testing were you doing? Guessing you were shooting offhand? Shooting 25 yards? ",
  "What makes them shitty? They're all pretty well built and accurate. ",
  "What the fuck. This was amazing. ",
  "What the hell did I ever do to you?",
  "What's an M1919 SA???",
  "What's next besides M1A? ",
  "What's the difference between an Army and Marine M4 upper?",
  "What's the issue?",
  "What's the point of a pipper if you're going to be within a banana peel range...makes me think the pipper isn't accurate yet. ",
  "When I was younger I used to all the time. Now I realize it's not good for the wooden stocks. Also, by not taking them apart, I no longer risk damage to screws or accidentally scratching the stocks. Also, I found back in the day when I didn't shoot as much, I was more keen to take em apart. Now that I shoot a lot more often...meh. I get my enjoyment out of them at the range. ",
  "When that F\/A\\-18F taxis past the stripped Tomcat...",
  "When your car is a 2005 Volvo, most photos on guns are ",
  "Where is this? Great jersey selection. ",
  "Where it RShakelford to bitch about the faux selector? Beautiful! ",
  "Which gun is that? ",
  "Which of yours would you never shoot?",
  "While I have it in my custody (helped a friend purchase an ACOG), thought I'd give the old dual optic thing a try. Sadly it didn't work..though it does look pretty cool! ",
  "While many people are telling you to go the CMP route, I disagree. I believe for the most part, their Garands now come with new manufactured stocks. Half the rifle is the stock in my opinion, and if I'm buying a Garand, I would want an original stock. ",
  "Who are these people? ",
  "Who care if other people use teamspeak? Tailor the game for those who play it the way it was meant to be played. ",
  "Who knows man. Looks like he plays World of Warcraft though... http:\/\/m.imgur.com\/FaGazr9",
  "Who provides the case? You guys have some?",
  "Whoa...it's quieter after it passes...fix this already please...",
  "Why are your upper receivers on the wrong lowers? ",
  "Why do you dress up like a cartoon girl?",
  "Why do you feel it's better than an Arsenal? ",
  "Why does he dress up like Sailor Moon?",
  "Why is something exciting going on that I don't know about?",
  "Will def. try disabling them next time ",
  "Will stricter gun laws and or bans stop criminals from illegally obtaining guns? ",
  "Wish I could find one. ",
  "Wish I had an A4!!!",
  "With the help of \/u\/12gdv and his amazing editing skills, I was finally able to make a somewhat presentable image of my milsurp collection. From top to bottom: \n\n\n* Remington M1917 - Mfg. 1918\n* Remington 1903A3 - Mfg. 1943\n* Springfield Armory M1 Garand - Mfg. 1954\n* Collectors Corner 1918A3 SLR - Mfg. 1994\n* Underwood M1 Carbine - Mfg. 1943\n* Springfield Armory Inc. M1A - Mfg. 1984\n* Savage Lee Enfield No.4 Mk1(T) - Mfg. 1942\n* Savage Lee Enfield No.4 Mk1* - Mfg. 1943\n* Fazakerly Lee Enfield No.4 Mk2 - Mfg. 1955\n* Fazakerly No.5 Mk1 - Mfg. 1947\n* Fazakerly No.5 Mk1 - Mfg. 1947\n\n\nHope you guys enjoy the photo. It took more time than I'd like to admit. If you have any questions on how I made it, or would like me to take one of your rifles and make a similar edit, just let me know. Would be happy to help.",
  "Wolf Gold is amazing. I'll give that a try. ",
  "Wonder if CCIP will work as it should...450 knots at 45 degrees and 2,000 feet and no pipper in HUD is no bueno. ",
  "Woodland Camo that is...\n\nBased on the 80 degree weather and daily rain showers, I'd say Spring is here.  With that comes Spring Cleaning. Found this USGI M14 stock I forgot I had while cleaning\/organizing my closet in the office.  Wish I knew the history of this stock; what time-frame it was fielded, what kind of troops it was issued to, etc.  Including the original M1A stock, I now have 6 stocks for this rifle (here are 4 others https:\/\/imgur.com\/a\/iQQHD).  This one is slowly becoming my favorite.",
  "Word",
  "Word. Knights Armament makes a micro one that only takes up one slot on the rail. Wouldn't lose much eye relief. ",
  "Word. My dad played Doom with us ",
  "Works like this. The bolt is locked back. Pull the trigger, bolt slams forward, stripping s round from the magazine, chambers it and fires it once its chambered. ",
  "Would it have made a difference if I posted 24 days later? Having a bad day?",
  "Would like to see more of the Enfield. Interesting that it had a unit disk in the stock. ",
  "Wouldn't mind a nice M39. ",
  "Wtf man...",
  "Yea I don't have one of those. ",
  "Yea I remember the point blank tows. ",
  "Yea I'm kicking myself for that one. Poor choice of words on my part. ",
  "Yea no issues. Took a while though ",
  "Yea no. You shouldn't have to be at mil to keep from falling out of the sky. Nor should the plane fall out of the sky if you let back on the throttles for a second. ",
  "Yea no...real guns and missiles aren't fired. ",
  "Yea well, that's what happens when you share your collection on a Reddit guns forum right? ",
  "Yea wish it said Burst but what can ya do? And no, I had those before. ",
  "Yea, I kept thinking I posted the picture with his school name not blocked out in the photo. ",
  "Yea, how many priceless weapons is he going to disassemble and scratch?",
  "Yea, next time I'll inspect each and every round someone gives me to shoot for free. Thanks for the words of wisdom. ",
  "Yea, that's why I said i was going for a Marine issued M4, not Marine issued standard duty rifle. I honestly prefer the A4 over the M4...one day. ",
  "Yea, the big shot with his car worth about $2,500...",
  "Yea, whoever shot at him was totally not trying to kill him...shut up",
  "Yea. Holy shit. ",
  "Yea. It's going to need some work. Tracking down the front handguard band and front sight hood...should be fun ",
  "Yea...got pissed off and went to the QT across the street for a hot dog and slice of pizza. Deer Creek after that for the M14 stock. Already bought my ticket online. Are shows there ever good?",
  "Yeah, that joke about race totally blew over my head.  I thought we were talking about guns here...",
  "Yes. Great place ",
  "You been vacuuming Big Macs on the side?",
  "You buying the Winchester from a guy in GA?",
  "You buying the ammo?",
  "You can find them pretty often on eBay for anywhere from $180-300 depending on condition and what rear aperture they have. They give your No.4 (at least on mine) 1\/4 MOA adjustment in both wind age and elevation. Plus they're just pretty! http:\/\/imgur.com\/xAf0YvX",
  "You have great taste",
  "You know collecting isn't a contest right? I collect what I enjoy. If you're not a fan of it, sorry? I don't know what to tell you. ",
  "You look like what I imagined Semper would look like. ",
  "You mean like Chicago? Oh wait...",
  "You mean the cocking piece is smooth, i.e. No grooves? I'd leave it if original ",
  "You mean the dark area? It's a shitty iPhone 5 picture in a dark room. ",
  "You mean the neutered non full auto ones?",
  "You play? Or just creep my posts?",
  "You really want a horrendous century import mark on a Garand receiver? Like they did the Enfields? ",
  "You shoot like a girl...no seriously, my girlfriend got two bullseyes at 600 with my milspec rifle and 14.5\" barrel, 4X ACOG, and using Wolf Gold: http:\/\/imgur.com\/sxUexoV\n\nLove that place. ",
  "You speak the truth! ",
  "You still hoping to fly 16's?",
  "You talking about the cutout near the takedown pin? I don't believe so. ",
  "You would fit in very well on the outskirts of an airbase in the pacific. ",
  "You'd think, but it's not very fun to shoot ",
  "You're good dude. I'll see if I can get them in any further. Some ears are different though. ",
  "You're the first person to inherit a post ban AR-15. Congrats! ",
  "You've got that backwards. Singer was original. MkIII is post war. ",
  "You've watched too many booby trap shows",
  "Your picture makes me want one, and I don't know a thing about them!",
  "Your run of the mill AR-15, no fun switch but still plenty of fun to shoot. It's how it came from FN. their civilian version of what they issue. ",
  "Your vise made it look like a G43 ",
  "Yup, the grooved handguard had always been a selling point for me. ",
  "Yup, with Parker Hale PH5C rear sight.  I had one still in the wrap but sold it (no use in having a rifle in the wrap when you already have one to shoot...it was just a paper weight since I was never going to open it). ",
  "Yup. The USMC ACOG for the A4. Wish I went the A4 route instead of the M4 sometimes. ",
  "Yup. Those aren't free. ",
  "Zero at 25 for wind and elevation. Then take it to 100. Saves on ammo. The case..you're right. I only have two proper cases, this was the third. ",
  "http:\/\/treelinem14.com\/Freds-M14-Stocks_c41.htm",
  "https:\/\/imgur.com\/gallery\/lzt2O",
  "i.e. not new production and olddd",
  "iPhone 7 believe it or not. Wish I had a DSLR with video for shooting these videos ",
  "lol go hug your pillow ",
  "lol no that shits not mine. If it were...oo lawd",
  "lol show me these mint condition No.4 Mk2's for $500. I'll buy them all. ",
  "lol, I bought one of the FN Military Collector M4's (semi-auto replica of the FN issued rifles) and built it up to be a USMC M4 clone: https:\/\/m.imgur.com\/a\/j10ws"
]