[
  "Yawn........",
  "That’s the point.  I am NOT going to seize the documents.  I am going to seize the person that doesn’t have the documents on them st the time they possess the NFA item at the range.  ",
  "Yes!!!!!!",
  "You need to go read TEXAS laws.  There are numerous states that have state statutes regarding this. ",
  "I am one year past the retirement age.  He cannot do ANYTHING about it.  Literally nothing per service rules and the police union.   All legal under state laws.  ",
  "Actually the burden of proof is on the STATE.  ",
  "Going to enforce the law.  ",
  "I assure you I am NOT.  ",
  "Wait until you see what I am going to do when I get in my patrol car.  Time to start inspecting Form 1 and Form 4s at the local ranges. And yes.  In Texas we have a state statute so I very well am allowed to do so.  ",
  "He posted that here simply because I am a police officer.  That means until he is banned y’all get to see it. In the military it’s called vicarious liability.   Means posting until the mods take responsibility to ban him.  \n",
  "Blocked ",
  "Because he posted this to this reddit so I want him banned.  ",
  "I haven’t even begun yet.  ",
  "The funny part is that you think I’m kidding.  ",
  "My daughter is a minor and you’ve just admitted to an offense in the star of Texas.  It doesn’t matter where you are.  It’s where she is and what you’ve admitted to.  Will call the San Antonio PD for a case # shortly.  We know what the world thinks of pedophiles.   \n\nAnd since your email address has been already verified and your post indicate you’re a 32 year old white male not married with no kids you’ll be easy to narrow down with a subpoena duces tecum.  I’ll post a copy of the police report for you.  And yes.  I can do this.  Been an officer a very very long time.   ",
  "Yeah.  You’re 32 and unmarried with no kids.   That means you’re GAY!   ",
  "I am quite diversified.  ",
  "No reply?  Nothing?",
  "If you can afford a car then you can afford an Machine gun.   Just have to learn how to budget and finance one properly.  ",
  "Do you own a car?   ",
  "A few thoughts.  First nothing wrong with those at all.  I killed my first few dear with a single shot brake action shotgun.  A 20’gauge with number 1 buckshot.  Very effective at less than 15 yards.  \n\nAnother thing.  What’s up with the vault?  And why are they in there?",
  "Nothing?    I would have expected at least little more from an 0-3.  I mean really.  You’re a Captain after all.  ",
  "You’re not even making a halfway attempt at this.  Come on. Keep it at least somewhat entertaining.  Say something really good...if you even can. ",
  "Hello?   Where are you?  ",
  "Surely you can do better than that.   Come on.  At least make somewhat of an attempt. ",
  "Yawn........",
  "And he’s black too!   With a GIANT dick and mine is so very small.  And she is so madly\nIn love with him.  And not our four kids (one of whom is handicapped blame and autistic).  ",
  "That is what I figured.  I have shot subsonic many times and there is no way I would hunt with one.  ",
  "That was my guess also.   ",
  "I am extremely pro gun.  However bump stocks are not guns.  Either way, be silent.  ",
  "Silence.  ",
  "How much foot pounds of energy do you lose because of subsonic velocity?  My guess is that it would be a significant amount.  What about expansion ?",
  "I have several assault weapons.  ",
  "Pretty sure that shirt says « Fireman ».  Lol. ",
  "They are part of the integral operations of the firearm as ORIGINALLY designed.  Of course you know this but ask dumb questions not germane to the conversation. \n\nGermane means related to or involved in.  FYI.  ",
  "So you’re another one not bright enough to follow the conversation and instead ad in extraneous things not being currently discussed.  \n\nI never cease to be amazed at how many young children are on her and profess to be gun owners.  ",
  "It’s spelled « myth ».  ",
  "Subsonics for large game?",
  "I have ordered two items from them with no issues.   ",
  "I have personally used my 300 Blackout on several deer with no issues.  Bullet suggestion:  use the Hornady 110 grain Full Boar GMX round.  Works great for both deer and hogs. Fantastic round with great performance.  Kind of hard to find in stores.  Will have to order most likely. But great round for hunting. ",
  "Then who reported him?  His Uber driver?   ",
  "Mine was brought back from Germany by my grandfather.    Shoots straight but that metal butt plate hurts in 8mm.  ",
  "For the record.  I have a Mauser 98 and love it. Damned thing shoots like a dream.   I killed a nice hog with it last year here in south Texas.   8mm Mauser drops pigs with authority.  ",
  "So, he needs to first think of what agencies or doctor he went to visit for mental health issues.  That’s where I would start.  And then once he has identified who reported him he can then identify who can report an update.  ",
  "So you’re not bright enough to know what I mean and cannot read intent.  Don’t nitpick the original comment or try to apply what i said to other things I was not discussing.   \n\nStocks coming as standard on long arms.  Pretty sure you know what I meant. If you don’t, you’re not bright enough to handle weapons in the first place and should therefore sell them all cause you’re a danger to yourself and society as a whole.  \n\nDumb people shouldn’t own weapons cause dumb people do dumb things.  History has long proven this to be a fact.  ",
  "And as someone who owns full auto I also see the bump stocks are wanna be toys. When they get banned it’ll hopefully drive up the prices of transferables.  \n\nHere’s reality for you.  If any of you have a 401k or a 403b orna KEOGH or whatever other investing platform you use, then you hope your price for share rises over time.  No doubt about that. If you think differently then you probably shouldn’t be investing. \n\nSame with my full autos.  Hoping prices rise is same thing as my 401k ( and my other investibles)  over time.  Same as same. ",
  "Yep.  Original purchase.  ",
  "Agreed.  That’s exactly what I am saying. ",
  "Oh that’s sucks bro.  My mother in law is super cool and drinks with me whenever I get back to Mississippi to see the family. ",
  "You go away too!",
  "Thanks man!",
  "Hahaha.  I am actually drinking a beer right now.  Original Coors in the small bottle.  ",
  "Pretty sure you know what I meant.   ",
  "Blocked.  ",
  "So RDIAS and Lightning Links are covered.  Yay!!!!!!",
  "Fair enough.  I agree.  Because those are Arms.  Bump stocks are not.  ",
  "Blocked.  ",
  "They should be deregulated from Title 2 weapons and places as Title 1. ",
  "Correct. ",
  "Yes.  Says zero about bump stocks ",
  "Ok. Here’s the test to see if an item is TRULY « Arms » or not...\n\nGo to New York City.   Publicly display the item.  If you’re arrested it’s arms.  If not. Then you’re not really in New York. \n\nBwahahahaha",
  "Trust me.  Eventually they’re going to try.   ",
  "Ex post facto.  They already have them.  And the « takings clause » covers if they want them going forward.  ",
  "Yep.  ",
  "And there you go.  Bet I beat you to it.  ",
  "And there’s another.  ",
  "Sorry ",
  "I\nImmediately block all police officer haters because I don’t treat people that way and I demand to be afforded the same respect.  ",
  "Nope.  Not at all. ",
  "Great.  Another one of you.  ",
  "Sorry.  Forgot ",
  "Hell yeah!",
  "Keeping fingers crossed for you bro.  ",
  "We are open for business.   Come on down!",
  "Holy cow.  Ouch.  ",
  "Yep!   Best state in the country.  Just ask any Texan!  Lol. ",
  "Glad I already have that!",
  "I called and asked.  ",
  "HahahHa ",
  "News flash:   We gun owners also want gun violence (and other types of violence, too) to stop.  ",
  "Okay some issues. \n\nDo you have a social security card?\nDrivers license or state ID card? \nCertified or notarized birth certificate?\nDD214 copy #4?\nCopy of your service record?\n\nFor homeless people those are usually challenges to obtain.  If you have those then you’re already more than halfway there!!!",
  "Things have changed SIGNIFICANTLY in the last three years.  You need to reapply!    Standards are loosening a bunch as of late.  ",
  "Unloaded.  Sigh.  ",
  "What VA disability rating do you have?  Have you applied?   Being homeless and a veteran is NEVER good. There are people that can assist.   Call the VA and damned sure get a copy of your DD-214 member 4 copy page.  Assuming you served honorably you can get VA disability ratings.   \n\nUp to you though to apply.  ",
  "Clearly you misunderstood what I meant.   ",
  "The definite is not the stamp according to the law is my understanding.   It’s the NFRTR registration. ",
  "I am a 26 year long police officer.  Thinking most of that I am good to get out of.  ",
  "238 days.  This is DOUBLE or more the amount of time it takes the same FBI to do my TS-SCI every five years.   \n\nUnreal....",
  "They are slowly going down.  But yes.  ",
  "And remember.  German soldiers knew they would be summarily SHOT IN THE HEAD if they failed to obey orders of the Führer.   Big big difference here you’re talking about.  ",
  "Huge difference between police officer and soldiers.  \nMilitary fall under UCMJ.  Gigantic difference.  ",
  "Suggest you go actually speak to individual officers.   Get a first hand knowledge and not what you think might happen.  I assure you there will be very few and far between officers that would participate.  Very very few.  ",
  "You saw a SMALL HANDFUL of stupid out of more than 10,000 officers in the city of New Orleans so you apply that small amount of sample to the entire population.  \n\nGuessing you’re not that bright.  ",
  "Agreed.  ",
  "FLETC is in Georgia and most federal\nInvestigators series 1811 go there.  Afterwards go to your stations.  The military investigators go like regular officers and warrant officers.   The civilians can stay long term.  Military investigators move every three to four years for the most part with LOTS of TDY duties.   \n\nYou can stay an entire career at one locale if you want but your promotion chances are slim doing that.  Depends on what you really want to do.  ",
  "Did 21 years and took min retirement so could go back to Texas.  ",
  "Still a state officer.  Never said wasn’t active.  ",
  "You can get a 10\/22 Pre-86 trigger group.   They are not cheap.  But they do exist.  ",
  "Wasn’t trying fear monger.  I was being straight up on what they’ll do.  ",
  "Oh. And be quiet. ",
  "They already know.   I’ve got enough data on ANYONE in my NCIC terminal in my patrol car that I can get anything I want anyways.   This won’t create anything we don’t already have.   Literally in less than five mins can find all out anyways.  ",
  "More like 99%.  Not even ONE of the federal and state officers I’ve served with for 26 years would EVER do this.   Not ever.  \n\nYou must know a low life officers or don’t really know many personally off duty.  \n\nWhich means you’ve only dealt with them ON DUTY.  ",
  "Would like it to have « geo-fencing ».  Meaning that when your phone physically crosses over from one jurisdiction to another (state\/municipalities) that it auto populates the laws and updates them as you move so you’ll know exactly what the relevant statute is where you’re currently located.  \n\nWould like to see auto Form 1 and Form 4 generation capabilities.  \n\nWould like to see « see other CCW carriers » in any locale based on geofencing so one would be able to opt in to know where any other CCW carrier is at any given time.  \n\nWould like to see it incorporate yearly handgun quals into the data. \n\nHow about date warnings for when licenses are about to expire?\n\nAuto emergency calls to all pertinent family members and attorneys via a Siri enabled code when in a shooting.  \n\n",
  " And with lots of sweat and lack of sleep.  Lol.  ",
  "LOVE THAT GUY!!!  MAGA",
  "No.  Against many laws on those things.  But the department of the treasury can seize tax returns and federal licences on all kinds of stuff.   Passports.   Medical licenses.   Dental license.  ",
  "Several issues. Federal troops by law cannot participate.   And the overwhelming majority (over 95%) of the law enforcement agencies in the US will absolutely refuse to participate in a door to door gun confiscation.  \n\nThat leaves with this.  There’ll be very few people to collect the guns physically.  They’ll simply rely on the « good law abiding people » to turn them in. And when they don’t...they’ll start enforcing it the easy way.  They’ll use the IRS.  that means they’ll simply use the IRS to put a collection notice on your taxes and place a lien on your home or property until you turn over the guns.   It will take DECADES to even get 1% of the guns turned in or found.  \n\nIn other words, it’s a failed idea before it starts.  ",
  "Haha.  Welcome ",
  "Because I am a licensed federal retired officer.   ",
  "Rarely.  Lol.  ",
  "Yes.  I can carry ANYWHERE.  including Hawaii.  Anywhere that’s a state or a US protectorate ",
  "I only have mine to be exempt from the NICS check.  Otherwise I can carry anywhere in the US.  ",
  "Held in probate by the courts.   ",
  "If one government employee screwed it up there is reason to believe all will.   Especially considering that this process is supposed to be so « easy » to do.  Any moron can run prints and a NICS check.  If they have a person that cannot even do that right when placed into that position of trust then it’s clearly reasonable to believe the others are just as dumb (and especially so for that person’s boss!!!)",
  "Shhhhhhhhhhhhh",
  "Ran right down the rope.  It successfully did that.  ",
  "I couldn’t care less what he did.  Just hadn’t seen one. And since not a Glock immediately dismissed him anyways.  ",
  "Trash gun. I used one on each end of my boat as anchor weight a few years back.  Lol. ",
  "It wasn’t a Glock so he was immediately dismissed as a rookie.  ",
  "Where is « brandishing »?",
  "We use « deadly conduct ». But again.  No « brandishing ».  ",
  "The issues is WHICH 291???  Murderers?  Rapists?  Dems??  Do you know?",
  "Trust + government = ?????",
  "Two issues:  1.  If you have a Form 1 for them to manufacture a silencer sure they’ll legal.  2.  If posses them BEFORE you get the Form 1 back approved from BATFE then......\n\nBATFE has raided numerous businesses before on this issue. ",
  "We have no brandishing law in Texas.  Term doesn’t exist in our state law.  ",
  "If in Texas there would be three felonies here:   Gun in corrections facility.   Silencer in corrections facility.   Cell phone to take unauthorized photos in corrections facility.   LOL. ",
  "Even police officers aren’t perfect.   Accidents in life still happen.  The other day I forgot to put the gap cap back on my truck.   Life happens bro.  ",
  "Négligence is not a state crime under the Florida code. ",
  "Uzi around $12,000\nMK760 around $9,000\nMAC10 around $7,000\n\n",
  "The Form 4 is all about “transfer” and who can currently “posses” the NFA item.  It is not about editing or maintenance.  It FYI I want you suppressor to be nine feet long as long as the Form 4 matches the serialized part.  ",
  "Don’t forget women!!!  Lol.  ",
  "Fair enough.  See that point. ",
  "By that argument then the NFA and all these NY Safe Acts and other assault weapons bans are perfectly legal.  Right? ",
  "So, by that argument, since “due process” is in the 14th Amendment and a law passed and then enforced under that then assault weapons bans. The Hughes Amendment.  All that are all Constitutional.   ",
  "It would appear the Constitution is speaking against itself.  \n2A says shall not.  \n14th says can be taken away with due process\n\n\nThere is a legal standards in the cannons of ethics that says when two laws does against each other the courts  and the law shall always side on the favor of the defendants.  Meaning the 2A prevails because the least restrictive.  ",
  "The 2A is the protectorate of all other rights.  This has been widely discussed and believed in. \n\n14th Amendment when passed applied the Bills of Rights to the several states. \n\n",
  "Sorry.  I honestly was t trying to put words in your mouth. If I can across that way I sincerely apologize.  Not meant that way at all.  ",
  "That’s fair.  Everyone has their own beliefs. I never try to change the beliefs of others.  Just letting everyone know mine. ",
  "I am only saying what the document ratified in 1789 says.  Cannot read it any other way other than the wording.  ",
  "And yes.  I have been a licensed peace officer in both Mississippi and Texas for 26 years.  I swore to uphold the CONSTITUTION and any laws that are contrary to that document are uncommon their face. ",
  "And HOTTY TODDY!   At Ole Miss we read the law as it is written in the Constitution. Not what we WISH it was or what we perceive it to be.  What is is written word for word.  ",
  "I am NOT a part of that group at all.  Not in any way.  ",
  "I grew up in Jackson and went to school at Ole Miss and then grad school at USM and then Norwich ",
  "If you believe that mental health or criminal status should limit 2A then you believe in gun control. ",
  "Yes.  Those words.  Exactly. Because that’s what written in 2A.  Go re-read for yourself.  ",
  "The very law of “convicted felons shouldn’t have guns” is per se “gun control” which I do not believe in. \n\nYou either believe in “...shall not be infringed” or you do not.  It’s that simple. ",
  "If one believe that we are able to create laws that limit “...shall not be infringed” then that same person believes in gun control.  Which I do not believe in. ",
  "A whole lot of people on here claim the 2A is an affirmation of what comes from God.  Therefore no man should taketh away.  ",
  "They are a natural right from God.   Enough said ",
  "Here is my thought.  And saying this as nice as I can.  \nIf you take away a NATURAL RIGHT FROM GOD then you’re in the wrong.  Period.  And the 2A is an affirmation of the natural right from God of self defense. ",
  "2A says “....shall not be infringed” so convicted felons should be able to own.   Right there in plain language in Constitution.  ",
  "2A says “....shall not be infringed” so convicted felons should be able to own.   Right there in plain language in Constitution.  ",
  "As an officer, depending on the situation, I likely would have done the exact same thing \n\nHave a call for service from a citizen.  Whether justifiable or not isn’t relevant.  We cannot pick and choose which calls to respond to and which we can’t.  \n\nSuspicious persons in a vehicle.  Dark night.  In Chicago in an admittedly dangerous area.  Persons armed.  Take IDs and run them both.  Run both the DL and the CCW.   Whether I would disarm the persons like that officer did would depend highly on my gut feelings at the time and place.  Maybe that officer felt that he should.  Completely up to him and the law backs that up. \n\nBy all accounts they were nice and professional.   Nothing to see here.  10-8.  ",
  "True. No argument there.  ",
  "I have pulled my gun thousands of times and only had to shoot once in 26 year career thus far.  ",
  "ANY restrictions on owning firearms is unconstitutional.   Felons.  Crazy people.  Children.  Even Dems.   8 to 80, deaf blind or crazy.   Yes, I said it.  Any restriction on 2A is against the plain writing and textual statements of the Constitution.   ",
  "Remember.   99.999999999999% of gun encounters do NOT end with shots fired.  And if the minute percentage of those situations where shots are fired it is usually only one or two and they parasympathetic hormone and adrenaline pump will make the shooter not feel a thing in recoil.  ",
  "In that case t he transfer will have to go through an FFL.  suggest you call a gun store in the area where your friend lives.  \n\nAnd there is no way he is reported yet to NICS.  It takes MONTHS for anything like that to happen ",
  "A few questions:   \n\nHas your friend had his mental commitment submitted to NICS?  \n\nWhat exact state are you both in now?  \n\nWhat state are the firearms in?",
  "Not yet but will get some photos to post when I get home.  ",
  "That’s we’re all from Texas and speak with that wonderful drawl.  Oh wait.....that’s me.  Lol.  And it’s still true of course.  ",
  "Hahha. No worries bro.  ",
  "Thanks and will definitely call!",
  "Thanks!  ",
  "Hornady GMX 150 grains. ",
  "As long as I have been an officer I can tell you NO CHANCE she gets charged ",
  "Absolutely!!!!   And I have my reserve ID so would like to know more about shooting at Camp Billie (I am a Captain in the reserves).  \n\nWould love to get some help from you and THANKS!!!",
  "Hahahahaha.   Good one.  Made me laugh.  ",
  "Will do!  ",
  "Every single time I put a case with the powder and the primer into the die and try to Seat the bullet it puts a VERY LARGE dent into the side of the case.  Pretty sure I have the dues set incorrect.  Need assistance setting up in person so they can show me.  I am a kinetic learner.   ",
  "I will personally murder in cold blood any person that comes to me and tries to confiscate any weapon I have.   \nYou have been warned.   I don’t care how old, young, make, female, or from planet Neptune.   Anyone that comes for my weapons, no matter if your a ten year old child or a 110 year old great grandfather I will KILL\nYOU DEAD.    \nWanted to make sure we are clear on my intentions for anyone that might want my toys.  ",
  "Wait.   Take a VERY SMALL portion of that back.  If you’ve got a .577 double rifle I will confiscate that.  Always wanted one to take to Africa for a hunt.  Hahahahaha.  ",
  "Nope.  Will quietly retire and become an outlaw.   Giving it to you straight.  I will not be involved with any type of confiscation plan.   Ever.  ",
  "Yes. They are for clearing.  But essentially the same as this guys set up.  \n\nAnd yes.  Was cringy while watching.  But not horribly unsafe.  ",
  "Vast majority of jobs are less than 24 hours.   Only had one go for two weeks.  ",
  "Oh we have a very large referral\nNetwork.  What I am saying is that every job is\nNot ideal.   There have been more than a few that I’d be glad to put a bullet in my damned self.   Lol.  ",
  "We don’t work for the protctee Keep that in mind. They are NOT our boss.   Not even close.   ",
  "Clearly\nYou have no kids or a mortgage.  Wish I was wealthy like you sir.  ",
  "And I work off duty for ALL KINDS of people and\nPlaces.   Even a movie cinemas.  ",
  "And could not care less who you work for or what.   Expect the same treatment from others for me.  ",
  "So ALL FBI agents.  And ALL military personnel.  And ALL Secret Service agents.  ALL EXECUTIVE branch personnel en masse should quit as soon as a Democrat is elected.  That’s basically what you’re saying.  Nice thoughts.   ",
  "Here it is.   1.   If you both live at the same home, and assuming she has no firearms disabilities (legal terminology for cannot possess) and a burglar breaks or whatever other situation causes her to access the firearm and use for self defense then she is perfectly fine to use the weapon EVEN IF YOU’RE NOT HOME under a legal theory known as “NECESSITY”.  This is a legal theory whereby actions taken by an actor to restore order or safety are considered constitutional.  \n\n2.  If accessed under other circumstances where the husband is there then all is good.  If accessed while husband is NOT there and not under a legal exception or strict emergent circumstances then the BATFE and federal prosecutors might think about charging but most likely not.    \n\n3.  If wife accessed in a clearly illegal manner such as she decides one day or her own that she wants to take it and sell it for extra money when you’re not home then she is almost certainly going to be charged then.   \n\nTake it this way.  If she is reckless then she’ll be charged.  If honestly protecting her life or her child life then no way she’ll be charged.  ",
  "I love the old school walnut stocks.  ",
  "Basically the X Bolt is the new A Bolt.  Agreed.  ",
  "As an officer that uses LEOSA off duty to make extra money on the side as security around the country I can tell you 100% we do not ever care what the person’s name is or what they believe or what that topic is or what their political message or what or sex they are.   They pay money and we are there.  Simple economics.   Same EXACT thing with the US Secret Service and the Department of State Diplomatic Security.  We are there for a JOB and for the MONEY.   \n\nDon’t confuse a job with ideals.  They are not the same thing.  ",
  "In the military we have a discharge barrel next to the armory that is the size of a large coffee can and we do the same thing this guy did.  Are you saying that every military base is unsafe in this??",
  "Browning A-Bolt Medallion in .308 with threaded barrel so can add a silencer later.   Fantastic rifles with great reputation for hunting and range time. ",
  "No.  State. ",
  "Shoot that through a SilencerCo Hybrid and you’ll\nBe fine ",
  "Per the federal Paperwork Reduction Act of 1980 one might summize they are required to accept a digital version. ",
  "Lighten up George. ",
  "I an currently qualified on my .357.  I could carry it on shift if I wanted.   They tylenof weapon has zero to do with policing.  In 26 years only used my weapon once.   So if you go by the shear number of shots fired (three) in my incident I have twice as many as required.   Lol.  ",
  "A traditional M16 and a regular AR15\/10\/M4 only have FIVE different parts.  \n\nIf you use a RDIAS there is only ONE different part.  \n\nIn other words the overwhelming majority of the guns are exactly the same.  I personally own multiple of each and have used the full auto version in battle on active duty.  They are effectively the same gun.  In fact, i RARELY use my M16A3 in burst on active duty.  Mostly semi.   Better weapons control and fire control.  ",
  "I pray to all my NFA items daily and thank the almighty God above for them.  For that reason under the auspices of MASTERPIECE BAKESHOP VS COLORADO CIVIL RIGHTS COMMISSION, I certify my weapons are part of my Godly practice of religion daily.  ",
  "You’d be correct.  Lol. ",
  "Have a buddy that has an FEL magazine. ",
  "Rule is that it has to be “permanently affixed” tomeither the end cap or the body.  I am going to use the end cap and then when timento fire going to screw another “end cap over that end cap” so that the serial number, in theory, is protected during blast phase. ",
  "Yes.  Pre-86 transferables ",
  "I am doing a Form 1 for the pipe bomb.  Yep building myself.   Obviously I have to submit plans and specs and storage requirements to BATFE. ",
  "Bang!!!   That’s the point.  Lol. ",
  "Live one.   Going through NFA Form 1.  Going to use black powder for low explosive. ",
  "Yes.  Serialized exactly as any other NFA item. ",
  "I have a life goal of having at least one of every NFA item. ",
  "So you admit it’s an assault rifle?   Lol.  Kidding ",
  "I am in the process right now of doing a Form 1 for a pipe bomb.   Texas Machine Gun and Ordnance also sells a small DD grenade and pipe bomb sommay do on a Form 4. ",
  "Yeah; I am with you on this one.  Anyone that shoots up kidd st anschool isnansoecial kind of evil and needs to be hung live in the town square.   You’ll get no argument from me on that one bro.  ",
  "There is significant gun control here in Texas.   It’s called the NFA.  And LTC laws.   And sales tax laws for guns.   And FOPA.  and Hughes.   And GCA.  \n\nAll illegal laws under 2A.  So yeah, we have gun control here in Texas too.  The difference is that we are not happy about it.  The looks in California are happy to have those and more!!!!",
  "I have NEVER said gun control is unique to California.   I am only saying the people there so strongly WANT gun control that it’s now a lost cause and time to leave.   Was in LA a few years ago.  Took me five minutes to see California is completely out of their ever loving mind. ",
  "Then why do you have those laws?   Do you not vote?",
  "The way the country is moving more and more liberal every single year ALL THE STATES ARE NEXT!!!!    Yes, that’s a sad and horrible statement to make.   Makes me very angry.  But it’s true.   ",
  "It is 100% over for California. Was there a few years ago.   Took literally FIVE MINUTES after getting to the airport there to see the absolute ruin and disgust.   Place was atrocious.  Only worse place I’ve been to was Newark NJ and Um Q’sr Iraq.  And both of those really sucked.   \n\nBesides.   California is voting  to separate themselves from the US.  That’s proof enough right there they will never change and the cause is lost.",
  "Since you’re a Marine that means you can adapt and overcome.  Figure out a way to either leave or change the laws.  As a CITIZEN there in California that means it’s on you.   The citizens there voted for those crazy ass people there that make these laws and it is your responsibility to make changes.  Take your Marine leadership and run for office.  ",
  "Enforced by MANY different agencies. Prosecuted by the assistant US Attorney in whichever district the crime was committed or DC.  Any federal crime can be prosecuted in DC.  Called “venue” in legal terms. ",
  "192,000 on the registry.   ",
  "Anyone that voluntarily stays in California has no one to blame but themselves.   I have no pity for you.  They know the state is anti 2A and yet volunteered to remain there and even try to own a gun there (which we all know is illegal under the California laws to possess a weapon). So blame the guy or gal in the mirror.   Did this to yourself.  ",
  "Same here. ",
  "You can go to 100 officers you meet and not less than 95 of them would have any clue whatsoever what the individual nuances of the NFA guidance are.   That is just not something the vast majority of officers deal with on a daily basis.  Just the way things are.  \n\nLet me give you an example:   I have zero clue what the casino licensing criminal statutes are for the Indians casinos here in Texas.  Yes, there are individual state laws for the casinos but there are specialized officers who train for those type of law enforcement.  Same with the NFA.  Local officers just don’t deal with that.  ",
  "Nothing.  That’s a FEDERAL statute and state officials have zero jurisdiction on that issue.  For that reason we take no enforcement actions whatsoever.  Take an info report for the call and then 10-8. ",
  "Child porn.  Was a typo ",
  "If you’re like me then I am assuming you’ve got far larger issues to worry about on patrol than this.  I know I do.",
  "The shouldering if a brace is the VERY LEAST of our worries on a daily basis.  I have FAR LARGER things to worry about arresting people for.   Like drugs. Child open. Robbery.  \nYour range time means shit to us.   Could not care less.   ",
  "Yes, I’d like the sesame chicken please.  With one spring roll.  ",
  "that was WAY before the new AR15 hate age we are in now.  You're comparing different things.  The new Dem push is gun control and it is GOING to happen.  just watch.",
  "The number of BATFE and SBR related prosecutions each year based on constructive possession where the individual was not a dealer and was prosecuted as a regular civilian (not in the industry) can be likely counted on one hand.  There are VERY few cases that are actually prosecuted.  \n\nAs an officer with going on three decades of work I can tell you that it is almost never seen.  BATFE deals mostly with VERY LARGE criminal enterprises where a licensed dealer is usually involved in a criminal conspiracy and not the average joe that accidentally made an SBR.  federal prosecutions don’t work like that.  ",
  "They make a Browning BLR takedown rifle that is magnificent.  ",
  "Yep yep ",
  "This EXACTLY!   The harsh reality is that the BATFE the VERY DAY that the Dems take back over the government via both chambers of the Congress and the Presidency they are 100000000000000% guaranteed to adopt wide-ranging new NFA laws and the pistol caliber “bracey-thingy” is dead meat!!!!!!\n\nSo, yes, all my toys are registered because the day is coming.  Down vote this if you must.  But just wait and see.   Just wait and see. ",
  "Two things.  Never speak of. It again.   Ever.  \nNext thing....graduate and get commissioned as an officer.  You can even get commissioned in a police career field as a 2dLt and make HUGE money st the end of your 20 year career.  You’ll make wayyyyy more money than any patrol officer and you can retire in a nice life.  ",
  "Porn or stripper cause everybody wants to see a 46 year old balding white guy take off his clothes for money.  Lol.  ",
  "????  ",
  "I am thinking of a word.   It starts something like TEXAS!",
  "That’s a good shoot.  Would’ve done same exact thing.  Any wild animal that has zero fear of the officer means has also zero fear of children and could become a giant danger to a youth.    Right call to make.  ",
  "Take them all to your local range and ask if they have gun storage fees.   Heck, you could even “pawn” them and pay the differences.  That way you can pay the small fees monthly and get them out when you’re done!",
  "Here’s the issue for me.  Been a police officer for 26 years now as state licensed in two states and the federal government.   It is going to be real interesting being on the side of the “Rebels” when they pass the next gun ban because I am going to be an outlaw and that’s going to go over like a lead balloon with the State of Texas due to my licensure and status.  ",
  "If I could e liked your comment a thousand times I would sit here and do it.  Now that’s some funny shit sir!",
  "Here’s the issue with the next one.  The hack politicians have learned their lessons. They next one there will be no sunset clause and you can damned well be the AR and AK, along with ANY variant, will be banned.   And the sad part???  They will most certainly get it.  \n\nThe country is leaning more and more left and more and more anti-gun daily.  And even more so anti-black rifles.  Just watch.  This next ban they most certainly get eventually passed is going to be a doozy.  ",
  "It like mostly illegal.  Like stage 3 illegal.  ",
  "Assuming you’re likely going for three years to Fort Drum.  The wording gives it away.  \n\nSuggest you continue the process and take leave to go finish up once all NFA stuff is done.  Do not change your state of residence on your LES and keep same free state DL and damned sure not New York.  \n\nAfter you’re approved and get the goodies have them stored.   Securely!!!!",
  "As a liberal officer I am assuming you only have 10 rounds or less in your mags?   ",
  "Vers 45 or 50 could also work.  But the Hybrid is better ",
  "That 10 question check card better be covered under Garrity or I’m not answering shit. ",
  "Ehhhhhhhhh one and the same.  ",
  "They clearly didn’t have enough or the right medication.  ",
  "Criminals are .....well....criminals.  \nAll criminals share one thing in common.  They’re criminals.  ",
  "Those people are idiots.  Just dismiss them like I do. They are insignificant.  ",
  "Who thinks that only police should have guns?   I certainly have never said that.  ",
  "It sure helps in “points” for hiring purposes.  There are some tangible leadership items that come out of serving your country also.  But they are not a direct causation between making a good officer and a bad officer.  ",
  "Why is this relevant?",
  "Here is something you need to add to your formula.  Th vast majority of police officers are also CCW holders.  The reason:  because as police officers we have the same federal guidelines to abide by as anyone else.  So we get our CCW\/LTC so we are also exempt from the NICS check. \n\nQuestion:  Did you go through and extrapolate our all police officers that also have their concealed carry permits so that it is now a true comparison of numbers and percentages?  ",
  "In non gang affiliation and non suicide, you’re FAR more likely to die of \n\nAuto accidents\nFalling \nDrug overdose accidents \nDrowning \nBicycle \nOn the job injuries \nMedical malpractice \n\nThere are dozens more.  If you are not in a gang and you don’t kill yourself, then your chances of dying by a firearm are MINUSCULE at best!   \n\nSo there begs the question:  Why do all of us CCW?  Easy answer, be cause we have shitty luck and the change, however small, still exists.  ",
  "Would seem like a good lawsuit to me for that officer!",
  "Wrong!  \nGraham v O’Connor is the Supreme Court case regarding use of force and how the court must look through the eyes of the person st the scene at the exact time of the shooting and cannot Monday Morning Quarterback what they “wish” would’ve happened.   Suggest you go read up.  ",
  "Graham vs O’Connor.  That’s your standard.   Go review. ",
  "All true!  You’ll get no argument from me.  Fantastic weapon. The A5 will put meat on the table every time.  I have seen the old timer drop 130 pound does with power using Double OO.  ",
  "Browning BAR in .308.  Fantastic rifle. Great for deer and elk.  Even bear.   Minimal recoil.  Shoots flat.  Easy to scope and super accurate with fast follow up shots.  \n\nAs for battle rifle.   Likely will never need.  ",
  "Gun show.   Plenty of people walking around with “for sale” signs on their guns.  They want cash. And that’s it. ",
  "Get either a Browning Auto 5 or a Remington 1100.  Both are fantastic auto loaders.  You’ll\nNot regret either.  ",
  "Yes.  Misdemeanor false identify and false swearing is just about everywhere.  I was referring to felonies actions that get time to actually serve. ",
  "Yep yep. ",
  "Not a chance. They’ll NEVER get charged.  \nOnly time anyone bet gets charged simply for lying to the “police” is when someone tells a federal officer something untrue during an investigation. And then the max is 5 years.   But that is a very rare event.  ",
  "Wait. Didn’t realize we are talking about LTC holders. They can ",
  "PTSD is not a firearms disability cause.  Just dumb. ",
  "He’s correct. I am a Texas peace officer and I can confirm that it cannot be in plain sight inside a vehicle.  Must be concealed.  ",
  "Being a company commander.  Nothing beats being a captain of a company.  100% for me the best job there is anywhere! Would I like to go back on the streets?  SOME DAYS HELL YEAH! ",
  "Haha. Yep already know that.  But yeah. Mostly the same. But the advances in metallurgy and engraving and certainly precision technology are far far more advanced than before.  And weight also \n\nBut true that most people only care about the lower.  ",
  "HOTTY TODDY!!!!",
  "Browning A-Bolt in 25-06.  Never failed me.  ",
  "As an owner of pre-1986 full auto I can tell you the differences are mechanical.  Post samples now are much more mechanically sound than previous ones.  \n\nThey work basically the same but the reality is that technology has evolved significantly since 1986 on firearms processes.  ",
  "I HAVE BIG PANTS!!!  Lol. ",
  "Amazing how people are more than willing to open carry their handguns but not their rifles.  ",
  "Yep yep.   Sucks ",
  "Guess I carried my 240Bravo in Iraq wrongly too.  And guess I’ll let my Ma Deuce gunner in the touret know that you said he has his weapon loaded wrong.  Thanks for your insight.  ",
  "Yes.  Carrying in the chamber is by far the most efficient.  But at least he is carrying.  The vast majority don’t do that.  At all.  None.  \n\nDo you keep your yellow safety tag on your fire extinguishers at home?   Or do you take them all off and remove all the safeties?  I ask because they might slow you down in a fire.  ",
  "We carry our M240Bravo and MK19 on halfload too.  Guess that’s not acceptable either.  ",
  "Bwahahahaha.  Not.  Attacked an officer and caused a felony discharge that injured officer and bystanders.   That’s a LONG sentence coming.  ",
  "Great. Another idiot that thinks everyone must carry like he does.  Great. It is people like you that make others feel\nUncomfortable.  ",
  "Yeah. Likely right.  Might get 15 min. ",
  "Pure will.  ",
  "Yeah, there are jurisdictions here in Texas where aggravated assault on a peace officer you’re looking at easily 10 to likely 15 year sentence for a first time conviction with no priors.  If he had prior convictions for any other felony then you’re looking at 25 to 30 years.  ",
  "Nothing wrong at all with this.  In fact, since we are all numbers people and we gun owners claim that there are some estimated 2 million times a years where legal\nGun owners have defended themselves then that means the OVERWHELMING amount of time even if the gun was completely empty with no rounds even in the magazine it would have still been a deterrent.   The whole goal of CCW is to deter before firing a shot.  Yes, one must be ready to fire a shot and use deadly force if required, but also as the OP found out today merely the presence of a weapon can cause others to stop aggressive actions.  If this were not true, then there would be hundreds and hundreds of officer involved shootings and also CCW involved shootings every single day.  \n\nRemember the use of force continuum.   “Presence”’is the first rung of the use of force continuum ladder.   There are numerous intermediary steps on the ladder between that and the end of deadly force.  If you don’t know this then you should not be carrying.  ",
  "Wrong!!!!!   Don’t think that way.  Carry how YOU feel\nComfortable and not how others don it is your life and not theirs.    Fuck them.  Do YOU!",
  "Google “Charter Arms pathfinder.22.  ",
  "This is a Charter Arms revolver.   If it only says those “pathfinder.22” then it is not an.22 mag.   ",
  "Min of 10 years ",
  "Yep. ",
  "Yep. ",
  "And Kimber’s are for pussies ",
  "Go fuck yourself. If you were here I’d beat your ass",
  "And please do not get me wrong.  I am a HUGE supporter of the 2A.  Take my family shooting and hunting all the time.  Both as an officer and a private person I go to the range weekly.  \n\nI just happen to believe we are now passed the point where we can honestly say any teen is able to be called responsible with a firearm.  They’ll simply shoot each other at school.  ",
  "Now go add in the numbers where teens took their father’s firearms and went and killed a classmate at school.  Cause if it’s my child even one is too many.  \n\nWhat is your acceptable number please?",
  "Softball game is one thing.  I they are saying is to wait for what the Republican response will be if the direct child of a Republican it actually murdered in a high school classroom.  That is when we shall finally see where that Republican stands on gun control.  ",
  "If I ever decide to become a criminal I am buying that exact gun.  Lol.  It only needs to fire once.   Reload won’t be needed. ",
  "Industrial grade anti-perspirant for when you sweat your ass off under that vest.  Lol. ",
  "Exactly that.  ",
  "And Officer Pierce was probably a great guy. No doubt!\n\nBut I want federal Department of Justice intervention.  Time to quit playing softtoss with these kids that all want to shoot up their schools.  Need to play hardball.  ",
  "Their actions the last few years with what they are clearly more than willing to do to each other at school with their daddy’s guns more than Sykes tu me they cannot be treated any way other than being controlled.  Because if the teens where showing us any level of responsibility they wouldn’t be shooting each other in art class.  ",
  "Not a school resource officer...federal officers with federal academy training and licensure run by the Department of Justice.  Federal agents with nationwide authority to act in any school anywhere.   Have a force of at least 10 in every school.  Two supervisory and eight federal line officers.  \n\nIt is time quit the bullshit and we attach this school shootings with authority and precision.  No matter the financial costs.   If we can afford to buy submarines and aircraft carriers then we can afford federal officers and agents as a force in all schools.  Time to take a hardline stance. ",
  "It is no longer “reasonable for a parent to have fir arms in safe reach” because their kids are now steaming them and shooting their classmates with the.  \nThe days you and I grew up in are long gone!    ",
  "Here is a dose of reality.  The vast majority (not you and I) have clearly shown lately they are not willing to individually take firearms responsibility seriously. They are not willing to teach their children and the children are then willing to feloniously use the firearms to harm other children in school.  No arguing that fact.  Happening more and more. \n\nAs a company commander my job is to watch over those junior enlisted and NCOs.  My job is literally their babysitter.  Spend almost every weekend wondering which call I am getting next...dui, drugs, arrested rape, you name it they do it!!!!\n\nIt is high time we treat our teens like they are junior enlisted.   Why??  Because they’ve CLEARLY shown they cannot be trusted any more with guns or anything else.   Just look....they eat Tide lids and sleep with their teachers!!!!!\n\nSchool should be like prison cause most of them I see on my command for 19 year olds act like they need I be in prison!!",
  "Negligently unsecured equals felony to me.  Especially so if used in a crime of violence ",
  "Cancel Medicaid.  ",
  "And yes.  My NFA items are 100% secured. I know the danger they pose.  Especially so to teens.  ",
  "Yes.  Anything can be broken into.  What I want to address is those that do nothing.  And we must address things at the lowest common denominator because sadly there are a significant number of gin owners that are not willing to do anything at all.  Literally put on nightstand that’s it.  ",
  "If your car had seatbelts and headlights and turn signals.  Why not some before positive measures in schools?   Airport screening and sniffers.   Federal officers.   Good start on both of those. ",
  "So you’re okay with a small amount of child murder.  Long as not yours ",
  "Go say that in Parkland.  Or Pearl.  Or Springland.  Or Columbine.  \n\nSo you’re okay with a small murder rate with kids.  Got it.  ",
  "Here’s the problem with individual responsibility now in the age of school shootings.  When JUST ONE parent fails in their individual responsibility they ONE PARENT has now sentenced the rest of our children to being murdered at school. I live in south Texas where the last 2’of 3 major shootings happened.   \n\nYou’re okay with this?   Not once have i suggested restricting gun rights.  Not once.  Adults can take them anywhere you want.  But properly SECURING them is the question.  Not just storing them.  Securing. ",
  "Can your child at school do without that?   The last 34 months in the US would seem to indicate NO.  \n\nKids are not safe going to school. I live here in Texas where it is painfully obvious our kids are in significant danger of now being murdered daily at school.   Just sad.   And TRUE!",
  "Good.  And with Liberty, according to our Founding Fathers also comes responsibility to the Republic and our fellow man.  Or do you disagree with the Founding Fathers since you’ve chosen liberty??",
  "So you chose for your children to go to school unsafely?   ",
  "Yes you do.   Keep it on you 100% of the time or keep it properly secured at a facility that can do so.  It is “available”.  Just have to go get it.  Caused adult efforts.  ",
  "Yep. Fine by me.  I get up at 0430 daily.  Why can’t others?",
  "Agreed.  We would have to legally define that which is secure.  No doubt.  \n\nBut leaving a gun in an unlocked drawer for your son to take to school surely isn’t it. ",
  "Of course.  You failed to answer.  Nice. ",
  "Oh. And go fuck yourself. ",
  " I am not an ex.  ",
  "And there you have it.  You ONLY cause about what involved yourself and not what involves the others.  \n\nI suggest you never have children. You’re not nearly responsible enough.   ",
  "So what you’re really saying is that school shootings are a minimally acceptable outside of the fact that we live in a free society and have our 2A rights (of which I am very strong on 2A).  I just believe we have a duty as parents and gun owners to properly SECURE our weapons and our schools. ",
  "So what price tag is your child?  So what price tag are your 2A rights?  Come on, give us a number!   ",
  "There will be very few thefts if we PROPERLY secure our weapons.  ",
  "Not just metal detectors.    Airport 3D  body screeners and sniffers.   ",
  "Zero of what you just said will stop school shootings.  \nAnd our kids are sitting ducks EVERYWHERE. Not just in Gun Free Zones.  ",
  "If you cannot afford a safe then you’re responsible for taking other appropriate securing methods.   There are many others.   Taking your weapon to the armory works. They’ll even do it for free on base.  Take to the local gun range and rent small secure locker.  My range has a fantastic storage system!!",
  "If you FAIL to secure your weapons and you did so knowing there are minor children that can take them.  Yes!!\n\nTake this example. When I was on active duty in the military I had to have 100% positive control of my weapon.  If I left it sitting unsecured and it was taken the I AM RESPONSIBLE FOR THAT TAKING!   Same thing here.  You’re to be held responsible for the positive control of your weapon at all times.   If it’s good enough for our military then it’s good enough for you.   ",
  "I could live with as much private function as possible; as long as the actual officers in the school are federal Department of Justice officers with full federal authority.  That way they have access to all federal investigative resources and prosecutions for ANY WEAPONS CRIMES involving a school or a minor that attends said school.   We have to strike absolute fear into anyone’s that even considering a school shooting.  ",
  "Gorgeous ",
  "Oh and one other thing.  You and I are in complete agreement about about the reallocation of the funds.   They could cancel several worthless government expenditures to pay for this.  There are other not working programs that could be eliminated to pay for this.  ",
  "UCMJ is specifically only for military.   That’s just the way things are on that.  \nYes,  Mr  Israel should be locked up and throws way the key.  Piece of trash. \n\nSo,  AND  I AM ONLY ASKING HERE!   You stated “I cannot applaud the price tag”.  Two questions:  1.  At what price point is your child?   2.  At what price point is your 2A right?",
  "I actually deer hunt with my Glock 22 frequently.  She makes a fantastic doe weapon for roughly 30 yards and in.  ",
  "20 max in Texas ",
  "Here is a reality. We HAVE to do something about these school shootings.   \n\nI am a VERY STRONG supporter of the 2A.  I own several NFA items to include full autos.  I am a state certified peace officer in two states and the federal government (retired)\n\nSo I say this with significant experience but also grave concern.  We, as gun owners, need to think seriously about school shootings.  What can we, as gun owners en mass, do to lower and hopefully eradicate guns being used in schools by teens.   Well, I have a few ideas. \n\n1. Licensed FEDERAL police officers in every school in America.  The schools receive monies from the Department of Education so that clearly makes it under the purview of the federal government.  \n\n2.   MAKE IT A CAPITAL FELONY to leave any weapon unsecured resulting in a minor or any other person taking said unsecured weapon and using it in a crime of violence. Yes, you read that right.  CAPITAL FELONY!!!!!   \n\n3.   Allow any ADULT employee of any school to carry.   And NOT a student that happens to be 18. Not what I mean.  \n\n4.   One entrance and one exit to all schools with AIRPORT 3D DIGITAL SECURITY SCREENING AND SNIFFERS.  \n\nYES, the above will cost hundreds of billions.   I know that. But what are our kids worth and what are our gun rights worth.  This way hopefully we can save BOTH!\n\n\nAnd finally.   CAPITAL FELONY for any criminal use of a weapon for everybody.  If you use a gun illegally, even in a drive by, murder, aggravated assault, whatever....CAPITAL FELONY!!!!!!",
  "It is incredibly SUPER POPULAR.  I say this because literally hundreds of thousands of officers carry this exact gun daily.   ",
  "State park police jobs are cake.  ",
  "100% agree.  The FBI checks are the weak link.  ",
  "Yeah.  Saw that. Very sad.  And here my home state of Texas too.  Just cannot figure out why people have this thing about killing each other.  ",
  "ANY restriction no matter how slight is my view is a violation of 2A.  Why?  Because our Founding Fathers said so.  The hard part for my being a licensed peace officer is dealing with that on a professional and personal level st the same time.  Not easy.  ",
  "If you can read plain English “...shall NOT be infringed”.  Are you saying it says something else?\nWe all claim on here that the 2A is inviolate.  \nAre you saying now something different?  Cause that would be hypocritical and against the plain wording of 2A.  ",
  "True.  No arguments there.  ",
  "Man the FBI background process is taking months these days.  ",
  "Magazine well.  Clearly!!!!  Lol. ",
  "...shall not be infringed”.  Any violation of that. Even for felons = unconstitutional ",
  "Taking away guns right EVER is ALWAYS unconstitutional cause “...shall not be infringed”.  ",
  "Shhhhhhhhhh",
  "Sorry ",
  "And it’s police officer.  Not “cop”. Idiot. ",
  "Blocked moron. ",
  "Blocked cause you’re a moron ",
  "The first thing you do when you’re is trouble is quit digging!    Shovel?  Bwahahahaha.  Dumbass chick ",
  "Sure.  Be glad to expand.  Because you’re open carrying to make a “look at me!!!!”   You’re so childish that you need to show the world “I am armed motherfucker”.  \n\nAnd I will speak for you anytime I want.  And I do know you. See you on patrol all the time when we get calls for you.  You typically all follow the same exact pattern.  YOUNG and a total joke.  In fact, you’re so defensive cause that’s likely YOUR photo.  Hahahaha ",
  "There is a very good reason that there are more than three times as many suicides yearly than homicides.   Depression makes you dangerous to yourself and others.  Long research has proven over and over in studies showing this to be true.   \n\nYes, even crazy, depressed, suicidal, loony, bi-polar, or whatever else people are protected under their rights under the 2A.  But with that right comes the responsibility of knowing when to NOT have a weapon.    ",
  "This.  This right here in this photo.  This is why Open Carry is so dumb.  He is their poster child. The ONLY way this could get any more stereotypical is if he had a GoPro on myself making himself look stupid.  Literally every single open carrier you see where I live is this guy right here.  Over weight, young, and usually with a GoPro.   It is just sad and pathetic really.  \n\nThe funny part is truly how much we laugh at them behind their backs after they’re done ranting about “my rights to carry however I feel”.   Go ahead buddy, we’ve longggggggggggggg ago stopped giving a shit about open carrier stupidity.   I barely even respond to those 911 calls anymore.  Any if I do actually see one...and they ALL look like this dude in south side San Antonio...then only watch them for a few minutes to make sure they’re not doing anything other than standing there.   Might run their plates if see them get into a car to verify they have no warrants.  Otherwise:  10-8.  ",
  "There are THOUSANDS of people in this forum that think that way.  ",
  "Silence. Don’t remember giving you permission to speak.  ",
  "No sense of humor whatsoever.  Man y’all really are dumb. ",
  "Wait.  You honestly thought that was serious.  ????",
  "The 2 Amendment protects you buddy. Go ahead.  You’re in the clear.  :-)",
  "One might argue (as we are all such STAUNCH 2A supporters) that being able to 3D print suppressors is protected under the Constitution and our God given right.   And by calling the cops you’re turning your back on that which we all argue should be protected in the first place.  \n\nSee my point?",
  "No.  Not did just being asked ",
  "US Flag with police under it.  ",
  "Agreed.  It is super hard.   But must be done.  They’re going to bleed people dry one video and content log st a time.  ",
  "$200 for a transfer is out of touch with reality.  ",
  "I am quite familiar with how goods and services work.  If you’re the only guy for hundreds of miles and you intentionally charge $500 to transfer one then I personally believe you’re taking advantage of people.  \nSame thing for a water bottle company owner that’s the only one open for business during an emergency weather outage and then charges $100 a case for water.   Yes people do that crap!!!!   It is called taking advantage. And in some cases during certain events it is even CRIMINAL for their actions and can be prosecuted and then sued.  \n\nThe reality is that it takes any reasonable SOT about 30 mins to do the actual paperwork.  \n\nBut hey.  Guess America is capitalism at its greatest.   Just feel a little different when someone KNOWINGLY takes over a position on people that have no other option.  ",
  "Guess you need to move to Texas where went don’t charge ridiculous prices like that.  Just wow. ",
  "Good point!!!",
  "99% chance prosecutors will lead her plead to a misdemeanor if she had never had any other arrests or convictions.   But this is going to be painful for her for a while.   She made a very bad decision.  If she hurt the officer it wouldn’t been WAY worse.   \n\nHumility before the prosecutor is her best effort.  And a sincere apology to the officer and the prosecutor is going to help.   And delivered in person!   He guilt is likely not in question here.   ",
  "Go watch Military Arms Channel on this.  Tim did an episode on this specific issue some time back.   Great video.  Just google it     It’s also on YouTube. ",
  "Anyone that’s willing to pay $200 means absolutely nothing.   ",
  "If you pay $200 to just transfer you’re getting fleeced.  That is complete INSANITY.  HELL NO.  ",
  "My Huntertown Arms Guardian SS have run perfectly for YEARS with zero problems.  It built like a tank for an.22 can.  Love it.  ",
  "I sort of do.  I have a suppressed 22\/45 Ruger with a Huntertown Arms Guardian SS that I keel loaded in my backpack for hiking when family goes camping.  Use only for our in the woods so that is CCW.  But not daily.  ",
  "Go to OSS Academy.  Google that name.  They have a ton of CERTIFIED training courses on their.  In Texas we have to get 40 hours of continuing education every two years.   Lots of us use OSS Academy for our hours.  They are relatively cheap and only take three our four hours to complete most courses.  Again they’re CERTIFIED to provide state licensure education!!!!!",
  "I have NEVER paid more than $50 for an NFA transfer.   ",
  "No.   You can use the kiosk for only the prints and then manually use their website to fill out the Firm 4.  Print off and then send to your own SOT. you can also pay an extra $15 for each extra set copy of your digital prints and they’ll even mail them to you!!",
  "Good to hear.  Glad they’re taking care of the veterans. ",
  "The ones that don’t would be the exception. ",
  "Agreed.  ",
  "If you judge a entire population or race by FAR LESS than 1% of what that population does you’re doing the exact same thing with police officers.  For the prior it’s called racism. For the latter it’s called Pre-judging.  \n\nBoth are the signs of a weak mind.   ",
  "Hell yeah!   I’ll buy that next. Thanks ",
  "4,217.  Give or take ",
  "I have asked this very issue with several officers both in person and on here.  NOT ONE OFFICER SAID THEY WOULD EVER PARTICIPATE IN ANY TYPE OF FIREARMS CONFISCATION.   NOT ONE!!!!\n\nSo get that thought out if your mind. We love guns and the Constitution too!  We are not doing that shit.   You people are conspiracy theorists.   Just ridiculous.  ",
  "Bwahahahaha.  Yeah painful.   Sorry bro. ",
  "Have you ever seen a picture of Alison Aires?  Yikes. ",
  "Omg Samoas are freaking good. ",
  "Deal!!",
  "Ahhhhhhhhh. My bad. Yeah not good.  ",
  "Murder my ex wife.   Slowly.  \n\nOh wait.  I’ll steal a truck load of those thin mint Girl Scout cookies.   Yeah.  That’s what I’d do.  ",
  "The fuck this place turning into boys.   Just sucks lately. ",
  "Please tell me it’s not an NFA item.  If not likely okay.  ",
  "Dead wrong.  Recruits in their last weeks of the academy do ride alongside regular officers.  Unarmed recruits are a force multiplier.   You don’t have to have a gun to an officer.  The professional officer uses their demeanor and statesmanship to command.  You’ll learn this later in your career.   ",
  "Yep yep.   I loved the cash I made in Iraq.  In 1990.  Lol. ",
  "If you can afford the $4,000.   Lol. ",
  "You can carry anyway you like.  Unless you’re a child sex predator doubt I’ll be running into or arresting you.  Gun laws aren’t what I specialize in m.  Wayyyyyyyyy bugger issues. ",
  "Carry however you like. Don’t know you and don’t care. ",
  "And he’s an idiot.  Fire then all.  \nDon’t use an exception to justify a rule.  Called being an adult. ",
  "I would’ve sprayed her.  100%.  ",
  "K.  ",
  "Vote to update the 2A to say concealed ",
  "Generally speaking they are sold at auction and money goes fo the general funds ",
  "Ok. ",
  "Ok ",
  "2nd Amendment says nothing about right to CONCEALED carry.  On right to bear arms.  Go reread.  ",
  "For the record.  I think universal reciprocity concealed carry is a great idea.  But not this piecemeal patch work of laws.  One federal law and one carry ID with the exact same standards for all.   ",
  "Again.  Go vote.  That’s your right. If you don’t like a law vote change.  Good luck. ",
  "It is not a “special privilege”. It’s a responsibility.  Big difference.  \nHere’s the deal. If you’re out with your family and a gunman comes in robbing and shooting they are not going to fire you from your job at Wherever You Work USA if you get your family in a room and hide and take no action to save others when you clearly could have and should have.  \nFor officers they FIRE you for hiding and surviving.  We are held to a different standard and with that comes responsibility.  If you have a job I hope you’d understand that where you work also holds you to a higher standard. \n\nAs for retirees that’s the law.  You voted for people that passed it.  Blame yourself. If you want LEOSA to repeal the retiree part and they don’t then also blame yourself cause you still voted for them.  Called a Representative Republic.  \n\nIf you want, as the public, a different LEOSA then vote for others to federal office.  That’s your power. ",
  "Don’t forget federal.   A Forest Service Officer in New Mexico can still carry in New York.  Bottom line is for officers it doesn’t always follow your beat or patrol duty station.  There’s more to it.  \n\nAs for retirees it’s there for what they used to do \nSame reason the US President and family still get Secret Service protections.  ",
  "Nice to hear.  ",
  "As someone who carries under LEOSA let me tell you there is a WHOLE LOT more to it than this report states.  ",
  "Take an armorer’s course.  They teach them all over the place.  ",
  "There is no military commander in the entire US military in any branch that is going to let their troop take a personally owned NFA item on a deployment.  Not ever.  ",
  "Cool ",
  "Absolutely!!  ",
  "Yeah. With $20.00 shipping.  ",
  "Can you tell everyone how the process went when you did it please??",
  "Good deal!!!!!!",
  "Is your boss in Afghanistan??",
  "Called “veterans preference” and usually five to ten points added to scores.  ",
  "Yes!   You need to send your orders and requested expedited processing. ",
  "Well since I used it personally TWICE i guess I can say it’s true. ",
  "Nice!!!!!   How did they take using those?  Hopefully a lot shorter ",
  "It is because of preference points.   ",
  "Just dumb ",
  "Agreed!",
  "How in the world did you read that into the comment?",
  "And almost ZERO of this is computer automated.  We have passed so many firearms laws that other than the NFRTR almost nothing can be done by computer.  This means the BATFE and FBI must do look everything by hand.  \n\nWhen you multiply that times 2,000,000 transactions in a year now you get a SLOW process.   It is basically now the large number of people applying with the least number of BATFE assisting.  ",
  "Will ask!!  Good question.  ",
  "Nice!!!!!",
  "First of all thanks for your service and yes they would.  ",
  "And before some of you ask because I know you’re going to.  It is NOT for PCS orders.  It is for deployment orders under title 10 federal troops or title 32 state troops activated under the President.  ",
  "And thanks for your service!",
  "Congrats!",
  "Hybrid is the way to go.  Griffin Optimus also good idea. ",
  "Exactly.  They insure my machines guns.  ",
  "Call USAA. Ask for VPP. stands for Valuable Personal Property insurance.  They covet expensive items like this for dirt cheap per month.  ",
  "Get the dealer to transfer it to a range that has an SOT.  that way you can go shoot it while you wait. ",
  "There are no firearms in California.  You’re SOL.  ",
  "I’d take prison.  No question. ",
  "There.  I upvoted you. Lol. ",
  "Yes do you EVERYTHING an individual one does.  No difference now really other than you can have other people on your trust.  If you’re single with no kids maybe get individual \n\nIf you’re anything other than the above get a trust.  ",
  "Shattered femur. Yeah. That’s BAD!!!!   Ouch brother.  ",
  "Was a tiny hospital in NOWHERE Texas.  I am surprised daily they have electricity.  ",
  "If you as a citizen ACT IN GOOD FAITH you are also covered under the same law.  Have you read up on this?  If t ours going to carry a weapon you should.  ",
  "An honest mistake of fact.  Let me explain. If you as an officer receive a warrant and you go to serve the warrant at 100 Oak Street but the clerk of court fat fingered the wrk g address when it should have been 200 Oak Street you cannot blame the officer any more than you could blame the person defending said home.  ",
  "So about five years ago I was working a plainclothes night shift and my stomach started hurting. Decided to lower through it.  Got to about 2300 hours and wanted to FUCKING DIE!!!!   The stomach cramps on a 1-10 scale were a SOLID 10.  omg awful.  \n\nWent to precinct and took one step out of my car in the back parking lot where the officers park unmarked and passed smooth out.  Woke up a few minutes later and pulled myself to hit the 10-33 button and things got hazy from there.   Ambulances and supervisors came from everywhere.   They rushed me to the ER and found out I have Clostridium D infection in my blood.  \n\nMy primary weapon was given to supervisor.   My backup weapon they discovered while taking my clothes off in X-ray.   I remember none of this.  They said pulled off my pants and my BU weapon hit the floor and nurses ran from everywhere.  Lol. \n\nThey keep my weapon at the nurses station in the cash box cause only place they had to secure it until my wife got there.   They gave it to her after that.  \n\nSpent four days in hospital and there is NOTHING worse for pain wise for a man than  Clostridium D infection.  It was BAD.  ",
  "Ratta tat tat.   Picked the wrong victim today boys. ",
  "You’re going to prison buddy!!!!!!!    \nOkay not really. ",
  "Yeah. That certainly qualifies as worst call of the day.  Easily.  ",
  "That was a very well written article.  ",
  "That’s cool.   \nI have a three ring binder with each front and back color photo laminated.   I keep in my patrol car and in my personal vehicle.  ",
  "Do what most of us do. Take a really good photo of the front and email it to yourself.  The. You have a copy in your phone and a copy in your email you can always get access anywhere!!!  Works great.  ",
  "Core t. Same way in military ops and maneuver.  Pistols are for officers and medical rear troops.  Rifles and machine guns for front line stack troops.  \n\nSame for officers.  When on the offensive best to ha e an SBR and or a shotgun.  Pistols are for mostly defensive nature. ",
  "You could work out a very long term $1 maintenance contract with a gunsmith.   ",
  "Not a requirement. Only a wise suggestion just in case.  Never know what can happen at a range.  \n\nI had a buddy of mine go change his target.  While doing so someone stole a Suppressor out of his range bag.  \nVideo from range caught the guy.  Having his Form 4 on him made it super easy when filling out the police report on whom owned it truly.  ",
  "And there are no long periods.  Most incidents are over in less than 2-3 minutes.  Overwhelming majority never last more than 5 minutes.   Shootings are over quite quickly.  Vary rare that a shooting isn’t over by the time officers arrive.  ",
  "Only for pathetic little 22 year olds.  As you et older in your law enforcement career you want quiet shifts and warm coffee.  People that look for starting stuff you want to stay away from.  And it they find you then so be it.  But those that look for it are of feeble minds.  ",
  "We will leave up to the guy with the CZ.  Thanks, sir. ",
  "An HONEST mistake of fact where the officer was “acting in good faith” you will lose 100%’of the time. \n\nIn a situation where the officer himself is committing a crime then the situation changes significantly.   \n\n",
  "As a police officer I will give a good answer.  Find cover.  Not concealment. COVER!   Your weapon is there to protect you and your family. Not to take OFFENSIVE actions.  Handguns are not meant for offensive actions.   That’s why tactical squads in military and police use SBR rifles and shotguns.  \nGet to hard cover and stay down use your handgun as protection and only remove yourself from cover when ABSOLUTELY necessary. \n\nAs far as identify yourself.  Once all the bullets stop flying do exactly what I would do as an off duty officer should I ever find myself in that situation.  Obey all commands!!!!!  Be low to the ground.  Have your weapon either holstered or lying on the ground NOT IN YOUR WINGSPAN when they begin to search each person.   Do not stand up.  Be quiet and obey commands. \n\nAnd for the love of God make sure every officer can see your hands in a calm non threatening manner.  \n\nDo all this once your SURE the entire threat and situation has ended.  ",
  "Exactly.  It is a guarantee to show up in court ",
  "That’s a fair statement.  ",
  "That sounds about right. ",
  "And i file a Form 20 every time.  Required or not!",
  "And MGs. ",
  "Omega Man with Heston holding my MK760.  Hell yeah. ",
  "Depends.  Misdemeanors are a broad category.  Some ehhhhhhhhh, others very bad.  \nSafety first. ",
  "Yep yep!!",
  "As an officer I’ll gladly answer this situation for you:   FUCK NO!!!!!!!!!\nMy opinion you can have all the damned guns you want. Just don’t use them for a FELONY and we’re good.  ",
  "And people wonder why I would NEVER take my family to even visit New York.  Disgusting place.   Had to go there once while in the military for a conference.  Place was dirty.  And it smelled.   \n\nBeing honest here.  I’d rather go spend time in downtown Bagdad again than go back to New York.  ",
  "Work Security night jobs and also work OT. \nAnother popular thing is to go hunt or fish at night.  Usually go hog hunt or go to the spillway and try to get catfish at night.  Good stuff!!!",
  "Yes!  It’s called “vicarious liability”. As a supervisor and as a corporation you are responsible for the employees under you.  Even the ignorant ones.  ",
  "Simple.  They are of the belief that they should never have to have their stamps on them.  So when someone, even jokingly, comments about it they get their little pink panties in a bunch.  ",
  "Make sure you take your stamps and your form 20. Lol. ",
  "Love the Super Shorty ",
  "I have that exact print for an iPhone case ",
  "Good job!",
  "That’s a Texas flag with what looks like US police officers.   They CANNOT be French cause they have guns and Europe doesn’t allow anybody to have guns. ",
  "Yep, looks like an easy assault charge.  ",
  "You did well.  And absolutely sounds like an undercover agent.  Best hung to do is exactly all you did.  Every single time. ",
  "You should have laughed at her.   Openly!",
  "As an officer I can tell you how these situations can be handled EVEN BETTER.   don’t speed!!!!  Lol. \n\nGlad went well for you ",
  "Very cool.  I want to visit all of the different Disney parks around the world. ",
  "Sure they can refuse, but then they get to win the price waiting behind Door Number 2",
  "I keep buying lottery tickets for my Disney blues.  The reason is simple.  GOLDEN OAKS!!!  I want to move to the Disney World and the only way I can do that is to win the lottery!!\nAs far as  he blues, they stop the moment I step foot on Disney World property and then begin again the very moment I leave on the Magical Express.  I love it that much!!!!",
  "Do you take medication for it?  Have you had a prior suicidé attempt?  If so; means you’re statistically at greater chance of hurting yourself than others.  No arguing that.  Simply true.  And since more than DOUBLE amounts of suicides in the US than homicides every year once might argue you should not have access to guns.  \n\nSee my\nExample above?  That’s how they play the game.  They take ONE LITTLE BITTY factoid of someone’s life and apply a large swath of it to anyone.  Even those with simple depression.  That’s why the anti gun nutso people need to stay out of power.  They are eventually going to use the power of the government to strip away rights based on one small tiny thing like battling depression.  \n\nBy the way, praying for you.  Never battle alone!!",
  "It is actually very rare.  Statistically there are thousands of small accidents in any major metropolis city in any given week.  Tens of thousands in a month or year.  We all know  this to be true.  There are just lots of wrecks. \n\nBut honestly, how many acts of felony assault stem from a car wreck or an “almost wreck”?  Far, far less than 1%.  Yes, we all see on tv and have gotten road rage calls, but they are very few comparisons between that and normal daily driving activities.  \n\nAnd road rage that leads to a homicide, is one in millions.  Exceedingly rare...but does happen.  ",
  "Yes, I am just that awesome by the way.  ",
  "100% exactly. ",
  "What a wonderful phrase!",
  "Agreed.  ",
  "The J turn. Very nice.  Lol. ",
  "Clearly not a survey question answer. ",
  "Just saw your his on the news.   Stupid!",
  "Same here.  42 USC 1983. ",
  "I would make a call to your background investigator.  Maybe they will tell you.  ",
  "I will answer first.  NO!   \nHere’s why.  Because it is morally reprehensible to knowingly participate in an action the Constitution clearly abhors.  Gun possession, at least in my mind, is considered inviolate.   ",
  "I’m with you on that one.  Man up and\nCome get em.  Don’t be bashful. Come to my yard and try.  ",
  "Are saying they did not tell you what it was?  Not at all?  Nothing?   ",
  "They should have added “and this right cannot be taken away or diminished by any court or legal act if the US or any state, no matter what the circumstances”.  ",
  "High end rechargeable flashlight.  ",
  "Wished they’d see that the vast majority of the time we see EVERYONE st their worst day.  If it wasn’t their worst day they wouldn’t be dealing with us in the first place.  And that’s the reason we are so jaded overall.  ",
  "Ouch!!!!!!!!!!!!   Yuck. ",
  "Here in Texas you’re guaranteed to lose your state peace officer license for doing that. ",
  "I ran your mother too.  She also had a warrant ",
  "Burn said clothing.  Lol.  ",
  "Here’s some good advice.   SHOWER HORIZONTALLY \n\nlet me explain.  If you get I the shower all the residual is going to run DOWN your body from what’s left over under your clothing.  You do NOT want that shit. \n\nLie you head and Upper body horizontally in the run and wash.   That way left over residual spray won’t run to your nuts and your ass.   Believe me it’ll hurt!!!!!!",
  "Twice!!!",
  "I also took some iron and blood and pulled his credit report.  ",
  "No ",
  "And all of your above examples there are about ten states that totally ignore them.   And sooner or later ALL THE STATES will ignore them.  And then we end up with nothing.  Just watch. ",
  "One federal (retired) and two state.  First state got recalled after 9\/11 to active duty as a Captain and then moved Texas so much transférés my license hère and stated!!!   Great place.   \n\nWhy??",
  "Literally the ONLY people who OC I have ever felt with were like those people.  Every.  Single.   One.  ",
  "They are literally the ONLY open carriers I ever see. Soooooooo",
  "I just consider it a personal choice.   Whatever someone wants to carry let them. At least they ARE carrying.  Most don’t even do that.  ",
  "Yawn........",
  "Those guys making OC videos accosting people and then INTENTIONALLY telling others to call law enforcement are doing it for attention. And they represent OC as a whole.  Literally thousands of videos of those freaks.  My thought is that if one craves and needs attention that bad that maybe they should seek counseling and get help.  ",
  "The average OIS in the United States involves only a few rounds.  Usually only two or three.  So 1911 perfectly fine if you go by the actual number. ",
  "Two words.  HUGHES AMENDMENT!   He signed it and knowingly screwed us NFA guys.  \n\nGee thanks President Reagan. ",
  "Fake news.  Everyone knows there are no guns and\/or gun crimes in Australia.  Fake news!!!",
  "Reagan the AZZHAT outlawed the “Reagan Rifles” in 1986.  Still can’t believe that asshole signed it.  Piece of garbage. ",
  "Nice weapon ",
  "Fairly accurate depiction ",
  "Ahhhhhhh",
  "Yeah not the same.  But I see your point. ",
  "What does the Sheriff Office have to do with buying a gun??   I am lost on your comment. ",
  "It is hard to describe simunitions on a talk chat without having an example in front of the reader.   ",
  "Most stressful shooting drill in the academy is where they have you writing an accident report with two separate driver parties and your in between them writing the report and then with no warning at three feet away one pulls out a weapon and starts firing.  \n\nOfficer had to has to respond by pushing back and firing st same time to target using something called “simunitions”.  Basically your Glock 17 or 19 with the barrel replaced by a VERY fast shooting ball round that is made of plastic.   They hurt when they hit open skin.  It is eye opening for the officers in training and cadets. ",
  "As long as Tupac cares I am good to go!  ",
  "Do not care if no one cares.   Not even slightly.  ",
  "Hotty Toddy!!!!",
  "Yes, sir; he did assume your sex. ",
  "Take the adult approach.  Pull him to the side and talk to him and let him know what’s what. ",
  "My MG stamp is in the mail!",
  "Yep.  Remember that disabled child in Chicago where they kidnappéd and forced him to eat garbage and drive him around.  Took his phone.  Made disgusting photos and videos of him. Happened last year in Chicago. That’s the very essence and reason for hate crime laws.  They deserve life with no parole. ",
  "Don’t leave us in suspense!!!",
  "Have faith brother!",
  "That definitely looks like a stamp envelope to me. Lol. ",
  "Hate crimes can be more than just race.  Can be sexual or age or disability based too. ",
  "As a long time police officer I think the words “hate crime” are not the most correct way to view it.  \n\nEnhanced punishment is an obvious yes.  But hate crime no.  ",
  "Agree completely.  The Colt is in another league.   The action and everything else is just better.  Nice gift from your grandfather.  Great man!",
  "Yep!  Exactly.   I love mine in .357.  Shoots fantastic.  Able to easily conceal carry with mine and also able to hit steel consistently at 25 meter distances on our plates.  They are very good handguns. ",
  "And there’s the dumbest person I have heard from all day.  Congratulations. ",
  "Wait?  What’s that?   Sorry can’t see your comment.  Lol. ",
  "Uberti Cimmaron can be found in that price range sometimes. Good luck.   ",
  "Had zero effect on me and I fired four rounds at the mutt at EXTREMELY close range with 12 gauge pump number 1 buckshot.  \nSame as when deer hunting.  You’re so focused on the game you don’t even hardly notice. ",
  "ATF headquarters.  Lol. ",
  "Best comment....ever. ",
  "Per state law active officers must also qualify at least once a year (Texas statutes). ",
  "Appreciate that!",
  "Sir.  Thanks you for both you and your fathers service.  Very proud of you. ",
  "Or off duty doesn’t matter in another state without LEOSA ",
  "Who told you that HB218 has to have a chiefs signature?   That’s utterly incorrect ",
  "We already have a federal called LEOSA where we can carry anywhere. Mostly. \n\nSo why not patten national civilian reciprocity after LEOSA?  Works for us.  Why can’t it work for CCW??",
  "Nope.  It ain’t ",
  "Fair comment.  They aren’t for all people.  ",
  "Three.   And the scene was GRUESOME with all under 1 year old.  Very ugly. ",
  "Also true.  Will have to see what plays out. ",
  "Oh okay. Makes sense.  Love the .40S&W.  Crazy as this sounds have actually used my .40 to deer hunt and pig hunt.  Kept distancing within 20 years or so.   Never had one run off.  All dropped soon as I pulled the trigger.  ",
  "Glock.  All else falls short. ",
  "It used to be something cool 15 years ago during the assault weapons ban but now just a neat piece of history. \n\nNote:  I still use the LE\/govt magazines in my Glock 18 off duty carry pistol.  Use them cause we first issued to me and for\nNostalgia ",
  "Hahahahaha.  Only shot one dog twenty something years ago.  ",
  "True ",
  "Haha.  ",
  "You’ll need to take the AFOQT.  go to an officer recruiter.   ",
  "Anderson Manufacturing makes good AR products in low price ranges. ",
  "Hope she files that complaint UNDER OATH.   ",
  "Have only shot one dog.  Was a rott.  Shot it with buckshot from VERY close range.  And fuck your dog. It’ll probably end of killing one of your children ",
  "I am a captain on the Air Force Reserve.   Have you considered AFIT since you’re thinking about PhD programs?",
  "Hahaha.  True!",
  "Nice!   Wish it were that way here in a Texas.  ",
  "A BILLION percent worth it.  No question.  ",
  "If I am attacked by a persons dog I am shooting the dog and them.  ",
  "Here’s your upvote!  I DESPISE PIT BULLS!  As a police officer literally WITHOUT EXCEPTION every single fatality I have responded to where a dog killed a child was done by a pit bull\nAnd don’t give me that crap about “it’s the owners”\n Next time I have someone tell me that lame as shit in person i am going to force that person to go with me to see the next children’s grieving parents and see them explain that away.  Then we shall see what it is really like to be a police officer that has a face a parent that just lost their child to a worthless four legged piece of\nShit.  \nEradicate ALL pit bulls from the Earth.  Fuck them.  ",
  "Come to Texas!!!!",
  "I would intentionally take two weeks of PTO from work and the only thing I’d do for that time period for 20\nHours a Day is to build cheap ass AR15’s at a price point of around $300 or so and sell them for $1000.  Is easily make enough money to pay off my house via the government. ",
  "If any officer I know write a idling law ticket the rest of us would laugh our asses off at that officer.   Just stupid. ",
  "Wish i was a Club 33 member.  ",
  "And if any of us NFA guys are wondering why the FBI check takes so long, look no further.  Here’s your reason.  ",
  "On a serious note:  if you have internet access get our your debit card and buy a CE class.  Here in Texas have to have 40 hours every two years.  Just use card and buy a class or two and take online. Way to kill time and get CE credits done. ",
  "Watch porn, that’ll keep anyone up!   Lol.  ",
  "I am NOT defending the mayor in any way.  But if it’s an “at will”’state then why doesn’t the mayor just fire everyone himself??",
  "Here’s the reality of it all.  People understand is that the HUSH act or the free suppressor from tyranny act or whatever else you want to call it is not EVER going to happen.  For that reason people are now back in the market for silencers.   This the times are now going to go right back up to a year again.  Just watch.  \n\nHere’s a bet:  if I am wrong I will buy a silencer from your company. If you’re wrong you give me one for free and pay my $200 stamp.   You can afford it!!!",
  "See the Law\/Gov’t restricted\nMagazines.  Pretty cool.  Don’t see those very often for a 21. ",
  "I would have drawn on that guy and then arrested. On the spot.  ",
  "All about the Evil Queen!  Omg yes.  ",
  "Agreed!!   and thanks ",
  "Ahhhhhh thanks for keep my straight.  Appreciate the info ",
  "Hahaha. Yep!  Likely ",
  "Hopefully I will be there in a few days to get my silencer on a Form 4 where y’all have my Huntertown Arms Kestrel 9 in prison since October.  Lol.  Ready to see y’all Austin store.  ",
  "Not really.   Don’t we all make the argument that the 2A isn’t about hunting?  Don’t we all argue that that Founding Fathers made the 2A with the intent of having able bodied men to protect the Republic if the need should ever arise?   To even overthrow.  That means we ARE comparable to the standing armies.  ",
  "He should get a Serbu Super Shorty and pay the $5 tax for AOW ",
  "Maybe he should get a Serbu Super Shorty.  ",
  "They are fantastic. I see them at the gun show off Marbach every month. Classy Raptor Tactical does a great job.  They made my Gen5 backplate I picked up a few weeks ago.   No complaints.  ",
  "The first part deals with the example that even people who are MANDATED to carry guns for a living for the government must do so openly. \nThe second part is that yes I am saying that open carry is supported by the 2A.  Clearly some states disagree with this notion.  ",
  "Ehhhhhhhh, you get over it in three or four hours.  Then when you finally get enough water to flush out your eyes and just when you think you’re over it, then you go to take a bath and some of it gets in every body crack.  It then hurts all over again. ",
  "Just wow ",
  "Sir, even the standing armies are required to “bear” their arms openly.  ",
  "You know that one day, eventually, a well trained dude is going to freak out.  Be it a highly trained police officer or a military guy.  But one day a dude is going to freak out and be a spree killer and it’s going to get ugly.  \n\nAnd I mean an “operator”.  Not a regular officer or military.  Sooner or later.  ",
  "Ahhhhhh didn’t know that. ",
  "The “assault” bow and arrow will be the only things left when they’re done.  And  then they’ll take those.  Just wanted. ",
  "Sad but true.  ",
  "Exact.  That exactly.  ",
  "Dayum!!!!",
  "There is a 50 BMG upper by Serbu I believe.  ",
  "Okay. I’ll admit it.  When we get sprayed I almost cry like a little bitch.  I freaking hate getting sprayed.  ",
  "Use bear 10%.  Much more effective.  Lol. ",
  "They’re over 0.500 so clearly NFA items.  Hope they got their tax stamps!!!!   Lol. ",
  "Blame Canada, Blame Canadaaaaaaaaaaaaaa",
  "That’s the point though.  Concealed carry, per Heller, is not a Civil right.   We WANT it to be. But it isn’t.  No court has ever ruled CCW a civil right. ",
  "It is just shorthand speak.   ",
  "They’re likely lying to you in order to infiltrate and get intel.  Lol. ",
  "Congrats!!",
  "My Glock 19 carry gun just field strip and oil up.   Wipe down and good to go \nMy full auto MUST be a full cleaning after each range session to include sonic cleaner.  Since it is an open bolt subgun it gets super dirty after only a few mags.  ",
  "I am going to try this test with high performance 5.56 and high performance 9mm.  We shall see which fairs better.  \nI have hear this myth for years about 9mm penetrating better.   I am going to post my findings once done.  We shall see....",
  "“shall not be infringed” = felons and crazy people, drug users, wife beaters and anyone else can have guns!   That my view.  ",
  "Bro, you did the ABSOLUTE best thing in that situation which is nothing.   When you are armed and when your wife is armed you simply cannot afford to deal with idiots like them.  \nHowever you could have made a “concerned citizen” call about how they drove away erratically and you smiled alcohol and there was beer cans coming out of the back of their vehicle and they nearly hit a pole driving away!!!   Lol.  ",
  "Thanks ",
  "The people in California elected the people that made it “may Issue”.   If they don’t vote them out their own fault.  Our CONSTITUTION prescribes how states under the 10 Amendment make their own laws.  The 2A under Heller doesn’t speak about concealed carry st all.  \n\nBlame the people that elected them.  ",
  "This exactly.  ",
  "Realist.  ",
  "No holster stuck in back of pants.  Like Axel Foley.  Been doing for 25 years.  No worries.  ",
  "Zero percent chance to ever change a Dems mind.  Quit trying.  They are EMOTIONAL thinkers and thus there is no chance of rebuttal. Give up. ",
  "Depends on the jurisdiction and if you’re in your patrol car going somewhere.  Lots of variables at play in that question. ",
  "Glock 19.  Mexican style ",
  "Wow.  Lots more than my five.  ",
  "You are the most uneducated and most UNABLE TO DECIPHER MEANING person I’ve ever seen.  There should be an IQ test.  Omg ",
  "Omg.   I NEVER Said hunt elk with a .223.  You’re an idiot.  Fuck off.  I was talking about WHEN elk hunting would shoot behind the shoulder.   \n\nYou’re a total idiot.  ",
  "The FIRST rung on the Use of Force Continuum is “Officer Presence”.    Didn’t they teach you that in the academy?",
  "Where is “all the time”?  Show me where I claimed that. Now. ",
  "They are ",
  "OMG. not ALL THE TIME.  Good grief.  Big deer.  Elk.  BIG HOGS. all behind the shoulder.  Where in your mind did ALL THE TIME come into it.  ",
  "Absolutely!!!!",
  "PM me.  I’ll mail you one out.  Need full address   I’ll send you a black one.  ",
  "With a check cash date of 2.5 months ago you’re likely looking at September 2018 to get your stamp.  ",
  "Ruger 22\/45 Lite.  Best .22LR out there!",
  "Exactly!!!!",
  "F350 Dually 4x4 2018 with lights.   ",
  "Agreed completely.  They can nice very quickly.  ",
  "Don’t have to be a crack shot.  Sitting in a box blind in South Texas over a corn feeder when piggies come out not hard at less than 20 yards to drill between the eyes or the ear hole.  And because I use a suppressor they don’t even run of most of the time.  Pigs are DUMB.  ",
  "Bought from a dealer in Virginia that did an EFORM 3 to Texas to my dealer in San Antonio \nMK760.  Built in 1984",
  "I have killed DOZENS of animals in my youth with a single shot .22mag.   Quite effective.   ",
  "My 5.56 is FANTASTIC for hunting.   Drill hog or does right in the ear hole.  Works great!   Has very good hunting value.   ",
  "Report stolen. Tell police to put into NCIC as stolen that way nobody can ever transfer and dealer will be motivated to get in touch with you to work it out.  Lol\n\nObviously kidding. ",
  "How to tame your Mandrake!! 101\n",
  "Witch Craft 101",
  "Remember, the French are the ONLY people that cane to help us during the Revolutionary War.  ",
  "Federal 45 grain Suppressor Ammo.   Love that stuff.  Sounds great and actually has really good penetration\/power in my Ruger 22\/45 Lite with Huntertown Guardian SS.  ",
  "Not that way here in Texas.   Here we use the LTC for purchases so we don’t have to do the NICS check ",
  "All that makes sense.  My Hornady hunting Ammo penetrates pretty darn well.  ",
  "Exactly why I ALWAYS use my LTC when i purchase a weapon.  None of the NICS crap.  ",
  "Did he write you?  Lol ",
  "Thanks.   Some officers are gun fanatics too ",
  "Thanks!!",
  "Did they arrest the turtle for any weapons or. having more than a ten round magazine???   Lol.  Kidding. ",
  "Aaaaaaaaaannnnnnndddddddddd they’re off!  It’s “Starch Hat” out of the gate dead last cause his rider had to straighten his vest but he is catching up at turn 1.  Now into turn 2 it’s a dead heat with Starch Hat even with the leaders.  Now into turn 3 Starch Hat has the lead by two lengths.  Ladies and gentlemen we are now passed turn 4 and Starch Hat has five lengths lead at the home stretch.   Just before the finish line Starch Hat comes to a screeching halt in the middle of the track.  \nAnd Starch Hat comes in dead last because he stopped to write the other horses speeding tickets cause he only works traffic and never answers calls like the rest of us!!!!!!  Lol. ",
  "Next time I am out at my hunting land I am going to test this theory by putting several pieces of drywall in line with each other and shoot with my 5.56 and then my 9mm.  I want to see this fir myself in person.  Going to use ball rounds for each and then defensive rounds.  Because I have personally used 5.56 in Iraq and the penetration was significantly more than any 9mm i have seen.  \nI do no discredit your statement.   Only want to test this for myself.  ",
  "Remember.  If the robber claiming he or she has a weapon and is within 21 feet of you your chances a significantly diminished on getting yours out and in play before he or she is on you.  At the academy the first thing you’re taught about reactionary gap distances is that the closer you are the most likely you’re going to be cut and or stabbed and or shot.  The whole idea is trying to survive it using training and reactions and a whole lot of adrenaline.  \n\nI would definitely draw in this circumstance. No question.   If upon drawing the attack doesn’t cease in ANY WAY I am firing.  \n\nA drill they pound into you at the academy is where you are at the back of a patrol car and holding your metal folding notebook taking down an accident report with two drivers.   This is not a traffic violation stop. Only a traffic accident to be worked.  One of the drivers all of a sudden out of nowhere pulls out a gun and starts yelling about how this was his favorite car the other guy just totaled.  \n\nThe scenario is played out on the 3 FOOT line at the pistol range.  The cadet has to use his or her metal folding pad to write out the accident report while on the scene with two very upset individuals and then one draws a weapon.  The cadet has to react by pushing off and creating distance while firing from the hip as they are coming up on level target.  All of this is done at the less than three feet line and usually closely enough where when the cadet gets to finally full draw their Glock barrel is touching the target.  \n\nThe scenario is about how to react to close in contact.  In the robber case being discussed here the situation is basically the same distance wise.  That is to say you’ll need to work on expanding distance and drawing while screaming and fighting for your life st extremely close range.  If you watch lots of OIS videos you’ll notice the officer backing up as he or she is firing.  This is all part of training for gap distance.  ",
  "If they instituted a buyback the amount of burglaries would skyrocket because drug users would see this as a cash cow.   They would steal any and all ARs to see back for more drug money.  It’s a cycle.  ",
  "It is spelled “Glock 19”. ",
  "Good advice.  Contact the retailer.  Mistakes do happen. Very well might not have been intentional.  Call and ask them. If they refuse have an attorney send a letter about small claims court.  \n\n",
  "Silence ",
  "I can tell you this officer will not ever be part of any gun confiscation. Not ever.  Period. ",
  "Be quiet. ",
  "You can also wait until you’re 21 and buy an SBR outright without having to build it. Bunches of online dealers sell full build SBR’s just not cheaply.   That way do the Form 4 with the dealer in FL. ",
  "Babies are loud and they smell.   She can keep that.  Lol. ",
  "We go through WAYYYYYY more bullshit.  You take a two hour course online.  That’s a joke.  Most states a CCW\/LTC is shorter than taking the SAT test.  That’s laughable.   And then some of you STILL FAIL THAT!!!  Bwahahahaha.  Saw two failures the other day.  Should be ashamed.  ",
  "Oh and blame yourself as the public.  You as the public elected the people that made the law.  So under our CONSTITUTION you voted for it.  ",
  "Our tests are MUCH harder.  You only need to shoot at B27 target for minimal knowledge.  That a less than 1% of my training.  Your CCW\/LTC test is laughable at best. ",
  "I have an LTC also. Did the same bullshit. ",
  "You’re a moron. Goodbye ",
  "Being on duty or active duty means ZERO if you cross state lines without LEOSA.  On inform or out if uniform means zero without LEOSA.  That’s why the law was passed.  ",
  "You’re absolutely more than welcome sir!",
  "My point exactly (from the dick). Lol. ",
  "Bro it is awesome.  If you go there you’ll not be disappointed.  They do 3D targets and range is immaculate.  The gun range is fantastic ",
  "Bro it is awesome.  If you go there you’ll not be disappointed.  They do 3D targets and range is immaculate.  The gun range is fantastic ",
  "Thanks bro!!!",
  "Shhhhhhhhh be quiet ",
  "When officers got on airplanes as escorts we always wear regular clothing.   We escort the prisoner with hands bound in front with a jacket over the cuffs.  Honestly try to board first and get off last.  Sit in the very back and do not ever get up.  Something about not being in uniform with a gun screaming « HERE IS MY PRISONER AND I AM ARMED SO IF TOU WANT A GUN ON THE PLANE COME TEY TO TAKE MINE!!! ». \n\nSuggest you go back to school for critical thinking skills. ",
  "Police officers are not on active duty.  That’s military.  ",
  "Yawn. ",
  "You should go!  Fantastic place.  ",
  "Yep.  Literally all parts interchange ",
  "DUI = loss of license forcer and confiscation of the vehicles and all valuables inside it.   Make it hurt.  ",
  "That’s gonna leave a mark.  ",
  "Do tell. How does one go about ordering this package?",
  "MK760.  ",
  "MK760.  ",
  "Fantasyland....yes, I also love Disney.  This next trip in July will be my 16th!!",
  "Blocked ",
  "Courts martial are also this way.  Can convict on less than unanimous vote.  ",
  "So when I was called to court AS AN OFFICER to take the suspect from Texas to Mississippi your thought is that I should simply take the suspect unarmed in my patrol car pursuant the WARRANT Issued by that court.   You’re a genius.  Yes you’re right.  Let’s go with your way.   That’s just dumb sir. ",
  "The turn in rate would be FAR LESS than 1% and the uproar would be cataclysmic.   You’re talking about civil disobedience at a nationwide level.  Would possible lead to a revolt by the citizenry.   Maybe even a Revolutionary War Part 2.   ",
  "You believe that LEOSA should be repealed?   Just wanted to make sure I am reading that correctly.  ",
  "Terry Stop in a vehicle!!!!    Lol. ",
  "Yep. Me too!  Higher prices but fantastic facilities. ",
  "MK760.  She runs great!!",
  "Likely true. ",
  "Might be.  Lol. ",
  "Bwahahahaha.  Had a rookie get me once. Wasn’t pretty.   P",
  "Awesome.   Dallas is just BIG.  ",
  "Very true.  On all that. ",
  "Yeah I’ve been gone for a while.  Ole Miss 1990.  ",
  "Oh holy crap. Yikes. ",
  "Born and raised in Jackson but live last 11 years in San Antonio!",
  "They’ll give you a 1099 I am sure!!!!",
  "Never once carried a taser.   Have used OC spray on dudes.  Quite effective.  ",
  "Forrestsrs?\nThe Gin?\n\nWorked there during my summers ",
  "I carry Hornady Critical Duty 9mm +P.   Love mine.  Great ammo.  ",
  "Taking things a little personal aren’t you.  Try Valium it helps.  Many some deep breathing.  ",
  "Translate s’il vous plaît ",
  "Last time I was in France was in Nice in 1991 during my weeks R&R leave from when we ousted Saddam Hussein from Kuwait.   \n\nHas it changed a lot since then?  I remember having a great time.  Lots of fun and pretty good beer.  \n\nJust hoping they have Shiner Boch.  Lol.  ",
  "Exactly that!",
  "Haha.  Now that’s funny!",
  "I wasn’t trolling.  Be nice.  Just wanted to know while there about a few steaks.  Chill out man. ",
  "Mdr!!!",
  "Holy shit. ",
  "From what I’ve heard they need to rename it « may not issue ».  Lol. ",
  "Haha. Yeah decently cool. Wish I was in Australia right now.  ",
  "Ehhhhh likely true. ",
  "Haha ",
  "We have 50 units in Kandahar.   That a lowball amount.  Usually ten times that. ",
  "Very very good suggestion.  ",
  "8 out of 10\nBonus:  you get 9 out if 10 if you Mexican carry that ",
  "Mine bring me coffee.  Just saying.  ",
  "Agreed.  If you use you of force and that force causes injury of any kind then you’re expected to render aid to that individual.   Every department in the country likely has that policy. ",
  "Both!   A US passport that is active without restrictions is worth its weight in gold on the black market.  Keep close hold to it. ",
  "Good looking weapon ",
  "Keep your passports SUPER safe and don’t get it out unless you have to.  If carrying cash put in sock or in your shoe.  Keep your phone in pocket preferably zippered.  \n\nDrink bottled water!!!!!!!!   You’ll understand this later.  ",
  "Hahaha. Yeah very nice.  ",
  "Oh I completely agree.  However apparently the citizens the state the judges and everyone else on those ridiculous places don’t care. ",
  "I am most impressed with your theory.  Excellent. ",
  "Zactly!!!!",
  "Thanks!",
  "100% truth. Oddly.  But still true. ",
  "Basically.....",
  "It is the will of the population contained therein that makes it easier for them.  They have almost no gun culture and the people WANT strong laws as a whole.  \n\nThis is truly democracy at its’ greatest because really and truly the anti gun states and cities are representing their widest population.   NYC, LA, CHI,  all of these places WANT anti-gun laws for the most part.  And for that reason the elected officials are mostly following the will of their population.  Don’t blame the city or state...blame the population there contained.  They voted them in. If they wanted the laws truly changed they’d vote them out.  And if people that are pro-gun and live there in those anti-gun cities and states they need to fully understand they are the SIGNIFICANT minority and have almost zero chance to change things.  They need to vote with their feet.  ",
  "That’s the most accurate description I’ve ever heard of our toys.  100%.  ",
  "Ex post facto deals with PREVIOUS possession, not current.   And it also involves criminal law.  In other words, the government (state or federal) cannot go BACK in time and retroactively charge you for something you did that was legal before the new law went into effect. They can however can new possession or future possession.  Generally they will not do so on current owners of whatever item they are make illegal unrolls significant period of time has passed.  Usually several months or even up to a year.  \n\n",
  "Hahahaha.  Savage.  ",
  "Or a tiger.   ",
  "Yes, we learned on day three of Range week.  Lol.   However in our scenario he was buckled in with seatbelt so upped the degree of difficulty.  ",
  "VERY NICE!!!  A lot of the Texas officers here wear cowboy hats.  Kind of a throw back to the old days.",
  "In my MK760 I use simple Winchester white box 115 grains.   They work for me.  Obviously louder but good feeding ",
  "Congrats!   ",
  "Haha.  Great movie!  ",
  "Our Texas troopers wear cowboy hats.  Lol. ",
  "Haha. No worries ",
  "Pretty good job!",
  "Listen, if the entire machine gun loving population wants to start making machine guns the feds are basically powerless to do anything about it.  They only have control through unrealized fear \n\nIf we all wanted machine guns and began doing so the government cannot do much about it.  \n\nRemember, the ants are in charge.  The ant eater THINKS he is.  Right up and until the ants decide to band together and then the anteater is truly doomed.  \nNote: this exact same thing applies to North Korea and all other dictatorships. Soon as the “ants” decide they’ve had enough the government is doomed.   And they know it.  ",
  "Consider this.  There are more than like 500,000 of them sold.  People could just DO NOTHING.  The reality is that the federal government doesn’t have the manpower or the financial resources or the prison room to make that many people do anything.  \nSo just do nothing.  Remember:  if the population REALLY WANTS to keep them there is little the feds can do.  \n\nNot saying I agree or disagree with the ruling or the BATFE on the issue.  Just sAying the time of large numbers is in play here.  Just ignore it.  \n\n",
  "Make people REALLY not want to go there.   \nNo more indeterminate sentences.  10 years means 10 years. \nNo phones \nAny medical expenses must be paid by the inmates private insurance or by the family.  If neither then place a lien on family’s home for expenses. \nEducational activities mandatory.  \nAny fights or riots auto add 2 years to sentence.  No exceptions. \nGood behavior should be more rewarded.   Make larger incentives for good time. \nNo mail\nNo tv\nOnly can be visited by their attorney.  End family visits \nAnyone caught with cell phone auto FIVE YEAR felony charge ",
  "Yep.  Blows. ",
  "Thanks for the info bro!  Will certainly take that into consideration on mine. ",
  "Hahahaha ",
  "Haha. ",
  "All of the above.  \nOkay wait, what are we talking about again?",
  "Not a clue. Lol. ",
  "Thank you for keeping me in grammatical line",
  "And another thing Fuck LSU!!!  Hotty Toddy!!!!",
  "Hahahaha ",
  "Fair enough.  Was only putting it out there honestly.  ",
  "Fascist!!",
  "Bro. Are you really denying there are MANY in our field that do this??",
  "Wow.  That’s new.  Did it help??",
  "Fuck no.  Don’t let them move here.  Please we have enough!!!",
  "It is a tower of onion rings or Pringles??",
  "Just trust me on this.  About six months from now come back and read that again.  You’ll understand. :-)",
  "25 year Officer married with four kids.   In other words.  NONE.  ",
  "Here’s the deal.  And I don’t mean this mean but it’s reality.   The public is us and we are the public.   What that means is that we also are representative of the public.  As officers we have the exact same problems the general public has on a daily basis.  Some of us beat our wives, are rapists, drug dealers and yes even murderers.   But the reality is that when c fronted we hold each individual to a higher standard on those action FOR THE MOST PART.  \n\nVery sad situation but we are no different than the public we serve.  Hopefully there are just mess proportions of the bad stuff.  ",
  "In all years as an officer not once had someone comprehend what you just said.  Even though to the rest of us it makes complete sense.  Criminals and thugs and hood rats will not ever abide.   Ever.  ",
  "Good luck!  Remember this during the academy.  Take nothing personal.   Take EVERYTHING personal.  \n\nYou have two eyes, two nostrils, and two ears but only one mouth!    Make sure you keep that ratio clear.   You’ll understand later.  ",
  "Oh hell yeah!!!!  There’s Pizza Hut in France???   Now I am really excited for the trip.  ",
  "On n’y submachine gun (mines an open bolt) have not ever had a cook off.  Here’s to hoping never too.  ",
  "Shoots partner in leg.  Then shoots hostage taker center mass.   Learned from “SPEED”!!!!",
  "Sickening.   Guess that’s how the new world progressives feel there.  Just sad.  ",
  "WHY ARE YALL POSTING PHOTOS AND LAUGHING AT MY TRUCK?!?!?!!!!!!!  \n\nBwahahahaha.  Idiot. ",
  "Most Glocks IIRC come with a 17 or 18 pound guide rod spring.  Order a new spring that is 1 or max 2 pounds heavier after market.  That is SLIGHTLY slow down the unlock time allowing less gas and sound to escape.  ",
  "Sorry.  Want meant awful ",
  "Calvin Klein.  Like in “Back to the Future”?  Lol",
  "Happens. ",
  "Holy crap!!!!",
  "Ok I openly laughed at that one.  \nI want to ask though.  When is the time an actual license was issued to a person in New Jersey??",
  "Whenever you see him or her give my apologies. ",
  "I have not given up because I never started.  I never try to persuade anti-gun freaks.  \n\nIn the Bell Curve there are normal distributions called\nstandard deviations or SD.  If anyone is anti-gun their SD is completely on one end.  Moving them is a pointless effort.  I see them literally every day and their writings make it clear my position is accurate.   They are immovable on the Bell Curve.  ",
  "We are a republic, moron.  Not a democracy.    ",
  "People with attitudes should be declined from CCW.  they should not be denied the ability to own a gun. I completely believe in the 2A.  The 2A under Heller and many other laws clearly protects individual ownership however CCW is not a guaranteed natural right.  \nIn other words...if you’re an asshole then no CCW for you.  Your Home Depot example is the perfect scenario that fits this description.  ",
  "Here is your best advice.  DO NOT DO ANYTHING WHILE OPERATING YOUR VEHICLE TO GIVE AN OFFICER PROBABLE CAUSE TO PULL YOU OVER!!!!\n\nIf you’re law abiding they’ll have no reason to stop you.  Then you can carry however you want.  Officers don’t stop whom ever is just driving down the road.  You’ll have to commit come traffic violation to be stopped by an officer in the first place.   \n\n\nThis is not rocket science here.  ",
  "You likely didn’t hurt it.  ",
  "Nice weapon!",
  "Correct!   Prevention of crime equates to those who want to do good.  Criminals want to do bad so the laws are there to punish actions afterwards.  100% right. \n\nThe part the anti-gun people can not comprehend is how criminals will ONLY respond to punishment and not prevention.  They will use guns in whatever manner they see for the their particular circumstances and not conform to societal expectations of good behavior.  ",
  "Why would anybody even consider listening to a “religious” leader like the Pope?   This is the so called religion that espouses to keep middle aged men surrounded by Pre-pubescent males, and when the situation ends in child rape they always deny, deny, deny.  \n\nSo taking advice from this disgusting human being on guns is like taking dieting advice from a fat person. Just dumb.  ",
  "A certain portion of the populous will always use good things for bad reasons.   That’s why they are called criminals.  ",
  "That’s so evil there are no words to describe.  Very proud Of you.  ",
  "Several groups of people will NEVER have even an open mind much less a positive view on guns.  Not even worth the effort to try.  I don’t even attempt to change hearts and minds anymore.  They’re too far gone to the anti-gun movements that it’s worthless to make any more attempts.   ",
  "Given that local law enforcement do not have access to the NFRTR database this is a non issue.   They cannot look it up through their dispatcher.   Only the BATFE Officer can search the NFRTR database for NFA registration so you’re 100% in the clear no matter what.  ",
  "Your opinion means zero to me.   ",
  "We have a ruling. Go read Public Law 111-272 that was signed 10\/12\/2010 by the President as an update to LEOSA.  ",
  "Thank you!!!",
  "Criticize me all you want.  These people said something about my daughter.  Big difference. ",
  "The Dems will likely be in charge for the next 50 years.  Sadly. ",
  "Give exact names of cans please.  Want to look around and need rifle can names and\nModels ",
  "I lost all my guns in a tragic boating accident so I’ll never have to worry about carrying appendix carry.  ",
  "Trust me. NO ACADEMY was as bad as OCS when I got commissioned and I was a prior E-5.  Was awful.   I went through MCRD in San Diego for 14 weeks and I would’ve gladly done that twice than go back through OCS.  if any of your academies are like that for the live-in ones then I feel bad for you. ",
  "Best advice.  Keep your eyes open and your mouth closed.  There’s a reason you have two ears and two eyes and two nostrils but only one mouth.  Keep that in mind. ",
  "I always find it funny that the very people that always says “machine guns are a bad investment” are the very people that don’t have them and typically can not afford them.  \nI evidence the above by the fact that I personally have many friends that have machine guns and NOT ONE of them have ever LOST money on their purchase. They’ve appreciated in value 100% of the time.  How we the critics that say they’re not a good investment are also many if my friends.  And each of them can. Aren’t afford their house note, have literally zero accumulated investments and absolutely no liquidity.  \n\nAlways plays out exactly the same.  It’s like taking dieting advice from a fat person. ",
  "Doesn’t work that way.   ",
  "I have to clean the crap out of my .22 can.  I would rather to not have to do all that with my rifle cans.  ",
  "And over last 30 years since 1986 NOT ONE GUN has EVER gone down in price for MGs.  They’re all thousands upon tens of thousands higher.  All of them.  ",
  "I also invest in markets and 401k.  I diversify.  Machine gun only part of portfolio.  ",
  "I’ll answer.  Not one. ",
  "If he is a gun guy go pay for a two hour machine gun rental with all the ammo he can burn in that time period. Hell love it. ",
  "And another blocked one. ",
  "Another moron gone. ",
  "Wait until you try to get a firearms or CCW card in a Maryland and then you’ll see what I mean sir. ",
  "Every society has misfits.  They do not represent the whole of our country.  Not by a long ways. ",
  "And then another one blocked.  You people are unreal.  The fact that your mother never taught you about how you should not ever talk about someone’s daughter cleats my mind if any indication if your civil nature.  Good riddance. ",
  "Pretty sure they don’t allow people to own guns in Maryland. Lol. ",
  "Our nation is NOT an embarrassment.  For the most part we are kind and welcoming.   Turn off the news and travel to see the real people of our America.  \n\nAnd since you’re against your own country simply leave.  No one is stopping you.   Renounce your US citizenship and haul tail.   ",
  "Yes, some of us do.  ",
  "Yeah pretty much same here.   ",
  "Gun show (cause can barter and haggle deals) and a Glock 19.  ",
  "I have like 15 pair and change colors and coordinate daily so the whole world knows I have three EDC guns. \n\nOk not really.  ",
  "Hakuna matata. Thank for keep g me straight.  Lol. ",
  "I have that one too.  Works great!",
  "Ugh. Sorry wrong one. Meant Obama.  Either way still President signed it into law. Go look for yourself. ",
  "And another blocked user.   Y’all are adding up. ",
  "You’re 100% correct on the last statement and I do bet on that!!   There is NO WAY in our current legal and POLITICAL environment in the US that is growing more and more anti-gun by the day that the NFA and DAMNED HELL NO ON THE HUGHES AMENDMENT ever being changed.  You’d have to be crazy to think that’s going to happen. \n\nYour wet dream you speak of is NEVER going to happen.  Our great grandchildren will be dealing with the NFA.     And if they try to ban them outside mine will be tragically lost in a boating accident.  ",
  "Oh it’s obvious this Sub-Reddit ONLY cares about CCW people (save a very limited few) and that officers being honest about a circumstance have zero chance of saying such.    \n\nAnd thanks for the vote.  ",
  "And there’s another blocked one. Later. ",
  "Very nice!   Glad to hear you loved it. ",
  "Trust me, the brisket here in south Texas is AWESOME.  No doubt about that. ",
  "Completely ashamed of BOTH parties in this.  The state of California represented by this officer along with the truly pathetic statutes, and the the applicant who clearly did this recording as a stunt.  This is horrible all around.  But what I can’t wrap my head around is that people actually want to live there.  I have only been to California once time.  Was there was 14 weeks at MCRD San Diego.  Let’s just say I did NOT like California during my visit.  ",
  "Since you ask here’s the Texas answer.  BBQ!!!!!!!!!  And cold Shiner Bach Blonde to go with it!  ",
  "Shots fired calls by the BOATLOAD on July 4th and New Years Day!   Given that America is one of the few countries on Earth where we still maintain guaranteed personal ownership of firearms it is common to get THOUSANDS of these calls in an large city area. The citizenry are usually too stupid to know the difference between fireworks and gunshots.  So they call us to investigate each one.  Of course we really don’t. ",
  "You can also go old school and carry Winchester Ranger T-Series.   Very capable rounds.  ",
  "Hornady Critical Duty    Stuff is AMAZING ",
  "Clearly\nYou’ve never experienced Texas.   ",
  "Hahahahaha.  Yep agreed.  ",
  "A few thoughts.  Train with Winchester white box 115gr ammo and carry Hornady Critcal Duty +P. \n\nYou should shoot your carry Ammo once a quarter to keep your practice like the real thing.  It doesn’t matter to the ammo cause your carry ammo will last a LONG time without changing out. But what matters is that at the range your firing duty ammo for when the defense attorney questions you on why “you have never fired your duty Ammo for practice...do you ever fire it?  \n\nThey are completely meaningless questions but the lawyer will harp on EVERYTHING when and if you ever shoot anyone.  ",
  "My HTA Kestrel 9 is fantastic on 9mm.   The best part is that it’s rated for all the way up to .308 supersonic.  Built like a tank.   ",
  "I use water.  Works fine in my HTA stainless Guardian SS",
  "Hybrid or Griffin Optimus. Either one will be perfect for your scenario.  ",
  "And that explains it all.   Youth.  Good grief.  ",
  "And exactly HOW is a Canadian officer going to have access to NCIC?   ",
  "Remember that they’re have appreciated over 5,000% in the last 30’years.  They’ve NEVER gone down. Not ever.  Tell me any other investment that can say that.  ",
  "How old are you?  Be honest. ",
  "Includes the carry of ammunition “not expressly prohibited by Federal law or subject to the provisions of the National Firearms Act.”  Federally legal ammunition, such as hollow-point bullets, can be carried where state law would normally prohibit it (i.e. New Jersey).",
  "Includes the carry of ammunition “not expressly prohibited by Federal law or subject to the provisions of the National Firearms Act.”  Federally legal ammunition, such as hollow-point bullets, can be carried where state law would normally prohibit it (i.e. New Jersey).",
  "Y’all are all dead wrong.  LEOSA under Public Law No.111-272\n\nIncludes the carry of ammunition “not expressly prohibited by Federal law or subject to the provisions of the National Firearms Act.”  Federally legal ammunition, such as hollow-point bullets, can be carried where state law would normally prohibit it (i.e. New Jersey).\n\nThe above amendment to HB218 under PL111-272 was signed by President Bush on 10\/12\/2010 into the federal code.  ",
  "LEOSA covers any Ammo that is legal under federal\nLaw.  Our DA specifically some of the US Attorney in Dallas about this very issue.  ",
  "He’ll be PERFECT with a Glock 19.  Lol. ",
  "There’s the most accurate comment I’ve seen in a while.  100% true.  ",
  "2-Charlie-8 to 2Charlie96.   Go car to car.   2Charlie96 here, go ahead 8.  Ummmmmmm, sarge, think I have a problem.  ",
  "Ok.  The sad part is that they’re are truly people on here dumb enough to think that was serious.  Unreal.   ",
  "Haha.  Mine too. ",
  "Otherwise it’s a gun locker.  ",
  "Armory in 2018 = cross bolted triple locks.  Inventory systems.  Video cams.  Authorized party entry.  FEL level 5 or better, depending on if above or below ground.  ",
  "Not shaming.  Promise.  I just want to see a civilian armory.  I have seen some good ones in my time.  Hoping yours is awesome too. ",
  "You have an Armory?   A real one?  Not some closet with a deadbolt.  A true military grade armory?  I’d like to see that. ",
  "Another one blocked.  Oh and go tuck yourself ",
  "Another one blocked. ",
  "Omg how did you know?!?!!!!",
  "Blocked ",
  "Nice weapon. ",
  "And the wicked witch in the show\nIs sexy.  Don’t judge.  Lol. ",
  "YamYoshi.  Okay since you’re Japanese and clearly not a US citizen I’ll explain. It’s a southern thing called a shotgun wedding or date.  It’s a long running joke in the US.  So once you’re finally here legally do yourself a favor and lean US customs.  Otherwise you look stupid.  And harassment is not a legal term.  It’s called\nStalking.  ",
  "Wife’s phone. ",
  "So instead of a joke your thought is that I would actually go use a shotgun to point and harass a teenager.   Are you dumb?   What country are you from?   India?  Zimbabwe?",
  "Jails.  Courthouse.  Psychiatric centers.   Post office.  Keep going.  Your list is missing a WHOLE LOT of places ",
  "The fact that you think I’d point a shotgun at a prom date clearly says your mentality and mature level.  You probably don’t need to be in law enforcement or ever have access to gun.   ",
  "Two things.  1.  You’re Canadian do you are not a US citizen do you mean zilch.  2.  I am more of a gun fanatic than anyone you likely know.  I believe that they should teach gun safety in elementary school and hand out AR15 to each kid at high school graduation.  \n\nSo go and also someone else your completely dumbass question.  ",
  "???   No comprende.  ",
  "One but would love to have a double. ",
  "Very true.  Most don’t. ",
  "No state is free.  Whatever state you’re in there are still many, many limits.  ",
  " Do tbats all you got outta that photo??",
  "Exactly.  They have zero sense of humor and fun.  They are petty.  ",
  "Hahahahaha. True!",
  "Omg that scary.   But likely true and probably to get worse. ",
  "And there’s another block user.   Do yourself a favor and us a favor.  Go away.  ",
  "Ummmmmm. The fact that you though I was serious says you’re 14 years old. Get off Reddit and give the\nPhone back to your mother moron. ",
  "Don’t judge.  Great show!!!  The witch is super hot. ",
  "Hahaha. Deal!",
  "Omg moron.  No.  Good grief.   Jest and sarcasm is clearly lost on you. ",
  "People as dumb as you are should never have firearms. ",
  "Agreed.  The kid stuff is the worst.  ",
  "You’re mother should’ve aborted you ",
  "You need Christ.  Your future is going to be rough. ",
  "Hahaha. For my little son. ",
  "Come on down!!!  More than happy to hab you in Texas. ",
  "Fair enough statement.  But why?  Why live there?   Place smells.  And no one owns trucks.  And costs $1.5 mill for a SMALL house or condo.  No way. ",
  "Silence.  ",
  "Ha. All good points.  I’m a loser. ",
  "Hahahaha.  True ",
  "We are only exempt from a very few laws and only because of our employment.  \nThink of this example.  If you work at Six Flags or Disney World you get to get in for free when you want to go visit on your day off.  You don’t pay for admission. The rest of the public citizens don’t ha e that right.   Same for officers where they work in some states that have ten round limits.  Just sort of the job.  \n\nNote:   I am a BILLION PERCENT against magazine capacity limits in ever way.  We don’t do that shit in Texas!!!\n\nAnd before you respond I am NOT comparing Six Flags admission with gun rights.  It’s called an illustrative example to show perspective.   ",
  "Here’s reality.  I’ve been to a whole lot of shooting scenes.  By both officers and criminals and average joe citizens.  Vast majority only fire a few rounds.  Usually less than four.  There are times when the entire AR “clipizine” is emptied.  But very rare.  \n\nThe reality is that if officers only had ten rounds wouldn’t matter either.   I have fired EXACTLY ONCE in over 25 years.   Shot a dog four times with Number 1 buck 12 gauge.  Was ugly at very close range (less than five feet).  Wadding and was stuck in dog’s fur.  \n\nSo if you wanted to limit to 10 rounds for officers wouldn’t make one but of difference the vast majority of the time.  ",
  "99.9999999999% of us are pro gun.  Just not pro gun being used against people or in a dangerous manner.  The funny part is that the overwhelming majority of the time guns are NOWHERE NEAR the most dangerous part of an officer’s job....car wrecks are.  Way more officers die in car wrecks and commit suicide than are shot.  Way more.  Oh, and McDonald’s and Burger King kills a lot of officers.  And smoking.  ",
  "Don’t judge the bath and body works lotion.  Makes skin soft and supple.  Lol. ",
  "And for the record. Not once have I ever arrested someone for simply HAVING a gun.  Not once.  That is very different than a citizen USING a gun.   (Note: felon is possession isn’t just “having”). ",
  "They’re really mine but don’t tell everyone cause usually say MY WIFE’S!!  ",
  "Thank God!",
  "And yes I will be following her in my patrol car.  And yes I ran a CCH on him.  And yes everything else you’re thinking right now I am prepared for.   ",
  "At least you’d hope we are citizens.   Lol. ",
  "Been an officer for 25 years.  No problem with armed citizenry.  Long as they don’t break laws USING said arms.  ",
  "Okay. Back paddle a little.  In Texas constables are same full licensed peace officers as any other officer. They patrol and write tickets and make arrests.  But they also have an additional duty that very few other officers have. They assist civil law.  They serve writs and bankruptcies and also are bailiffs in civil trials.  \n\nThe word COP literally means constable on patrol.   ",
  "Yeah there are a few jurisdictions difference but mostly same as any other officer.   Constables focus mostly on civil law.  Like service for bankruptcy or bail hearings or jury summons. ",
  "They didn’t even investigate?   Weird.   Our District Attorney would have flipped out.  ",
  "Ehhhhh that is actually pretty rare.   ",
  "Same here.  Omg she’s unreal ",
  "Being shot first means going to hospital and not to the local precinct for interviews.  HUGE DIFFERENCE ",
  "Very rare that someone doesn’t.   Think of it this way.  If you were a homicide detective would you rather interview on the side of the road in the middle of the night or in an office where you can record the video and control the environment IN CASE SOMEONE IS NOT TELLING THE WHOLE TRUTH??",
  "You’ll be fine.  You’re over thinking this.  Promise.  ",
  "Yep.  And vast majority have no clue what constables do.  On Texas they’re full peace officers.  No different than any other officer.  In some states they aren’t.  ",
  "Yeah the attempted robbery would have made a good shoot.  Hair pulling.  Not likely.  ",
  "Trust me.   EVERYONE that shoots someone else takes a ride down to the homicide 4th floor for interviews.   No detective will simply let you sit st your house and have a beer and smoke a few while they process the dude you just drilled.  They take your weapon. Your ID. And then handcuff you and take you to homicide to left them figure it out.  The reason is that there is no way to truly know for sure on the scene at 3:00 AM whether you’re a victim or a party to the act. And yes, happens all the time in America where the so called “defensive shooting” wasn’t so defensive.   Seen a lot of drug dealers claim that.  ",
  "Punched is different from AND TRIED TO STEAL. that makes robbery.  You’re mixing two things together.  \nMisdemeanor assault is not the same as felony robbery.  \nI’d gladly use deadly force in a felony robbery.   \nBut I am discussing ONLY simple assault during a fight.  \nYou generally are not authorized to use deadly force to stop a fight where NO OTHER FELONY is happening.  Once it becomes AGGRAVATED ASSAULT then obviously that’s different.  The robbery also makes it different. \n\nWhat I cannot understand is how many people on here believe it’s completely lawful to use deadly force during a misdemeanor simple assault like a fight with two people where no other felony or weapon is being used.   Unreal.   \n\nWhat that really tells me is that most of you carry a weapon because of your safety but you’re unwilling to take measures to NOT have to shoot someone.  Zero de-escalation techniques and not willing to use the use of force continuum to match level of assault with level of response.   Just sad.  You’d make it ten minutes on the street on patrol.  ",
  "Blocked ",
  "That is wise.  Diffuse and remove.   Because shooting if they do not ACTIVELY pose a serious threat will end badly.  Civilly and criminally ",
  "An attempted string arm robbery is quite different than a fist fight.  One is simple assault misdemeanor and the other a Felony 3.  \n\nBut again. If only a fist fight and the other party is not actively committing a FELONY assault then I suggest you not shoot them. ",
  "What idiot taught your legal course at CCW school?  You generally speaking cannot shoot someone just because you get into a fist fight.  ",
  "100% right.  A physical THREAT does not justify deadly force.  Do you want to go to prison??",
  "Yeah exactly that.  Would’ve slept off my shift ",
  "I am eating a donut right now fucker.  ",
  "George Jerome Moore.  Otherwise known as “Peter Pan”. That was his Vice Lords name in a place called the “Washington Addition”. It was the worst run down drug infested shit hole imaginable. And Peter Pan was the lead dirtbag of them all!  He finally got 35 years in prison for robbing and shooting a white girl during a carjacking in Madison County.  He’s been there for over 19 years and NOBODY misses him.  In fact when he gets out he’ll likely go straight back there.  \n\nAre shift sergeant and LT had a standing order that Peter Pan was to be arrested on sight for whatever.   Fucking jaywalking if need be.  ",
  "Uh. Typo.   You’re.  ",
  "Do you know the difference between assault and aggravated assault??  Honestly asking. Because some CCW classes don’t differentiate. ",
  "As long as you’re physically able to defend yourself. If at any like you are in a position where your weapon can be taken away. \n",
  "157",
  "Yes.  It is not LIKELY that a simple punch in and of itself will cause death or great bodily injury.  Black eye.  Yes.  Swollen eyes and face. Yes. But not likely to blind you. Or to kill you. Or to cause a severe injury.   \n\nIf a simple fight where a lunch is thrown were cause enough for police officers to draw their weapons and fire then there would be DOZENS of police shootings every weekend in America.  Or thousands.  We get into fights all the time with people that REALLY don’t want to go to jail.  That does NOT mean we can simple shoot them for fighting. \n\n",
  "And another blocked....",
  "Likely justifiable.  ",
  "For AFOSI we sure did a whole lot more than that sound our pistols.  ",
  "If you have CCW insurance I suggest you call their attorney and ask them if a simple punch is grounds for you to use deadly force.  Tell us what the attorney says afterwards.  ",
  "And yes.  Clearly one punch homicides do happen. But they are the clear minority of assaults.  Wayyyyy less than one percent of actions in a fight. ",
  "If I used that in court every time I got into a fight where dude didn’t want to get out into cuffs I would lose my police certification and certainly be charged.  ",
  "Administrative rules.  We must follow. ",
  "Some drunk guy pushes you in a bar and instead pushing him back or off of you instead you use deadly force.   Not a good plan. ",
  "Let me get this right.   You’re saying simple assault that MIGHT lead to a one punch homicide deserves deadly force.  \n\nThat would go against every single use of force class at the academy   And the courts.  ",
  "I am just amazed at the number of people on here that IMMEDIATELY jump to deadly force when they encounter a physical threat.    ",
  "And blocked....   later. ",
  "Never said they should be allowed to escalate. Only saying the law says you must only match resistance if that agression with the same level.   Google Use of Force Continuum.  ",
  "Goure very welcome!!!    :-)",
  "They are not compelled to arrest.  But look at it this way. How many times has “self defense” later been proven to be homicide?   They “detain” the shooter until homicide clears them after the initial interviews at the scene.   I make ALL SHOOTERS sit in my car in handcuffs until determination is made. ",
  "Two girls get into a fight outside a bar cause they’re drunk and upset over a guy \n\nFirst girl starts pulling the other girls hair because that’s how girls fight. Other girl pulls out a gun and shoots her for pulling her hair.  Guess who gets charged??",
  "Almost zero unless it lead to a felony.   And how long ago the ex wife was.  If over five years ago almost zero.  \n\nIf last month then that’s different.  ",
  "Agreed.  However view it this way.  If every time an officer on the street had their hair pulled they shot the suspect then there would be a WHOLE LOT more OIS.  a simple fight or hair pulling usually is not enough for deadly force.  ",
  "A physical attack is NOT enough to use deadly force in most situations.  Otherwise every time an officer got into a fight on patrol duty they’d simply shoot the suspect.   A fight it not enough. Must be in reasonable fear of serious bodily injury or death. ",
  "Bwahahahaha.   ROOKIE!!!!",
  "It is questionable whether the grabbing of someone’s hair truly constitutes “severe bodily injury or death” as required under Graham vs O’Connor rule.  Would have to depend on the particular circumstances of this individual situation. ",
  "Yes, totally agree!!!!!!!!!!  Dumb. ",
  "Hybrid or Griffin Optimus ",
  "The Founding Fathers thought it was okay and so do I. ",
  "Agreed!",
  "It goes EVERYWHERE I go.  ",
  "Flew into Newark in 1999 for a murder trial.  Dude I arrested during a traffic stop has coke and a gun.  Found out the gun was stolen in Newark NJ during a robbery.   They flew me there to testify st the guys trial for the robbery that I recovered the handgun in his possession. \n\nWhile there went out to dinner.  Holy crap.  Place was like the damned DMZ.  gang bangers everywhere!!!",
  "I have spent one day in my life thus far in Newark.  NEVER happening again.  Thugville.  ",
  "And yet people continue to VOLUNTARILY live and go there.  Very strange.  At this point if they stay they can blame themselves.  ",
  "And cats.  Definitely shoot the cats cause they’re dangerous too.  ",
  "Yep.  They exist.  In the Federal government it’s called a TSP.  for state teachers it’s called a 403b.  \nYes they definitely exist.  ",
  "Gorgeous.  Only word to describe (no homo)\n\n",
  "Best retirement.   Best 401k plan.  Take home car?\nCivil service??",
  "Haha. Thanks ",
  "Hell no. ",
  "Hahahah.  Same here.  ",
  "Hate the Cowboys.   Lol. ",
  "Thin the herd.  ",
  "And then if not covered under civil service he fires them all.   ",
  "That is a direct question on your 4473.  When anyone renounces their US Citizenship that immediately makes then ineligible to further own a firearm.  In fact, in the NICS database there is a listing that is updated every year from the US Dept of State fir those that have renounced their citizenship so that they will no longer pass the NICS check.  ",
  "Hakuna matata brother!",
  "Anything and everything dealing with the NFA ",
  "I am NOT bitching or judging. Just remember.  Alcohol and firearms do not mix.  Start this licensed experience and long journey being a responsible gun owner on the right foot sir. ",
  "Exactly",
  "Welcome to the club brother.  ",
  ".....small dick. ",
  "I gladly gave you an upvote.  And you’re right.  Totally selfish. ",
  "And it’s not shooting for the heck of it.  It’s shooting to tell the defense attorney on the stand “yes, I certify that I shoot with my duty ammo once a quarter like all other officers here”.   \n\n",
  "Because they pay for once a quarter.   I shoot wayyyy more than that ",
  "Haha.  I know.  ",
  "When I do my LEOSA qualification I just shoot mine.  Qualify once a quarter.  ",
  "My recommendation is to do what we do in the department with our carry rounds.  We shoot our carry rounds at qualification once a quarter.  Three shoots a year are day and one shoot is a night one.   On EACH quarter shoot off all your carry rounds as if you’re qualifying and then buy a new batch and load up.  \n\nThe price of full carry Ammo once every quarter is not prohibitive to most people to replace their carry rounds.   Three mags of 17 rounds + 1 in the chamber = 52.  Means buy two boxes of shells unless you have a few left over somewhere.  ",
  "Why not include my M2 .30 FA Carbine in there??!!!!  Lol.  She runs pretty well for an old girl.  ",
  "And there’s another candidate to add to my blocked list.   Thanks bro.  ",
  "You’ll have to work a little harder.   Been called much worse by a much higher class of person than yourself.  ",
  "Here’s a tip.  Do nothing to give probable cause to get pulled over.   That’s your best bet.  ",
  "Ok. Just to make 100% sure the issue is clear here.  When we run a “background”’check on an app it is known as a CCH (computerized criminal history) and its done through NCIC.  This is done through the FBI data center.  The TX DPS gives us access also to the TDCJ supervision database and this search is computerized.  Only arrests, convictions and prosecutions for Class B or higher are in any of these databases. \n\nAll of these searches take only a minute to do.  Here’s what takes FOREVER.  Your fingerprints are sent to the FBI and scanned by AFIS.  the scan gives back a percent match and confidence level.  It also gives the fingerprints examiner the card to then physically scan to 100% verify the AFIS match was correct (assuming you were already in there for some reason)\n\nThen the CCH is viewed to make sure there are final adjudications and dispositions to each and every charge or arrest.  If not, then the arrest record and court docs must be requested from that agency to determine final status.  Example:   An arrest for marijuana is in there but no final disposition.  This could be a misdemeanor or a felony depending on circumstances and the investigator needs this info to determine eligibility for the handgun license.  \n\nNow multiply all of that times the HUNDREDS OF THOUSANDS of FBI and AFIS requests received monthly and the thousands of CCW and LTC license requests received by the state.   \n\nLong process.   And each is done through snail mail to get records because no adjudication can be left unfinalized.   \n\nAnd this process is EVEN LONGER when you add in the people applying for NFA Title 2 Firearms.  \n\n",
  "Hahaha.  Have yourself a deal!!",
  "OC BUKKAKE.  ok bro I am stealing that one for my next OC training class.  That’s funny as shit.  ",
  "When we quality once a quarter at the range we do the three and seven yard instinctive drills.   Two round quick burst x5 while doing instinctive shooting.  We try to hit center mass with no aiming.  No sir drills are very effective.  \n\nOur department will do night shoots where we out black tap over our trijicons and fire at the 3 and 7 lines.  Quite effective and pretty fun.   They play very loud music over the intercoms at the range and then make pitch black dark.  Then turn on patrol sirens and blue lights and then yell “FIRE”.  \n\nIt is a damned good time!!!",
  "The antis would love that photo.  Shows a clear photo of the serial number so they can call it in stolen!\n\nYes, they do that shit!",
  "Take your weapon anyways.  Fuck em.  ",
  "We already have a registration.  It’s called the NFRTR and I despise it.    ",
  "Remember, that is a skewed number because almost all police officers in Texas have our LTC.  Here’s why:  if we use our department letter to buy a weapon we still have to do the NICS check.  However if we use our LTC any time we buy a weapon we do not.  \n\nSo the reality is that number is completely skewed because the.vast majority of peace officers are also LTC carriers.  There more than a hundred thousand officers here and most of us have our LTC. \n\nIn your percentage did you back out the number of officers without the LTC?   What amount is that?  What percentage does?  What percentage does not?\n\nSuggest you do some more research.  ",
  "Daughter said well over 90% of those that left ditched ",
  "A million percent agree!!!",
  "Steele High School here in Cibolo had a walk out.  My daughter said roughly 50% participated.  \n\nShe did NOT!  ",
  "Agreed. Have carried Glock 19 on duty for years. Do not mess with trigger.  Keep stock. ND’e happen when you jack with triggers. ",
  "She looks great!",
  "Glock 19 with my HTA Kestrel 9",
  "Depends on laws.  The carrying of a deadly weapon of ANY TYPE in some jurisdictions is unlawful.  Some jurisdictions define the ASP baton singularly.  "
]